{"text": "gute lage im stadtzentrum. shoppingmeile und sehenswürdigkeiten, sowie gute pubs in laufweite. das hotel ist neu, gut gepflegt und hat bemühtes/nettes personal. ideal für einen kurztrip nach edinburgh. längere aufenthalte eher nicht, da die zimmer recht klein sind.", "id": 0}
{"text": "Beautiful space, great location, staff rock. Tiny room, but this was expected. Bathroom amazing. Walls, however, paper thin, which is why I can barely string a sentence together in this review.", "id": 1}
{"text": "First time at this group of hotels. Pretty new, only one in UK, another to open in Edinburgh and one in London. Rooms not very big but great price and location for a weekend in Edinburgh. Rooms clean, comfortable, good shower and free wifi!", "id": 2}
{"text": "Sometimes the food is spot on and delicious and other times it is quite salty at this location.  Very difficult to get a consistently good meal.  Menu items add up quickly.", "id": 3}
{"text": "Found this the other night.  It is the PF Chang fast food option and it worked perfectly for us.  Limited menu, but lower prices. Very basic decor, but clean and fast seating.  Lettuce Wraps just as good as Chang's.  Very busy, especially the take out.  Glad to have it close", "id": 4}
{"text": "I had the garlic ginger broccoli chicken and it was not very good. The broccoli was hardly cooked and the sauce was way to sweet. Everything else was great. I will give them a few more tries before I write them off as another crappy Asian restaurant in Surprise.", "id": 5}
{"text": "1st! Place is not closed. There was an issue with legal workers in the franchise chain. Now they are back! Food is one of the best! Especially their chicken mango! Daughter is a huge PF Chang fan, so she loves this place also! Her favorite is their Mongolian beef, and noodles! They are always coming up with something new, so you may have to try them more then a few times.", "id": 6}
{"text": "Definitely not a fan. Coming from Orange County, CA, I have high expectations when it comes to Asian food.  Suffice to say that Panda Express would have been a better choice, which is pretty sad.", "id": 7}
{"text": "1st visit had the lo mein...delish!  \n2nd visit had the teriyaki...fine if you like salt.  Ick!", "id": 8}
{"text": "As a vegetarian, it can difficult to find places with good options, but I love getting a tofu bowl at Pei Wei. The first time I had it, I had to double check because it looks and has a similar texture to meat, but it's great. I love going to Pei Wei", "id": 9}
{"text": "Typical big business chinese place. Slightly fancy but very average food. Kinda like a fast food place.... you walk up and order then get your own drinks etc. Portions are very small. Prices are higher than average.\n\nThey offer a few different vegetarian options but it all tastes pretty bad\n\ndo yourself a favor and also support a local business and eat at big buddha around the corner. Its much better food", "id": 10}
{"text": "This is pretty good. My wife and I usually split lettuce wraps and an entree of some sort. It's convenient to be able to order take out online. Overall, if I'm really in the mood for chinese food I'm going to make the drive a little further out to Big Buddha on Greenway and the 303, but this is a good substitute as it's about 1 minute from my house.", "id": 11}
{"text": "Food is good and consistent and the service is always great. I've never dined in, but get take-out fairly often. I love being able to just say \"same as last time\" when I call it in. Not as good as PF Changs, but certainly better than most other Asian-ish places in Surprise. Be aware that they use shitake mushrooms is almost everything, but they are fine with custom orders if you don't want them. All in all, it's not my favorite place, but I always enjoy it every time.", "id": 12}
{"text": "The hubs and I dined at the Glendale location about two years ago. i guess we were hoping it was like PF Chang's....but unfortunately were dissapointed.\n\nWe discovered the Surprise location a couple weeks ago and decided that tonight we would grab a quick bite. The hubs ordered Mongolian Beef (his fav at PF Chang's) and I ordered my \"tried and true\" Ginger Broccoli and Chicken.\" Of course we started with the Lettuce Wraps because honestly...they are just the most delicious things ever!\n\nTonight we were pleasantly suprised that the food was quite delicious. Although the dishes are EXACTLY like what you would get at PF Chang's they are scrumptous in their own right. The only downfall is that the noise isn't conducive to conversation.  I haven't been to an establishment this noisy since Buca de Beppo's...which I love (don't get me wrong)!  But I will say (on a positive note) that the customer service is fabulous! Something that can be hard to come by at times...\n\nAs for price....$28 bucks for the two of us including an appetizer, two entrees and two drinks. (coke and iced tea...with free refills) Seems a bit pricy to me but honestly....EVERYTHING is expensive now days. \n\nOverall, try it out...they offer take out too so you can enjoy great food in the comfort of your home....without all the noise! (or they have a patio you can dine from)", "id": 13}
{"text": "Very clean and staff is always friendly. I usually order the honey seared chicken but decided to switch it up. I ordered the Thai dynamite and it had a weird, almost chemical taste. I will go back but will stick to my usual order.", "id": 14}
{"text": "If I could give no stars I would. My family placed an order to be picked up and were told to be there at 7:20. We get there and I sit waiting for the food until 8! Nobody acted like it was a big deal when I told them and just said \"oh.... Well we are running behind.\" Um okay?! We get home and they forgot to put the crab puffs in my bag. Didn't bother going back and moved on to our meals. My honey glazed chicken was average, edible. My husbands sweet and sour chicken was so soggy it was disgusting! Couldn't even eat it. My daughter loves fried rice and wouldn't even eat hers, it was so greasy. We all ended up eating PB&J's and it was 100x better than anything we brought home.", "id": 15}
{"text": "I went to Surprise Pei Wei Restuarant tonight on Bell.  This was my first visit to a Pei Wei.  I was very impressed with the atmosphere, food and staff.  The chicken teriyaki with fried rice was DELICIOUS.  The spring rolls were delicious too!  Your Pei Wei location is my new fav restaurant..", "id": 16}
{"text": "Everything was good except Thai chicken wraps. Too much cilantro, absolute overkill. I think long stems is just yucky, cut them off!! Korean beef was ok but just missed the flavor I'm used to in this dish. Service is always spot on.", "id": 17}
{"text": "The food is great and customer service is the best! The Dan Dan noodles are dynamite but they come standard pretty spicy...  I placed a pick up order by phone and asked for them to be mild, but they ended up being  spicy!  When I got home and tried to eat them they were too spicy.  I called in and spoke to the manager and he took care of it completely and replaced the order for me at no charge!", "id": 18}
{"text": "My wife wanted to try this place for awhile now.  One of her brothers friends used to be a manager of one in Colorado too.  Tonight we decided to try it out.\n\nI placed my order online.  Easy process.  My wife went with an order of Chicken Lo Mein and I went with Sesame Chicken/Steak with fried rice as well as an egg roll and 2 pot stickers.  Total for everything was $24.80 after tax.  I drove down and picked up my food.  The manager their was friendly, rang me up real quick and I was out the door in no time. This bag was heavy as hell too!   Here is how everything tasted.....................\n\nChicken Lo Mein-  Only had a little of this.  Good noodles, good white meat chicken.  My wife liked it.\n\nSesame Chicken/Steak-  I decided to try out 2 kinds of meat.  They let you mix and match which is cool...they charge you for the highest priced item.  I substituted fried rice for white rice (.99 cents extra).  This was touted as soy citrus glaze, red bell peppers, onions, scallions, ginger, garlic and chile paste and sesame seeds.  It was just alright.  The flavors didn't really do much for me.  It was a tad spicy from the chile paste but overall it was kind of bland.  I had some pieces of steak/chicken that were a bit funky too.  I would definitely try out a different dish next time here...if there is a next time ;-).  The fried rice was good!\n\nEgg Roll- Eh.  It was an egg roll.  Nothing fantastic about it but it tasted fine.  It came with a sweet mustard dipping sauce which was pretty tasty.  Usual fillings of pork, veggies etc.\n\nDeep Fried Pot Stickers-  I got 2 of these things.  They were good.  Small but good.  Straight pork filling in the middle of them.  \n\nOverall it was just alright.  I will say that they give you a GRIP of food.  The 2 entrees we got could have easily fed 1-2 more people.  For $24.80 it was a great value.  The food just wasn't the type of thing that  you would ever crave and keep you coming back though.  While I was eating my meal, all I could think of were better Chinese food places I have had before....wishing I was eating them instead.  It filled my belly, service was friendly and the value is definitely there.  I'll probably give them another try and order some other dishes to see if there is something I really like.  We shall see............", "id": 19}
{"text": "Haven't eaten at this location in particular, but in general the prices are high for what you get.  It's nothing special and any other Chinese place in the city can probably beat it in the price/quality area.", "id": 20}
{"text": "Always on point. I get the Carmel chicken.. The crab wontons are a guilt must have. And I love there  tea too. Ate her for two years and always pleased. Thx!", "id": 21}
{"text": "Then we went to dinner at Pei Wei. Not bad for an Asian fusion place. Filled with senior citizens, but that's not all that surprising. I had the Mango Thai Shrimp, apparently, which was good. Right amount of spice in the dish. Not too heavy, either. Steve and Chris had their own plates as well, both of which looked appetizing. Not crazy about the moderate wait nor the fact that strangers came up to the table with unnecessary parenting advice for Steve and Chris.", "id": 22}
{"text": "We are winter residents and always look forward to eating here when we return.  Sorry to say we were quite disappointed with our Pad Thai orders today, so much sauce that it resembled a thick soup.  The egg ingredient seemed to be overlooked and was in big slices rather than smaller curds,  when I asked a server about the sauce he replied that it wasn't really sauce but that the rice noodles were too wet.  Either way, it was not a pleasant dish today.", "id": 23}
{"text": "Pretty good food a chain. You do get a lot of food for the price. However, every time I have ordered online there has been a mistake. Sometimes they tell me they never even received my order when I received the confirmation email. Also, if you in during a busy time and have a teenage girl as a cashier, you're chances of having a pleasant experience with her are slim to none. This has happened to me multiple times with multiple different cashiers. I have spoken to the manager and he is always very apologetic, but I guess you just can't get stressed teenage girls to be nice to customers. I will continue to go here as the food is good for the price and they are relatively quick with preparation. Nice options if you're veggies as well.", "id": 24}
{"text": "What can I say, I'm a sucker for Pei Wei.  When we lived in California, I heard the place was shut down.  Glad to move back and see it open.  \n\nTake out rocks, call ahead.  They remember your phone number and name, so when you call they already know you.  They also save your last order to ask if you want the same, or to add anything to it... Nice touch.  I think I eat there too much! \n\nThe only thing I don't like, and I think I'm the only one who doesn't like it, is the soda machine.  Only because I always get a soda after someone has pumped out some nasty combination of orange soda and root beer, then I can taste it in my coke.  Wish they had some filter system.  Otherwise, I could eat here daily.  Find me here at least once a week! :)", "id": 25}
{"text": "Took the family there last week.  Ordered fried wontons, sweet and sour beef, Mongolian beef, honey crusted chicken and pad Thai noodles.  \n\nThe Mongolian beef was delicious, however the white rice was undercooked, some of the rice was hard still and crunchy.\n\nHoney crusted chicken also quite good, same story with the rice.  Same thing with the sweet and sour beef.\n\nOrdered the Pad Thai without peanuts... Son is allergic to peanuts so we made it very clear we didn't want anything with nuts.  They deliver the pad Thai with peanuts all over the top.  Sent it back and they fixed it.\n\nThey brought us spring rolls which we did not order.  We said they were not ours we ordered wontons.  They bring us the wontons a few minutes later.  The wontons are less expensive than the spring rolls, we point that our to the guy at the register and with a bit of smart-alecky-ness says that he \"let us keep the spring rolls\" and \"didn't charge is for all of our drinks\" as if he did us a favor.\n\nOverall the food was decent, the rice was terrible and the attitude of the cashier was not what I expected with a $65 food order!!\n\nI wouldn't go back for that price and food quality but perhaps we caught them on a bad day..", "id": 26}
{"text": "Pei Wei has become a favorite \"take out\" spot for both myself and my girl friend.  We drive a little further than the local Taco Bell - KFC combination fast food stop, but to eat healthier it is certainly worth our time. \n\nYesterday, after our Silver Crafting Class, we drove the 2.4 miles and not only enjoyed a relaxing healthy lunch, but then purchased \"take home\" orders so we would have our evening meal in the refrigerator waiting.  (I brought my husband home an order of his favorite Kung Po Chicken with brown rice.)  \n\nIf you haven't give Pei Wei a try, stop in some time. I believe you'll enjoy it -- that is, IF, you enjoy Asian dishes.", "id": 27}
{"text": "It's just above average.  Portions are decent and cost was ok.  Got in and out fast by phoning our order in.  Good was ok, it didn't floor me but it didn't make me not want to there again.", "id": 28}
{"text": "In Surprise this is probably the best Chinese offering which isnt saying a whole lot. I really wish there was an awesome offering out there in terms of Chinese food.. Mexican food, oh yeah, some very good places mostly but Asian, youre better off staying at home and cooking. \n\nWe ordered the Asian Chicken Salad, chicken was old and had that old gross fridge taste.. Dan Dan Noodle, the noodles were over cooked and stuck together as one large soggy noodle.. Curry with Tofu, the curry had a weird perfume taste.. the honey chicken was pretty good as well as the hot and sour soup though neither made for good leftovers. \n\nWith Surprise having so many chains it wasnt surprising to see one of these finally opening up.. a far better choice than Panda Express.. kind of sad, huh?", "id": 29}
{"text": "Been dining here since it first opened. Wife is from tx so this is her taste of home. When tx folks come to visit they ask to go to Don's. \nIt's very good tex-mex.", "id": 30}
{"text": "Kind of disappointed with the previous reviews in the area of customer service because honestly there was none. We were the only patrons in the restaurant and the waiter seemed  inconvenienced by us being there. After he took our order he went and sat down in another booth and started playing on a computer. We did not get our food quickly like everyone else has said, as we were the only people here it shouldn't take as long as it takes for me to finish my beverage. Maybe it had something to do with the fact that the waiter was farting around instead of doing his job? They got three stars because despite the service the food was AMAZING and quite inexpensive. If you order a quesadilla you may want to order a la carte items as well because the quesadilla was the size of a large Taco which is odd.", "id": 31}
{"text": "What a surprise!  The most amazing Mexican food I have ever tasted and I am a foodie. My husband and I ordered the table side guac.  Delicious!   Texas margaritas. Delicious!  Seafood burritos with fresh cilantro!  I will be salivating for them soon!  All of the food was so fresh!  You must try this place. We will try the Green Road location next as it is closer to our home.", "id": 32}
{"text": "We came here for the first time to celebrate my birthday.  We ate a ton of fresh chips in advance of the meal, the salsa was pretty mild.\n\nI had the Chori pollo, which is a burrito with chorizo and chicken with rice.  Man, it was amazing. Hot and spicy with peppers, I took some of the huge portion home and ate it the next day.  \n\nThe service was seriously, amazingly fast for a group of 4, and they kept our drinks regularly filled.", "id": 33}
{"text": "Yum!!! I love this place! Come almost every Friday. Try the Chicken Chili Verde, my first favorite dish. My new favorite, Burrito Chipotle!!!! So delicious! Don't forget the margaritas!! :)", "id": 34}
{"text": "Maybe let's work on the chili rolenos. Do nice large poblemo peppers like el rancho and you got me as a frequent customer. A+ on the guacamole! Large portion. Nice!", "id": 35}
{"text": "The food isn't bad, but every time I come here with friends they overcharge us. We end up getting charged at least a few dollars more than our menu items should be when we check out, and it's happened on several different occasions. \n\nThough the food may have been good and reasonably priced (on the menu, not on the bill), we will unfortunately never be going back. Very disappointing.", "id": 36}
{"text": "The first thing I noticed here was the decor, which I have to say I liked.  Of course, yes, I enjoy lime green walls and bright pink color washes, but that's just me.  \n\nWe had three little ones with us, so you can imagine that we were a little less than organized, but our server took it all in stride, which we appreciated.  He was also super fast; I think all of us were surprised how quickly our meals came out. \n\nAs for the food, I feel like it's a little difficult to review.  I had never been here before and my Mexican palate is less-than-sophisticated, so I randomly ordered a plain enchilada and quesadilla.  The latter was pretty good, though I found the enchilada a little perplexing.  It was hiding under the sauce and I couldn't really tell what was in it.    \n\nThe chips and salsa were great, though.  And hot.  The one person at our table who can apparently drink tabasco sauce straight even admitted his eyes were watering a little.  Everyone else seemed to really enjoy their meals.  \n\nI'm not in Ohio much, but I'd happily go back and try something else.  Oh, and um, I wouldn't exactly object to painting my living room lime green, after seeing how cool it looked at Don's.", "id": 37}
{"text": "i don't understand all of the high marks for the this place. the chips were not good and the salsa wasn't good either.. the chips were bland, old and not seasoned at all, the salsa represented canned tomato taste, yuk, the chix enchilada was flavorless, while using white meat chicken it was not seasoned and very chewy, it had no flavor whatsoever and was definitely something \"not\" to order. the  most off putting thing about the place is the filthiness of all the furniture and the fact that we had fruit flies buzzing our table thru out our meal. while el rodeo and el patron are nearby, and have far better food,i cant understand what the attraction is to this place, will not be back", "id": 38}
{"text": "On a recent trip to Kirtland, OH.\n\nDecided to try even though the outside appearance was somewhat questionable.\n\nBut nice simple decor inside.  Friendly waitress who gave good tips from the menu.\n\nWe both had the Tres Amigos.  Nice chicken, steak, shrimp combo.", "id": 39}
{"text": "Good food, great prices, large portions, fast, friendly service. What more can you ask for. We highly recommend you try it!", "id": 40}
{"text": "This will probably be my last review of this location. I was at don tequila yesterday & the cashier was talking  to me but I couldn't understand so I laughed it off. \n    \nHe told me I looked sexy today and said something else. I said thanks and laughed so that he wouldn't be offended. He came around the counter and walked up on me then hugged me so I assume he was asking for a hug. \n    \nHe then whispered in my ear that he just wanted to feel my breast on his chest. Seriously....I don't feel like I need to wear jeans and sweaters in the summer because he is a pervert. \n\nIt was very disrespectful and unprofessional and I feel uncomfortable eating there anymore.", "id": 41}
{"text": "Sometimes you need a little spice in your life. Don Tequilla delivers. The neon sign beckons you inside and once there, sit back and enjoy.\n\nThe roomy booths offer space for cozy dinner or enough room for your whole brood or gang of friends. Nibble some fresh chips and salsa while you ponder your meal options. The salsa is fresh with tomatoes, cilantro and spice. In case that isn't enough heat for you ask for the special sauce from the kitchen for extra kick and spice.\n\nI ordered the chili rellenos hoping not to be disappointed - this gal spent some time in Arizona and loves her Mexican food. These didn't disappoint. Yum. Served with rice and beans with a drizzle of red sauce.\n\nGood enough to want to return and sample through the menu -- several other items caught my eye - fish tacos, nightly specials, burritos with tomatillo sauce!!! \n\nThe staff is friendly and patiently gives you time to check-out the menu and answer any questions. nom.nom.", "id": 42}
{"text": "Why hello service. Don't let the lime green walls scare you, this place is all business. Seated immediately, the waiter came to the table immediately, and the food came almost immediately after we'd ordered. Boyfriend got a combo platter with an enchilada and taquito and devoured the whole thing. I got a carnitas dinner platter and I could only finish half since I filled up on chips and salsa and guacamole. It was so good! \n\nThe only disappointing part was the dessert. We ordered flan, and when it arrived it was covered in whipped cream and strawberry sauce which I am not a fan of. The consistency was nubbly. Should've went with the churros.", "id": 43}
{"text": "Passed this place a few times and finally decided to try it. I got the #17 on the lunch menu. It was a burrito  with eggs, chorizo and cheese.  It was probably one of the most tasteless burritos I've ever had. It was covered in what appeared to be some sort of franks red hot sauce, and no im not mistaking it for enchilada sauce. The side of my plate was a pile of tomatoes shredded cheese and a piece of lettuce, a whole piece not shredded. Not happy with my lunch at all. The salsa and cheese dip were average, nothing to go crazy over. Service was quick and friendly. The food came out about 5 minutes after we ordered which kinda scared me. I like quick service, but also don't mind waiting a few minutes for some really good food. Overall the place was cute, people were friendly but food was less than OK. I wouldn't go back.", "id": 44}
{"text": "This is our go to Mexican restaurant. The staff is kind and courteous and Javier is an amazing gentleman. Always prompt , fresh and delicious. Their mango margaritas and dos Equis pair perfectly with our meals. Very family friendly and great atmosphere. Really a great place", "id": 45}
{"text": "Food was AWESOME. The normal tacos are ... well ... normal and typical. My wife ordered the chicken fajitas and they were very good fajitas. I ordered the burrito durango which was a 12 inch shell STUFFED with chicken, steak, and huge shrimp! I asked for it spicy... and it actually came with pretty good heat. The burrito was outstanding, which is why I gave it 4 stars instead of 3. Overall, we'll probably be back.", "id": 46}
{"text": "Your basic traditional Mexican style restaurant, never at in only ordered out.\nMade me wait for a hand full of my orders when I came to pick it up..but super tasty. With a lot of hit and miss items in the menu.", "id": 47}
{"text": "Been here a couple times and so far every time we've gone the foods been great, the service has always been friendly and the portions are amazing!", "id": 48}
{"text": "Tacos al pastor--delish! Salsa and guacamole was very fresh! Refried beans were super good. Service was friendly and fast. Beer was cold and the bathroom was clean. What more can you ask for?", "id": 49}
{"text": "We've been going here several times a month ever since they opened. Some of the BEST Mexican food I've ever had at absolutely the LOWEST prices I have ever found for food this good. Waiters friendly and attentive. Nice decor. Nice new Bar.", "id": 50}
{"text": "for the time being, for all its worth, i am going to stick to the magical number three.  okay. lets break it down.\n\nthe service.  when we walked in the waitress seemed to be adept at being the problem solver, however, slowly this role for her, became more difficult and intrusive.  we were (ironically enough) a party of three at around one pm on a friday for lunch and there was not a three person table available.  there seemed to be only one three person table available for seating in general (lets give them the benefit and say there was 2 three person tables) and so we were relegated to a two person at the front of the restaurant decorated with a third chair.  not the best, but so be it; its one pm at a relatively new restaurant and i was prepared to deal.   i will say though, with no regret, that it is worth it for them to reconsider how many two person tables they have versus three.  if they are popular or getting to be, this is something they might need to reexamine.  the waitress seemed to be the only one serving (i would guess) the 17 tables that were almost filled at that time, and so, i can appreciate it was a hard go, but at the same time it doesnt excuse for me her terseness and impatience.  every person at a job has stress to deal with and if yours deals directly with customers, you should learn to keep the dealing with that pressure to yourself.  its not the problem of the customer.  its her job to figure out how to make that work for herself.\n\nfor lunch table 17 serves sandwiches, salads and a soup.  we each had a sandwich, a salad, a coffee or tea and the bill came out to be about 60 bucks with tax and tip.  not exorbitant and not cheap.  though im sure the quality of the ingredients used was high, the sandwiches felt like they could be made at home.  in conjunction with that sentiment i am eager to admit that it takes skill to know when to stop cooking something, to pair spices up with core ingredients to arrive at something special, and not any joe will have the wherewithal to claim he can do the same whether he thinks so or not.  but if you are going to charge me somewhere around 9 bucks for a sandwich (with no other sides except for a couple pieces of cauliflower and a sliced carrot - which were good, doused in some kind of vinegar or pickled sauce) then perhaps you should use dijon instead of yellow mustard, or applewood smoked cheddar instead of havarti.  its fair to assume for the general population that 9 bucks is a hefty price for a sandwich and with that in mind one might put their ingredients where there outstretched palm is.\n\nthat being said the sandwiches tasted great.  (one thing has nothing to do with the other should you be saying to yourself something along the lines of \"well then what the hell is he complaining about\").\n\nthe vegetables that came on separate plates alongside the sandwiches were  4 dollars each.  we had three kinds.  one was sweet potatoes dressed with chilies, toasted coriander, mint and olive oil.  another was called farro, an ancient tuscan grain dressed with extra virgin olive oil, cucumber, carrot, and fine herbs. and the last one was chickpea salad with celery, pickled red onions, rosemary, parsley and lemon.\n\ni enjoyed all of them, but they were honestly not representative of their ingredients.  i dont need to have my dishes overpowered by their listed ingredients, but if something says its going to be flavoured by mint, fine herbs and lemon dont you think you should be able to experience that as you taste it?  i think so.  again, to reiterate, i didnt mind the natural taste of the vegetable offered, but if thats the way it will end up tasting, perhaps you should say so.\n\nall my peeves aside, i am still interested in trying this place out for dinner; the feel of the place is great, cool and relaxing and as i looked at their dinner menu it looked quite tasty.  so perhaps once they get their groove on itll be more enjoyable.", "id": 51}
{"text": "Had a lovely evening last night at Table 17.  Great selection of wine and the owner made an excellent suggestion of something we had never heard of before - bearing in mind both price point, meal choices and preferences (though overall it was a bit of a pricey list, only one bottle south of $50, just).  \n\nLovely, vibrant atmosphere, the polenta was delicious as a starter (the chef tops it with a different finish every day - last night it was meatballs) - though the other ones we saw at other tables also looked sumptuous - and our meals/sides were excellent.  Also, the food prices\n\nAll in all a great evening  - could have happily ordered anything from the menu, and what we did order was delish.   \n\nDefinitely will go back to work our way through the rest of the menu.", "id": 52}
{"text": "Table 17 is a classic bistro with a very good menu, wine list and cocktail list.\n\nI've been many times for dinner as well as brunch.\n\nFood is always consistent, have never not liked anything I have ordered. \n\nDinner: have been numerous times have tried their salumi & cheese board ($15) with was good, not Black Hoof excellent, but still pretty good. Their steak frites ($21) consisting of an 8 oz top cut sirloin was cooked perfecting medium rare and served with a side of beranaise sauce. decadent and good. Have also had lamb here but it must have been a special because it does not appear on the menu.\n\nBrunch: You need to order a side of their thick cut double smoked bacon. Its to die for. They also typically have cinnamon buns at brunch that are baked in house. My favourite brunch item on the menu has to be Farmer's breakfast with consists of a scotch egg (soft boiled, battered then deep fried egg), a terrine with toast and a small side salad. Surprisingly it doesn't look like its on the menu anymore :( Have also had the stewed eggs which was also good.\n\nNote: If you are a member of Foursquare, check out their specials for check-ins, last time i was there for brunch you got a mimosa or caesar on the house with you check-ins.", "id": 53}
{"text": "I've been here for a few dinners and brunches, and it has been a pleasure every time. \n\nThe service has always been very attentive and helpful. For one of the dinners, our group had trouble deciding on dishes so our server suggested that we pick a price point and let the chef put together a menu. It was a really fantastic experience!", "id": 54}
{"text": "We had an exceptional experience at Table 17. Chef John prepared an incredible fois gras app, the squid ceviche did not disappoint... the Rainbow trout was melt in your mouth delicious and we ended our foodgasm with the dark chocolate tort.", "id": 55}
{"text": "Found this place by chance and walked in for brunch on a Sunday. There was one table available luckily. There wasn't a lot on the menu, but all the items we ordered wew so fabulous!! And very out of the ordinary. Service was good too.\n\nFrench toast with creme anglais, pastry shell with onions, pears etc... all fabulous. It's a delight for the senses, this place.", "id": 56}
{"text": "I booked the private room for a small wedding reception recently. We had 14 guests, the room was perfect. Booking was incredibly easy and they took care of everything professionally and quickly. We were even able to come in the night before and decorate.\n\n\nThe dinner was amazing. We had the family style menu, which included: kale citrus salad, buffalo mozzarella, hunters mash, green beans, polenta with lamb bolognese, braised lamb shank, short ribs... There was more, but you get it. Lots of food for every one, lots to choose from, and so amazingly delicious. Everyone stopped talking at one point, they we're too busy eating.\n\nWe had a cake of our own brought in, so we got to take the dessert from the menu home. It was amazing, so decadent.\n\nIt was a fantastic dinner at the end of a fantastic day. I don't think I could have picked a better place to host my wedding meal.\n\nMy favourite was the polenta bolognese. I could eat that for days.", "id": 57}
{"text": "We had the scotch egg and the tomato based eggs. Everything was delish!\nWhile I prefer to have my bread toasted I understand it's not the french way (and they would have accommodated if I asked!)\n\nThe potato rosti was totally worth breaking the diet for, and comes in 4 pieces and is easily shared!\n\nThe americano was outstanding they use amazing beans, and I wanted more. I had on of their $5 mimosas which is something that would keep me coming back weekly if I could !\n\nThe staff are all super lovely, and the ingredients were all do fresh (you can tell these things)\nA perfect brunch spot, no need to wait in line at the other two \"brunch hot spots\" in the area. \n\nHighly recommend this spot!", "id": 58}
{"text": "Had an enjoyable meal at this Leslieville spot. Menu is light on  vegetarian options but is otherwise diverse. The tagliatelle was al dente and did not disappoint. My pal ate the steak and frites and licked the plate clean. My pomegranate cocktail was so sweet and satisfying\n that I had two.", "id": 59}
{"text": "Considering the amount of rave reviews on here, I suggested our group of five celebrate a birthday at Table 17. Maybe it was an off night but I walked away with a bad first impression. So did my guests.\n\nThe dinner reservation was at 5:45 on a Saturday, so it wasn't like it was packed. Still took close to 40 mins until our cocktails arrived. \n\nOur server was very pleasant but the service steadily declined over the course of our 3 hour (!!!) meal. Scatterbrained service, slow bartender and even slower kitchen. It was clear the kitchen and bar were completely backed up. \n\nOur table was finished our bottle of wine before our mains arrived so I ordered another glass of wine so I could enjoy some with dinner. That glass arrived 20 mins after I was finished my main. Lots of apologies but little else.\n\nThat being said, the cocktails, hot balls and panna cotta were outstanding. And the space is gorgeous. However, our mains were overpriced and overcooked. We all cleaned our plates because we were starving (almost 2 hours to receive mains), but they just weren't great. The Halibut was the best of the bunch.\n\nConsidering the amount of solid restaurants in this city, I won't visit again.", "id": 60}
{"text": "Booked through OpenTable a few days before, for 8pm. Zipped right in to our table.\nHad the marinated olives and Diver Scallops to start...wow! The scallops were fantastic, some of the best I have had here in Toronto. I am usually not a big béarnaise fan, but found myself scraping the plate. The guanciale was a neat change too (different style of bacon).\n\nHad the pork tenderloin wrapped in pancetta for dinner, also fantastic. Well cooked and presented. Love the square plates.\nMy friend had the braised short ribs, but was mildly disappointed. Found them to be very chewy. She made up for it with chamomile grappa for dessert.\n\nThe cheese plate for dessert, was a LOT of cheese! Good size hunks of Ontario Swiss, Ontario 10 year cheddar, a blue (im not a blue fan, so didnt pay attention), a something else that was kinda gouda-esque, and wonderful creamy goat cheese. Plus bread, crackers, olives, honey and apricot jam. Massive. Took a piece of cheese with me to the car!\nMy friend had the chocolate trio. She didnt like the darjeeling sauce on the chocolate, so that kinda disappointed dessert.\n\nAll in all, i thought it was quite good, but rare occurrence in Toronto where i had a fantastic meal, but my dinner date's was ho-hum. We agreed though that we'd give it another chance based on the scallops alone.\n\nThe service we had was fine, gentleman with a bit of a british accent was quite good and knowledgeable. Too bad others had issues, thought our guy was fine.\n\nReservations are definitely recommended, was quite busy.", "id": 61}
{"text": "I'll be frank: the only way we could afford this place was due to a gift certificate from a generous wedding guest. However, the food was right on the money. Good flavor; prompt service. If you have the money, go!", "id": 62}
{"text": "One of my favourite restaurants in the neighbourhood. Food is consistent and the service impeccable. \n\nThe steak frites are the best in the city. Scallops, duck confit and short ribs are also regular favourites.", "id": 63}
{"text": "Literally my FAVORITE new restaurant in the northern hemisphere. I've all but given up on Toronto until finding this gem through a friend in New York who raved about it. \nTook my vegetarian children for dinner, and we had an absolutely outstanding experience. \nEverything from the friendly and funny staff, to the custom vegetarian dinner that the teens devoured, was spectacular. \nThe highlights: Hot balls, Brussel Sprouts, Diver scallops, Tartare, and the pasta was so light and tender with incredible delicate flavors\nKudos.\nWe'll be back soon!", "id": 64}
{"text": "The first time I came to Table 17 was a little over a year ago. I took my grandmother and my aunt out for dinner. The moment I came to this place I was very impressed. \n\nFirstly, it was very conveniently located to us. Secondly, it has this very home-y feel and decor. Nothing felt overwhelming. We came on a Monday night. (To my knowledge Sunday and Monday nights Table17 offers prix fixe menu.) We all ordered different staters, steak and different desserts! However, what made me fall in love with this place is thee amazing home made olive oil. Their olive oil tasted amazingly fresh and you can't help but eat all of their fresh bread with it. Unfortunately, in multiple occasions I've asked if I could purchase a bottle and to my disappointment they do not sell their olive oil. :( \n\nThe only thing I found about this place that did not satisfy my expectations were tht the servers are very slow and not as hospitable as other servers from my other experiences. \n\nOverall, I definitely recommend this place. Especially their duck confit which is amazing! \n\n-CL \n\nPS they take reservations and it gets pretty busy so be sure to make them. :)", "id": 65}
{"text": "On a stormy, humid night in Leslieville, my partner and I stumbled upon this welcoming looking restaurant with the rooster out front, and it turned out quite well.\n\nThough the category on Yelp is listed as French, I would say the food is much closer to Italian if you had to pick a cuisine.\n\nRight off the hop the service was questionable. Benefit of the doubt moment: it was after 8 pm on a Sunday -- which in Toronto means you're lucky if anything half-decent is open at all -- and the place seemed  understaffed. \n\nStill, having to stand awkwardly for 10-15 min in the non-foyer, while  waiters whisked by us was not too pleasant.\n\nAnd once we had a table, service continued to be spotty. Our waiter was friendly and self-effacing, calling us his \"little neglected table.\" This was not inaccurate as even getting our initially requested waters (it was sweaty out!) took nearly 10 minutes, and later he left us with dessert menus for 20 minutes before coming back to see what we wanted, our appetites for anything sweet having seriously waned.\n\nFood-wise though, things were great. We weren't terribly hungry, and so avoided the table d'hote fixed price menu going with the \"shared food\" section on the left column of the menu. It's a limited selection here, and we ordered about half of the available items, and were not disappointed. \n\nRich white polenta, brought out on a wooden cutting board was accompanied by an aproned chef who ladled a \"sugo\" of veal, zucchini and fresh basil on top. It was heart-warming, subtle and delicious, as well as a generous portion for two to share.\n\nAlongside the polenta we had two smallish ramekins. One contained \"sauce & balls\" a cheekily named but very tasty take on classic meatballs in tomato sauce. The other had what was possibly my favourite dish of the night, a simple roasted beet preparation with blue cheese. The multicoloured heirloom beets were \"al dente\" but tender and went amazingly well with the semi-melted cheese.\n\nWines were great as well. My glass of Rollegrosse red ($11) was smooth beyond even the menu description, and my companion's \"Anna 6\" white was very dry and very refreshing. \n\nIn addition to the service problems, my one other issue was the post-prandial whiskey, a single malt ($13) that came in a far-too large glass (we were informed the kitchen was \"out\" of snifters...) and which I found harsh and not to my liking. But that could be a matter of taste.\n\nTotal cost of meal for two: $77 + tip.\nThis would increase to over $100 easily if you go with the $30 table d'hote option + drinks.\n\nI would happily give this place another shot, hopefully on day where service was at full steam. Until then I can't give it more than three stars out of five.", "id": 66}
{"text": "Food: 9.5/10\nAtmosphere: 8/10 \nService: 9.5/10\nOverall experience: 9/10\n\nA lovely experience overall. Went and ordered:\n- foie gras appetizer\n- polenta (main #1)\n- pasta special\n\nAll the food was great. You could tell it had been prepared with great care and came out piping hot.\n\nThe service was also fantastic. The server was extremely helpful in selecting a wine, and providing recommendations on the menu. We didn't feel pressured at all during the meal to hurry up or order more AKA increase the bill amount.\n\nTHE BOTTOM LINE: wonderful food, and equally as wonderful service.", "id": 67}
{"text": "This hidden gem is wonderfully delicious. Ordered from appetizers to entré. Everything is great. Great service, great food, great environment. Can't complain about a thing here. Even their bathrooms are sparkly clean. Heard They're moving to another location soon or renovating. Better call ahead and ask. Duck confit and their pasta in beurre sauce is mind blowing. Worth a try If you're in the area. Something different for date night.", "id": 68}
{"text": "We were back here this evening.  Delish!\n\nI ordered the beef tartare - it was pretty tasty, large enough to share as beef tartare is both an acquired taste and fairly rich on it's own.  My main was the leg of lamb, it was a little well done for my liking, but the flavour was quite nice - the morel mushrooms were loaded with a burst of buttery flavour.  \n\nMy bf started with scallops, they were quite large for scallops, and quite nice, and had a white fish, not trout, maybe halibut, that was also quite delish.  I love the decor, and upon reading other reviews am super sad that I missed out on a group on!  It was wonderful anyway, and I think a great place to dine.  \n\nWe went for an early seating (a bit before 6), and I'm happy to report, that next time, I'll either go for another early seating or something later (after 9 in the evening), as it can get quite loud, and that makes it hard to hear your dining companion!", "id": 69}
{"text": "We went here for Mother's Day brunch.  I had a very good egg omelette with guacamole and my wife had the French toast. Very nice intimate setting and the menu has very nice choices.  We got our son a fresh berry yogurt which I ended up eating most of it because it was so good. My son was still quite happy regardless. We will definitely be back to claim our check in deal but that is not what would bring us back. The exciting dinner menu is why we will be back soon.", "id": 70}
{"text": "We had a great time. Dinner for 4 - with a healthy amount of food (or unhealthy - depends on how you look at it).\n\nThe polenta had their \"reindeer sauce\" which consisted of venison, spices, and berries. Delicious. \n\nOysters were tasty, and the braised pork was unbelievably good. No idea what they used for aromatics - but there was a hint of fennel that was incredible. \n\n$400 for 4 people and drinks. Not a value dinner, but enjoyable, and guarantees my return. \n\nOh. Peanut Butter Panna Cotta. Order it and thank me later. Servers were hilarious, attentive, and accommodating. I just can't see anything wrong with this place.", "id": 71}
{"text": "Had dinner here once and it was ok, but the brunch was great. I had the Sloppy Giuseppe - Two sunny side eggs top a crispy, fried polenta cake, surrounded by a moat of Bolognese sauce. Awesome. I'll definitely be back for that alone.", "id": 72}
{"text": "Brunchy time and we have a winner.  To start, we got a seat right away on Sunday for brunch.  I highly suggest going around 11:30 as you just miss the 12pm rush.  It is a stylish restaurant and the service was top notch.\n\nFor my meal, I had the french toast.  It was good - light and perfectly cooked.  The cinnamon anglaise tasted like melted ice cream.  There was an assortment of berries as well.  Their orange juice was freshly squeezed and we were in and out in under 45 minutes. \n\nDefinitely will be back for another brunch extrodinaire!", "id": 73}
{"text": "What an experience: from the shabby-chic decor, to the wonderful service, Table 17 was an all-around treat. \n\nFirst off the \"hot balls\" ( I know, I know), were phenomenal: arancini stuffed with risotto, another with goat cheese, and finally the crab. Each came with their own dipping sauce: amaaazing.\n\nFor dinner, the lamb tenderloin with a parsnip puree was cooked to perfection, a friend ordered the steak frites (delish), the beef tartare was tender and spicy and you can't really go wrong with an arugula salad, which was fresh and tasty. The presentation of the halibut wrapped in ramps (mild leek), was a show-stopper (as was the pomegranate mojito). \n\nGreat place for a date, for a nice celebration, or just a nice culinary experience.", "id": 74}
{"text": "Was here for my first time just last week. Loved it. It was highlighted by the Soft Shell Crab and the Hunter's Mash. Also tried my first pint of Chambly on a recommendation from the bartender. I will be hunting this beer down in other restaurants I visit. \nAlso, they are very quick to respond to any questions you have via Twitter.", "id": 75}
{"text": "Bottom line: great food, cute place, fabulous dinner. Would definitely go again. On the pricier side for the neighbourhood, but nothing ridiculous. Remember to make a reservation.\n\nWent to Table 17 for dinner last night. My dinner date and I stupidly didn't think to make a reservation at 7:15 on a Saturday night (dumb, I know). So I definitely recommend a reservation. He had been to Table 17 before, I had not. Of course there were no tables when we arrived, but the staff were more than happy to seat us at the bar, which was thankfully empty when we arrived. Usually not a fan of having a nice dinner at the bar, but the barman managed to do a good job of staying out of our face, but being attentive at the same time. Of course the seat wasn't the comfiest, but that was our fault.\n\nFood:\nThe server/ bartender made sure we knew all the daily specials and even recommended a few and took our drink orders (just beer). He also brought us a basket of bread, though it almost wasn't necessary because our appetizer came quickly.\n\nTo start we shared a Buffalo Mozzarella salad (arugula) with spiced pumpkin puree and honeycomb - yum! My date wasn't too sure about the honey at first, but actually really liked it, was a nice flavour with the mozzarella. The warm pumpkin  with the cheese was my fave part - so delish. \n\nFor my main I chose the pasta. It was capellini (I think, can't quite recall)...with gorgonzola cheese, roasted hazelnuts and I'm sure I'm forgetting a few ingredients. It was awesome - great mix of flavours and the pasta was cooked perfectly and served hot. I was skeptical about the hazelnuts at first but they were a great compliment to the gorgonzola. The portion was pretty big for this type of place, so my date had a bit of my pasta too and he also thought it was yum.\n\nMy date had the beef short ribs and said they were excellent and that the meat was falling off the bone. (As someone who does not eat beef or pork I was assured this was a good thing ha). It came with root vegetables and parsnip puree. Just as we were digging in our server brought a little bowl with extra root vegetables because the chef had suddenly realized my date didn't get enough. Once he pointed it out we realized there were only like 3 mini veggie cubes in his dish so it was nice that the staff noticed before we even did. \n\nWe contemplated getting dessert for a minute, but were pretty stuffed. Maybe next time I'd skip the appetizer and try a dessert.\n\nOnly main downfall was sitting at the bar, it's not the comfiest to sit on a stool and it felt a bit crowded when other patrons were seated at the bar. It was also a little chilly/breezy as it's near the door and it was cold out. But that was our own fault.\n\nNot sure what the total bill was in the end for the 2 drinks, appetizer and two mains, but our mains were around $20-25, some on the menu were a little pricier.\n\nOverall great food, good service, cute place, fairly priced (though pricier than some of the other places in the neighbourhood). Definitely recommend.", "id": 76}
{"text": "We really enjoyed this place.  Food and service was excellent.  Table 17 has different and unique things to try! I highly recommend the goat cheese balls, they were fantastic!!", "id": 77}
{"text": "\"Table 17 is the rare restaurant that's both a neighbourhood hangout and a culinary destination,\" is the opening line as you land on their homepage, a quote from Toronto Life from 2013.  That's a tall order to fill and sets the standards high.\n\nI wasn't a fan of Table 17 back then and I'm not surprised that my most recent dining experience was no different.  It satisfies the former part of the claim (being a neighbourhood hangout) but is far from being a culinary destination.\n\nThe kitchen seems to work along at its own pace which errs on the side of slow while servers try their hardest to service the two-roomed restaurant.  While I wouldn't say they're under-staffed I often found myself turning my head in all directions to flag our server down.\n\nA meal at Table 17 errs on the side of pricey and while I have had many expensive meals in my lifetime as a food blogger; this one definitely errs on the side of overrated.\n\nI've always lived by the mantra that if a restaurant's bread was not up to snuff that it would be an omen of the meal to follow.  Such was the case with the baguette sloppily appearing at our table; one has to ask for the communal balsamic vinegar and olive oil bottles because the servers can't be bothered to offer it.\n\n\nOysters come with a trio of condiments;  two mignonettes and the standard horseradish.\n\nWe opt for the halibut ceviche which, with its pretty plating is a disappointment as it turns out to be bland and flavorless.  The saving grace are the pea shoots, flavored with a peanut, chili and lime vinaigrette that is stellar and full-flavored.  I would happily eat a plate full of that as an appetizer.\n\nFor our mains we settle on an Ontario leg of lamb; which came deboned and served atop a bed of fava beans, roasted spring onion and butter poached black trumpet mushrooms.   Our table of 3 simultaneously shared a single thought - where's the rest of it?  To add insult to injury, the lamb was lukewarm (and the reason was in no way attributed to my occupational hazard of photographing the dish).\n\nThe Lake Erie pickerel is equally disappointing as we begin to pick at our food by this point.  The radish fennel & grapefruit \"salad\" which to me resembles more of a slaw is bland and lacking oomph.\n\nOur dinner suddenly finds salvation in the Spaghetti Al Anatra; its texture loosely reminding me of ramen cooked to a perfect al dente as the duck confit does its magic at flavoring the dish.  The crispy duck skin is a little scant but we happily devour the noodles.\n\nSide dishes are available à la carte and we opt for the sautéed kale.  It's nothing to write home about but gives us our daily dose of vegetables.\n\nAs with most things, what goes up must come down and in aviation-speak our dinner had a hard landing.  A dark chocolate torte that was reminiscent of a two-bite brownie drizzled in cheap store-bought chocolate sauce with some berries thrown on top.  The Panna-Colada was equally pedestrian as it loosely resembled those cheap complimentary desserts you'd get at the end of a Chinese dinner - all gelatin and not much else.\n\nThe message at the end of the day is - don't let the appearances at Table 17 fool you.  While everything looks great from the outside, the experience lacks substance.\n\nOur meal with 2 glasses of wine and 3 coffees came just shy of $300.  Suffice it to say, this will be the last time I dine at Table 17.", "id": 78}
{"text": "Great service, the food and drinks were a miss.\n\nLimited menu so we went with the waiter's recommendations. The hot balls we were excited to try. 1/3 made the grade. Each hot ball is something different, fried risotto, goat cheese or crab croquette with its unique dipping sauce. Loved the goat cheese and honey, the other two were okay.\n\nPOLENTA - served hot on a board with a duck confit topping, pepper and parmesan cheese. The far and away highlight of the meal. Came served on a board with a few sprigs of fresh basil and the chef served the topping at the table. Could have eaten this for dinner alone and left very impressed.\n\nMains were lamb striploin with a ratatouille and a steak with the bone left on. Both were disappointing. The steak was very tough and overdone. The lamb was tender but lacked flavor and the sides seemed to be leftover add-ons. \n\nThe recommended Malbec was spot on. The decor was interesting, low lighting and some strangely heavy music detracted from the atmosphere.\n\nOverall, I'd have to be convinced to go back. Maybe if someone promised me I could get two polenta and some wine.", "id": 79}
{"text": "Had a travelzoo voucher for this place. Went on a weeknight with my bf. waiter asked to take our coats, I paused to think if I wanted it taken and decided yes. Waiter remarks \"might as well get your money's worth, right?\". I was a little offended at the comment, I'm not going to lie to you. I am 28 year old professional but am constantly mistaken for a teenager- I think he judged us based on my \"age\" and our voucher. \n\nAfter that initial snafu his service was fairly good while he was around. He seemed genuinely interested in our opinions on the menu and food. Had the beef tar tar, which could have been better. The taste of Dijon mustard was very strong and the meat was cut up almost to mush (rather than small chunks). Waiter changed shifts while we were eating but we were never told and were made to wait a long time. \n\nThe restaurant crowd wasn't my style either. Seemed like accomplished mid life adults who care a lot about $ and image. I prefer a more down to earth crowd (despite $ or age) and atmosphere- this could have just been the night we went (Tuesday). Food was good  but seemed slightly off mark. I expected better based on the reputation and price. \n\nI honestly felt like we were given the \"pretty woman\" young+poor treatment. Guess you can't tell by looking at us that we have good dual incomes and no children to eat up our $. \n\nBc we had the voucher I didn't mind as much that we weren't taken seriously and that the food was lacking- we were underpaying for it anyway!\n\nAll in all the food is a lot better than most restaurants. I think my dish was possibly good but not put together with has much care on a that particular night. My mashed potatoes were absolutely fantastic. Deserts were good too, nice and light. \n\nI wouldn't chance going back and getting similar service while paying full price. It wouldn't be worth it.", "id": 80}
{"text": "Had brunch again at Table 17 for a third time and each time it's been better and better.  Last time I had the daily quiche and it was good.  Today I have the Alsatian tart with salad and I enjoyed every bite of it.  \n\nI'm really shocked to read all the reviews about bad service.  Having been to this restaurant six or so times now, I have never once encountered any rudeness.  Maybe I've just lucked out.", "id": 81}
{"text": "I am reluctant to write a review for Table 17 only because I want it to be Leslieville's best kept secret! I went for brunch with my husband and a friend. For Saturday brunch at prime brunching hour, we were quickly seated. The place wasn't full like all the surrounding places so not only were we served quickly, but we were also not rushed out the door. It made a great easy Saturday morning. \n\nServing staff were friendly and helpful. We loved that their bread comes from Bonjour Brioche, the best bakery east of the Don! My tart was so flaky and warm. Great sweet and savoury flavours in an appropriate portion for brunch. Everyone's plates were well-presented. \n\nThe decor had rustic charm and we didn't feel crammed in like many small brunch spots. \n\nOur coffees and water were constantly refilled and I spent an easy afternoon sitting and catching up with friends. What more can you ask for to make an enjoyable and easy-going Saturday brunch? \n\nI would definitely return to Table 17.", "id": 82}
{"text": "Dropped in on a Sunday for Table 17's BYOW Table D'Hote.  There was a '96 Bourdeaux that just had to be drunk and so my friend and I spent a lovely Sunday evening dinner obliging.  \nTable D'hote gives you a  selection of pork belly, steak frites, trout and a vegetarian option with a selection of first courses and desserts to go with it.  \nNeither of our dishes disappointed.  \nWhat we got was high quality, well prepared bistro fare at a very reasonable price.  Service was efficient if not overly friendly. \n\nI remain a fan of this cosy Queen East bistro and wouldn't think twice about many repeat visits.", "id": 83}
{"text": "Lovely ambience, we had a nice table for 2 by the window. I'm sure the table beside us could hear our conversation as we could hear theirs when there was a pause in ours. \n\nThe service started off being attentive and slowly started to slip (e.g. My date had to go find a waiter to get me a side plate for me to put shells from my seafood linguine, despite me having asked for it 5 min earlier). The fresh oysters were amazingly delicious and fresh! \n\nI enjoy dipping my bread in olive oil and Table 17's olive oil was no better or worse then any other nice restaurant's. My seafood linguine was average. I believe my date had lamb and he said it was fine. We also ordered a bottle of wine and felt their wine selection was appropriate. Overall, we weren't blow out of the water and have made no plans to go back as we were expecting more. Make sure you make a reservation!", "id": 84}
{"text": "The summary of 3 stars for Table 17 is that it's too expensive for it's location and quality.  It's still pretty good, I just don't like seeing a cheque for $60 for brunch.  \n\nThe good:\n- The food is good and the ingredients are top quality\n- Sundays and Mondays it's bring your own wine with no corkage fees\n- Brunch has a 14oz Blanche de Chamblis with a splash of OJ for $4 which is the best value on this menu\n- They do potato rosti right\n- Sarah T orders TWO sides of bangers because she loves them so much... I really do like their bacon\n- Good service both times I've been\n- Proximity to my house\n- they use opentable\n\nThe bad:\n- It is too expensive.  The breakfasts don't come with sides, and sides each cost $4. So scrambled eggs with toast is $10, plus bacon is $14 plus hashbrowns is $18. I could maybe stomach $14.95 for a complete brunch, but I hate paying 10$ for eggs then having to add on the things I feel should come with it.  Maybe I'm not classy enough to eat bacon here.\n- It's not as good as Le Select brunch, which I don't mind splurging $60 on once in awhile. I won't spend my $60 here instead of there. (both times I've been here Sarah T picked.)\n\nNo funny stories.\n\nWould I go here again?  Maybe.  I might try it out for dinner one one of the BYOB nights.  Man, this place is just too expensive.  I know that's all I keep saying about it, but they charge too much for the food here.", "id": 85}
{"text": "I can't seem to make the half star symbol work because I'd give Table 17 three and a half stars. I found myself there late last night where I met up with an old friend for dinner. I have been wanting to go there for a while so when I found myself on the eastern side of the city dealing with a late day work issue I seized the opportunity. \n\nI can't say all that much about the decor as we sat on the side western side of the restaurant right by the door (in all fairness, we just walked in and had no res so we knew it would be hit or miss). The other side of the restaurant, from what I could see, looked lovely and it appears that they have one of those large chef's tables as well. \n\nSpecials of the day included an unusual app of deep fried Zucchini flowers stuffed with ricotta (3 on a plate). The waiter explained that these flowers were only available for about two weeks of the year and it was a very special menu addition. The main menu is not that large with approx. half the mains being some sort of fish (arctic chair, salmon, halibut, scallops). \n\nWe started with the charcuterie board because I wanted to compare it with the charcuterie board that my fellow yelper, Deanna and I shared at Swirl the day before. The bread they served was very unusual, some sort of blueberry bread with walnuts in it. Very fresh but very heavy. The board consisted of four different types of meats, a small terrine of chicken pate, a couple of dried figs with walnuts shoved in them, no cheese of any sort, nor any savory (I have this thing for olives!).  Pate was pretty good but not anywhere near as good as the pate we chowed down on at Swirl. Would have loved the figs if maybe they had squeezed some mascarpone into them and then shoved the nuts in. I'm such a foodie critic. To drink we ordered the McManis Cabernet Sauvignon ($55) and it is a very reliable bottle of red. \n\nI opted for (let's be predictable Christine) the steak frites and my friend had the poached halibut. The steak was delicious and cooked to order (medium rare). The frites are so crispy, crunchy and tangled, just the way I love them but what the hell is up with all the salt? I mentioned this to the waiter when he asked me how my meal was and then to his credit he brought out an little bowl of frites sans salt. He insisted. He also apologized for the kitchen as he said sometimes they don't realize how much kosher salt they are tossing into the bowl when they shake up the frites. The halibut was meaty but bland as hell. Then again, it is poached. Great if you are on a diet. Personally I felt it could have been poached in perhaps a court bouillon with lots of fresh herbs. My friend began picking at my plate which tells me that she wasn't sated by her dinner because she dived right into the bowl of extra frites. \n\nWe passed on dessert. After all that meat there was no way I could eat dessert (urp!). All in all, I liked Table 17. The service was great, our waiter as friendly and stayed on top of making sure our glasses were looked after. Still, something just felt slightly off for me and I can't quite put my finger on it. Perhaps it may have just been our location inside of the restaurant, I never really felt like I was in it.  I would be willing though, in all fairness, to give Table 17 another go.   The lamb sounded wonderful as did a couple of the specials of the day.  I so gotta learn to step outside my steak obsession!", "id": 86}
{"text": "We're regulars here. Delicious brunchs! Delicious dinners! Service is quick and helpful. Is a dressed-up/relaxed place. Bonjour Brioche have a line, come here!!!", "id": 87}
{"text": "I am a fairly regular dinner guest at Table 17, and thought it was time to leave a review.\n\nAmong the cosy bistros popping up in Leslieville, Table 17 was among the first, and is among the best for its consistency in quality of food and service. I also really appreciate the Sunday & Monday BYOB nights, and wish other restaurants would take Table 17's lead on this generous offering.\n\nI am always happy to see my favourite mains such as the braised beef short ribs and steak frites on the menu (and I happily order them over and over each visit - the fries appear to be crisply double fried in duck fat in traditional Belgian style. Yumm!) \n\nThat said, the menu does not seem to have changed very much over the years, and I almost wish they would take that risk and do a bit of a menu refresh. I still give it 4 stars because I go there when I crave my favourites. When I'm feeling adventurous, I just go a little further west on Queen to Ruby Watchco.", "id": 88}
{"text": "Very good food and great atmosphere, friendly service. Bottom line: impossible to go wrong with a visit.", "id": 89}
{"text": "Disappointing experience.  The restaurant was packed and my friend and I were crammed into a small table where we were basically touching elbows with the tables beside us.  The food wasn't anything special which surprised me - I had been intrigued to try this place for a while but I won't be going back.", "id": 90}
{"text": "Went for Sunday brunch. Nacoise salad for me, scramble of the day for my friend.  Waiter had an attitude. Food was good / acceptable. Decor was lovely (especially the bathroom!), however  I wouldn't go back again.", "id": 91}
{"text": "Meh. Service was bad and food wasn't much better. The restaurant was clearly understaffed and our server rushed us all night.\n\nTo be fair, the hot balls and kale salad were very good appetizers. The main course was a huge disappointment. My fiancé ordered the trout on a recommendation from our server. It was bland and undercooked. The avocado mousse tasted processed and fake. I ordered the Simcoe County Pork Chop after our server highly recommended it over the steak frites. Super bland, no spices. \n\nMaybe it was an off night as there seem to be mostly positive reviews, but we left disappointed.", "id": 92}
{"text": "I'm confused as to how to rate Table 17. When I lived in Toronto I ate here quite a bit for brunch and so when visiting the area again I was excited to go back. \n\nThe food and service were good, but my confusion lies in the cost of the Caesar at brunch time. It used to be $4.50 or $5. I saw they have a super special one on menu for $12 but I cannot justify paying that much for a Caesar. So I ordered a regular one, followed by another regular one. I was shocked when the bill came and they were $9/each. Ouch!\n\nMy bad for not reading the menu fully and noticing they are not part of the discounted brunch drinks anymore.", "id": 93}
{"text": "What a great little restaurant in Leslieville.  I was pleasantly surprised at the quality of the food and the service.  Not too expensive and the the variety on the menu was a nice change from many other restaurants in the city. \n\nCall me a fan. I will definitely go back!", "id": 94}
{"text": "For a small place, Table 17 is very accommodating.  I was a part of a very large party (10+ people) who could not make up their mind.  Various members called the restaurant multiple times to change our reservation.  I was horrified that when we showed up, they were going to turn us away (I would!).  But, they did not.  Everyone was very friendly and welcoming.  Our table was waiting for us when we arrived, and we were all served very quickly.  The waiter made excellent suggestions for drinks, apps, and entrees.  Everyone was happy with their meal.  The ambience is nice, quiet yet trendy.  The bathrooms were immaculate and while we were in the front room near the bar, the back room had a center table as a servers station for bread and wine bottles.  The only downside is that the entrees were very small - fortunately they weren't horribly expensive.   The drinks on the other hand.... Let's just say I'm very happy I wasn't paying ($15 for a basic martini).", "id": 95}
{"text": "I have only been for brunch but was impressed.  Very friendly staff.  Somewhat traditional French brunch menu, and well executed items.  They have some fun cocktails, and the ambiance is great.  The nature of the menu (not traditional brunch obviously) precipitates only infrequent visits (I'm and eggs benny guy on Sunday mornings) but when we go we love it.", "id": 96}
{"text": "We've been here for brunch a couple of times. Had the rosti both times, as well as the neapolitan eggs and the weekly scramble. Both times everything has been excellent and the service is great and friendly. Also entirely reasonably priced. Recommended.", "id": 97}
{"text": "I have been hear a couple of times and overall have enjoyed the food.  I had the trout as my main and it was very fresh and perfectly cooked.  It came with some pretty boring side vegetables but overall the meal was satisfying.  Its a little on the pricey side but our server was great and I enjoy the vibe.", "id": 98}
{"text": "Table 17 is okay. The hot balls are pretty standout although for $12 for 6 ($2 a ball) I'm not sure I would order them again (thank you miracle of groupon-type discount!). The goat cheese balls were excellent, reminding me I never get enough goat cheese in my diet or to my liking. I would not recommend dipping them in the accompanying honey. The sweet just masks the wild goat cheese taste. Actually, it would be nice if you could order 6 goat cheese hot balls straight up.\n\nMy pickerel was a big bowl of meh. It tasted like something you might get during a summer/winterlicious. Being from the Lake Erie region, I like a tenderly cooked pickerel that allows you to enjoy the delicate texture and nuanced flavor of this white fish. But Table 17 prepares it extra crispy, burning the joy out of this fish. \n\nSlinky woman ordered the arctic char and seemed to have no complaints.\n\nPortions are a touch small given the prices. You get a couple slices of decent bread before your meal.\n\nService is excellent.\n\nTable 17 seems a nice addition to the aspirational bars that have cropped up in Leslieville along Queen street. The only thing I hate about Leslieville is it seems so dark. The strip needs some BIA work.", "id": 99}
{"text": "My experience with Table 17 were excellent.\n\nI do like the French Countryside deco giving the interior a homey and farmhouse vibe.\n\nWe were greeted warmly at the door and the service was really attentive for the whole evening.\n\nWe shared:\n\nLamb Polenta ($14)\nDuck Confit ($26)\nVanilla poached rhubarb ($8)\n\nEverything was well prepared with great care. I even enjoyed my Lamb Polenta and I am not a lamb or polenta lover!\n\nThe restaurant did get busy even on a weekday evening. I guess a lot of people were taking advantage of their prix menu $35 during Sunday and Monday with BYOW.\n\nWill definitely return when I am in the neighbourhood.\n\nPS: Thanks Amy L for the invitation", "id": 100}
{"text": "I wanted to go to Table 17 since I moved down to Leslieville and was excited to finally find an opportunity to go. My party of 2 got there around 9 pm and waited about 10 minutes to be seated. Unfortunately that's how the night continued. The decor is nice but very loud, with a large table in the middle of the main dining room for the servers to cut bread which we didn't receive until about 20 minutes after we were seated. We ordered drinks and decided none of the entrees looked appealing enough to pay about $28 bucks plus for, so we shared appetizers. We waited about 15 minutes for our drink. When we finally received our food at about 9:45 it was nothing special. To top it all off even i got the bill and they charged me for an entree I didn't even order. There are too many options in the area to go back for a mediore experince.", "id": 101}
{"text": "My girlfriend took me here for my birthday what a surprise! I had their fresh oysters which were incredible tasted like they were fresh out of the ocean. What I loved the most here was their own homemade olive oil, simply the best olive oil I have tried I can just sit there the whole day having their freshly baked baguettes dipping in their basalmic vinegar and olive oil. \n\nGlad my girlfriend showed me this little place book a reservation today you wont regret it!", "id": 102}
{"text": "After trying to find a table at various downtown restaurants downtown and frowned upon for expecting to \"walk-in\" on a Saturday night we happened to find parking (another surprise for a Saturday night) right in front of Table 17 as if it was meant to be. We walked in expecting to be turned away, especially since it was quarter past 10pm,  and were graciously seated at a pretty table by the window. The atmosphere was perfect - mellow but happy crowd lingering over dessert, attentive hostesses dressed casual and candlelight in a rustic contemporary decor.\n\nThe menu isn't extensive but offers a good variety to please any dietary preferences. We ordered the soft shell crab to start and it was set on top of a green chutney which elevated the taste of the crab and was just delicious. I had the lemon caper pasta which was really good and my DH ordered the lamb which was falling-off-the-bone goodness on a plate. We finished with the toffee cake dessert and it is high on my list of favorite desserts. It was decadent, luscious and big enough to share (but who wants to!).\n\nA great evening and I am glad we didn't get a table anywhere else - Table 17 rocks!", "id": 103}
{"text": "I've been a resident here for almost 3 years, and I've been pleased with my time here.  First off, location is great for Scottsdale within walking distance to Sandbar, California Pizza Kitchen, At One Yoga, and a gas station, and plenty of other options within driving distance.  Approximately 10 minutes to both Kierland Commons, North, and Scottsdale Fashion Square, South.  \n\nMy specific apartment is on the 2nd (top) floor, and the high ceiling and sky light make the living room fill with natural light.   We pay an average price for the area, 1100/month, and that's after 2 years of raising it.  I have always, always, always felt safe there, which is important for a single woman in her 20's.  There are 3 pools on site too.  \n\nAs far as office/management, Karen is firm and can come across as harsh, but she is just doing her job.  Maintenance is AMAZING - after several days of my key sticking in the lock I called maintenance and in less than 30 minutes I had someone come up, look at the problem, get a new lock part, and fix it!  Good service, helpful attitude.  \n\nOnly negatives would be parking on the weekend and that they don't accept UPS packages anymore, so you have to go to the Post Office to get them.  Annoying.  It's also noisy on the occassional Friday or Saturday night - but never bad enough that I couldn't sleep.", "id": 104}
{"text": "They are changing their complex name to Mosaic, so be forewarned the issues will exist there, too.\n\nI am sick of this. The water to my apartment has just been shut off 3 times in 3 months. The first time, the guy doing their renovations cut a line, the they had a scheduled outage that resulted in dirt in my lines, and now I wake up and there is no water and I can't get a hold of anyone at the leasing office or maintenance to ask if it will be on in time for me to shower before work!\n\nAlso, there is a line that drips from behind my washing machine to an open pipe and no one has ever come by to fix it after complaining to the front office. They also can't keep the walkway light by my apartment stairs lit, and I come home from work after it is dark. Since I come home after dark, I notice that it seems like the gates get stuck open pretty frequently.\n\nThe new management company also doesn't believe in posting how much you owe before it is past due. You can either set up an auto withdrawal or risk they won't have it up before you are late.", "id": 105}
{"text": "I was going to post this for the leasing office, but it seems more appropriate to put it under the community as a whole...\n\nAfter searching for a new place for a couple of months, I settled on Acacia Creek.  I had liked what I'd seen on the walk-throughs, and everyone in the office was pleasant enough.  One thing I'd noticed, however, is that the prices for their available units change every day.  So I waited until the price was where I wanted it to be, and headed over with the full intent to sign a one-year lease.\n\nRight before I entered the leasing office, I pulled up their website on my phone and confirmed the amount.  I walked in and was seated with an agent/manager with whom I had toured the property less than a week ago.  We made small talk, and she pulled up the unit in question...and quoted me a price ten dollars higher than what I saw online.  It wasn't that big of a deal, but I was quite confused.\n\nI pulled up the price on my phone again and noted that at that very instant, there was a discrepancy between what she said and what I saw online.  Her defense was that \"[their] prices change every day,\" but when I asked about the accuracy of the online pricing, she just repeated the line.\n\nI tried to find out why she would give me a different price quote, and she just repeated the line again.  I had my phone, and the unit price, staring me in the face, and she was telling me that it was wrong!  She then said that I should have booked during the previous week and said goodbye, as she apparently wasn't willing to negotiate down to their listed price or explain what was going on.\n\nI have no idea why she couldn't say something like, \"Our website isn't accurate - you should call,\" or, \"Let me see what I can do\" or anything like that. She was willing to lose someone who was ready to sign ON THE SPOT because she couldn't be bothered to explain a slight difference in rent rates.\n\nIf this is how they treat prospective tenants who WANT to live there and pay their rent, I can't imagine how they treat their residents.", "id": 106}
{"text": "A beautiful set of high end shops. I can't really afford to shop here on a regular basis when i'm in Vegas, but I am a sucker for two of them.  The Rare Bookstore and Andrew's Ties usually get a visit out of me.\n\nThe fountain is usually the center of attention for tourists taking pictures of their sweeties or families.  If you sit near the water, don't move back too far or you'll get water down your pants!", "id": 107}
{"text": "Definitely high end, high dollar stores! More like a museum than anything else. But it's so beautiful to walk around and do a little window shopping! Stop by Christian Louboutin and admire the red bottoms. Right across the way they have a little wine shop/lounge area to take a load off and enjoy a flight of white or reds or both! I very much enjoyed cruising around the shops.", "id": 108}
{"text": "Had a number of high end shops in a really nice setting but the place was relatively dead overall on a Saturday night. Most stores barely had 1 customer in them. The stores didn't do anything for me. \n\nBottom line: Nice but I much prefer walking around the shops of Caesar's and Venetian.", "id": 109}
{"text": "Because it's on the Strip, we don't get down to The Shoppes to often....however, when we make the trip, we're always happy that we did.  There is a nice selection of upscale shops.....Fendi, Billionaire, Burberry, Coach...and many more.  Those are a few of the shoppes The Better Half (TBH) and I like to browse.\n\nWhile we're here, we always make sure to stop by the Double Helix Wine Bar to enjoy a glass of Wine while we're shopping.\n\nLocated on the 2nd floor of the Palazzo, it's away from the action of the Casino.  There's a good selection of restaurants on the 2nd floor as well.\n\nWill I return?  You can count on it.", "id": 110}
{"text": "The Shoppes at the Palazzo is one of the finest collections of luxury brands you will find one the strip.  The mix what you need and what you want is dangerous because you can spend a lot of time and money over there and that's exactly what they are going for.  Nestled above the Palazzo Casino floor it feels much more welcoming than the Grand Canal Shoppes at the Venetian although you can't discount the difference in atmosphere being a good change of pace.  The Shoppes at the Palazzo is more of your \"traditional\" shopping setting.  This is a great place to go for shopping, dinning and just strolling around.  If you haven't stopped by I would make it a point to go.", "id": 111}
{"text": "This mall is a lot smaller than the ones that I walked through in Vegas, especially since they don't have a huge number of stores for you to look at.\n\nWhile the interiors and decorations of the mall looked really nice, the stores that they had were super pricey.\n\nWell, if you want to take a nice little walk in a shopping area, then this place is okay to do so.", "id": 112}
{"text": "Really nice shopping mall.  Beautiful with some really nice high end stores.  Some of its shortcomings are it's small compared to other malls or even casino shopping malls, it doesn't blow you away like the Venetian Grand Canal Shops or Caesar's Forum Shoppes.  Although it's attached to the Grand Canal shops. Nonetheless, because I never miss the Grand Canal Shops, I make the short walk to this place.  When you win the Megabucks, you can afford to shop here.", "id": 113}
{"text": "Some great shops, but CRAZY hard to get your bearings, find the store you're looking for, or keep track of which \"aisles\" you've \"done\" and what's left to shop... for a sport shopper like me, that's incredibly annoying - and tends to keep me away. Given almost all of these stores can be found in at least one other shopping center in Vegas...", "id": 114}
{"text": "Love this place! Got their Signature burger, The Z Burger but the mini one! Their Z sauce is like a Big Mac sauce but way better!! I wish I lived right next to this place. Can't wait to try the Dunamis burger next!", "id": 115}
{"text": "Fantastic burger! Definitely on par with five guys and I would say it's even better. The z burger had delicious onion straws and all the ingredients were fresh. The texture of the patties were unlike any place I've ever been to, a must try!\n\nAlso worth a mention, the fries are very tasty (not greasy like most places). I didn't get a chance to try the Z poutine but it sounds like perfection.", "id": 116}
{"text": "Loved these burgers!  Fresh ingredients, flavours mesh perfectly for a mouthwatering experience.  My kids loved the fries and their cheeseburger. My husband devoured the spicy burger even though he \"wasn't hungry\" and I loved my feta.  We will go back often.  The owner is a great guy, made us feel really welcome as we had just moved to the city.", "id": 117}
{"text": "My go to place to study!  They play great music at a volume where you can still hear yourself think.  It's almost never crowded, and the people that come there generally are reading or studying.  They have an amazing tea collection, with equally good food and even grilled cheese sandwiches (with the option to add tomato :) )  One of the walls has some cute benches that are padded, making it a perfect place to wrap your hands around your warm cup of tea and read a book.  I agree with Rachel C, I wish they had high tea, that would make it perfect!  The only drawback is that it's small, and there aren't a lot of places to sit.  If you are the mood to try a variety of tea, or just need a place to study/relax this is it!", "id": 118}
{"text": "This place is ridiculously cute, colorful, and cozy, with a huge selection of loose leaf teas.  They offer teas by the pot only, except for iced teas (during warm months) which come by the cup.  They range from $3 to $4 per pot depending on how fancy the tea is.\n\nThe staff here has been friendly every time I've been.  They are always keen on offering suggestions if you ask!  Last time, I was struggling between going for a fruity tea vs. a chocolatey tea, and the girl working suggested this chocolate peppermint tea blend that was not on the menu but that she had made for herself the other day.  I tried it, and it was AMAZING!\n\nMy experiences with the food here (from at least a year ago) have been great as well.  They have their own pastries as well as a selection from a nearby bakery.  Savory offerings include grilled cheeses, soups, and sometimes specials.\n\nOne small gripe I have is that their teapots tend to, for whatever reason or another, leak some tea leaves and residue when you pour into your cup.  I suspect it's because the filter is not super fine and so small bits from the tea mixture can fall through.  It's never been a major problem, though.\n\nYou can always find fun, seasonal specialty drinks here too (e.g. hot apple cider in the fall), in addition to coffee, if tea isn't your thing.  Newspapers and reading materials are usually available to pick up, and there are board games in the back.  This is a great place for a rainy (or cold) day!", "id": 119}
{"text": "You can purchase from a huge variety of loose leaf teas. It's one of the few places I know that really pays attention to brew times and water temperature. The smoothies are fresh and taste very natural. If you order in, they'll give you your drink in a cup that looks smaller than if you order to-go. They have nice metal counters with lots of plug in places for your laptop. The benches aren't terribly comfortable, but the couches are. Plus, the people behind the counter are great!", "id": 120}
{"text": "Mulled Apple Cider Tea. Deliciousness in a hot steaming cup.\n\nLots of space to lounge in. Friendly service.", "id": 121}
{"text": "First visit here the other evening and it turned out to be the perfect place to sit and relax after a long busy day at work.  I didn't even look over  the tea selections because this café had me the minute I saw the featured drink listed on their outdoor sidewalk sign.  I thoroughly enjoyed sipping  my  hot cider tea drink on  the cozy corner seat near the window while reading and watching the world pass by.  Truly a good place to unwind and be refreshed.", "id": 122}
{"text": "Good tea, comfy chairs.  I hear the food is also good, but have not tried it.  Nice quiet place to relax.", "id": 123}
{"text": "I'm writing from Te Cafe right now.  I love this place and always made an effort to come here when I was visiting Pittsburgh from other locales.  It's sad that I don't come out here more often, now that I live here again...\n\nAnyway, they have a fantastic beverage selection (not just tea), high-quality loose-leaf teas you can buy by the ounce, comfortable enough seating, free wifi, and friendly staff.  The music's a toss-up; right now, it's some pretty good oldish rock, but apparently there is \"wispy Lillith fair crap,\" sometimes?  On the bright side, if you show up on a bad day, it is definitely quiet enough to allow you to just listen to your own on headphones.  And the clientele is pretty varied, which I also rather like.", "id": 124}
{"text": "Te Cafe is going to be one of my favorite places in Squirrel Hill.  I feel it.\n\nSo here is the quick summary:\n-  Loose leaf teas served by the cup or pot at reasonable prices!  Cups of tea were around $2, and I got a pot of peaches and cream tea for $4.01 with tax.  The Cream Earl Grey is amazing as well!  There is also free hot water so you can keep going!\n\n- If you are not a hot tea drinker, there is also iced tea, lemonade, and hot chocolate!\n\n-They sell grilled cheese sandwiches with pesto for $4.50 ish.  I don't remember the exact price, but I remember that the pesto grilled cheese was amazing.\n\n-This place gets packed with wifi hogs.  You've been warned.\n\nI really like the vibe of this place.  It's a good place to catch up with a friend or study, and I like that it's on the quiet side of things.  They usually are out of most of the teas on the menu, but there are still at least 50 types.  I will definitely be returning here soon!", "id": 125}
{"text": "Certainly up there as one of my favorite spots in town to study.  The overall ambiance is very conducive to being productive: comfortable chairs, good lighting, a great selection of music at the appropriate volume, and of course the warm tasty beverages that are an absolute steal.  This place has the most robust hot chocolate lineup I have ever seen, with the Mexican chocolate being my favorite.  Free wi-fi, with no necessary password, makes things all the more convenient.  I also love how this place caters to those who want to study/read.  Sure light conversation does occur, but I hope it stays that way such not to detract from the great study vibe this place engenders.", "id": 126}
{"text": "I came in for the first time, sat down to setup my computer, and within 2 minutes had a server telling me that if I do not order anything I will have to leave. I'm not sure if I was being judged by the way I looked (wearing sweatpants and ratty t-shirt), or if this is standard practice. I was planning on staying and purchasing a drink, but found this treatment extremely rude and uncomfortable. Do not plan on returning.", "id": 127}
{"text": "I'm a graduate student here in Pittsburgh, and this is one of two main places I go when I want to get work done. The tea selection is excellent, and the staff was excellent - everyone knows the teas very well.", "id": 128}
{"text": "I only wish they offered sugar. However, good atmosphere. If you wanted to have a decent conversation with a friend of interest, this place is currently ideal. The Chai is amazing.", "id": 129}
{"text": "Oh what wonderful, delicious, unique drinks they have! I'm a tea person and I was extremely impressed by their selections (with prices better than Teavana, mind you). It's small but beautiful (think Ikea beautiful). And damn good people work there. :)", "id": 130}
{"text": "Great selection of fairly-priced teas. Good food, too. Could be bigger, but never had a problem finding a comfortable seat. Not much to say, check it out!", "id": 131}
{"text": "Really delicious tea and a good atmosphere. Everyone who works here are nice and helpful. I never feel rushed when I work on my computer. The owners are also great, and bring a nice sense of community to Squirrel Hill when you walk in. \n\nI tried the Sushi here for the first time, and was surprised that they made it on site. You get a lot for $8-$9, and it tastes yummy. Would recommend. \n\nThe mulled tea is my favorite though. I'll miss it in the summer.", "id": 132}
{"text": "Good selection of tea, plentiful seating, nice atmosphere. I had an iced hibiscus tea that was pretty great. I will definitely be returning.\n\nAlso, they have outdoor seating (though it's on the Murray Ave sidewalk and a little noisy) and a clean bathroom.", "id": 133}
{"text": "I can't think of a better to way to spend a lazy sunday afternoon than a pot of oolong, a copy of the sunday times, and just sitting back and relaxing at the Te Cafe.", "id": 134}
{"text": "This is my favorite place to go in Squirrel Hill. There's so many different drink and tea options, I have to keep going back to try everything! The atmosphere is really nice and chill too- perfect for reading, sketching, studying, etc. I only wish there were more pastry/dessert options, other than just tarts and biscotti. It may actually be a good thing (for my wallet) though... haha.", "id": 135}
{"text": "They have outlets almost everywhere and the seats are extremely comfortable. I had a Kyoto Cherry Rose tea that was absolutely incredible. The staff really knows their tea, the presentation is wonderful, and the atmosphere is beyond pleasant. They also have a few board and card games. Go for work or a game night with friends!", "id": 136}
{"text": "I love buying a pot of tea and studying here. It's always quiet, there's a ton of outlets, and you can always get free refills of hot water. It has a great, relaxing environment. Their lavender lemonade is great as is their plum berry white tea. I wish they had more room. The one thing they can definitely improve upon is their bathroom. The toilet is almost always broken and it never seems too clean.", "id": 137}
{"text": "That's my second time here, and I'm so happy that i've discovered that place! Very comfortable and relaxing atmoshere, delicious teas and huge variet varieties them! Friendly, always kind and heping stuff! That's one if my favorite places now!!!!", "id": 138}
{"text": "Can't vouch for the sushi as I only stopped by for a lunch time snack.  Tried the sandwich of the day which was a grilled cheese pannini and I have the iced chai latte.  Both were tasty and reasonably priced.  Staff was friendly and place was clean and comfortable.  If I was living in this area I could see myself coming in here on a pretty regular basis.", "id": 139}
{"text": "With a calm, peaceful atmosphere, a very friendly and knowledgeable staff, and a wide selection of great quality products, I would definitely recommend this place.  Both the iced chai tea latte and the sparkling tea were excellent, and I'm sure that their other stuff is great too.\nI'm definitely going to have to make a point of coming back.", "id": 140}
{"text": "Though this mall is smaller and less variety compared to others around it, I still love to come here as there are a few shops which are not in Promenade St Bruno. The food court is OK, not the best but the mall is cute and easy to navigate around. I love the Yves Rocher here, great little salon inside. Also the fact that there is a huge sirens store here which has way more variety than Dix30. When the weather is like today (raining) we end up at this indoor mall instead of the outdoor Dix30 and love the atmosphere here. \nIt was the first mall I visited in Montreal so I hold many fond memories of the place :)", "id": 141}
{"text": "Unless you're a local yokel McFarland douchebag, you won't get any measure of service here.  After waiting more than 15 minutes for a server outside, I went inside to inquire of outdoor food service.  Of course, since I am not one of the regular inebriated bar flies, getting the attention of a bartender is nearly impossible.  I guess I'm just not loud enough, drunk enough, or both.  And once I did get his ear, the next local loudmouth douche bag stumbles up to the bar and interupts me to order his next round of Captain and Cokes (classy).  So we left and will never be back...unless of course we lose all sense of decency and purpose and relocate to McFarland.", "id": 142}
{"text": "Great volleyball courts! The sand is soft but at night, some of the lights will shine right in your face and obstruct your view while you're playing.\n\nThere is a hose and area to rinse off afterwards, by the dock facing the beautiful, glistening Lake Waubesa.\n\nA cherry bomb will run you $7 and a Vodka 7 will run you about $5 or so.\n\nBe careful when you order the pizza, you start with either a 12\" ($8.99) or 16\" ($10.99) cheese and each topping is $1.50! My friends and I weren't aware of that and got a little carried away when we got our tab for all the drinks, pizza and wings was just under $100!\n\nOn Monday nights they have a AYCE taco bar with ground beed and chicken, as well as assorted toppings. The pico de gallo was very fresh, the shredded romaine was crisp, and the salsa had a nice bite to it. Every time you were ready for more, just ask the nice bartender to give you more shells (corn hard shell or soft flour tortillas).", "id": 143}
{"text": "Good food, drinks, and views.  Great place to come by boat in the summer!", "id": 144}
{"text": "I have been to Christy's quite a few times over the years and have never had a very good meal; however, last night's meal was a disaster! It started with the bartender getting our drink order wrong, One member of our party received a different potato than ordered, 1 had a different salad dressing than ordered and I had the worst fish fry EVER. It could have been good if the breading wasn't soggy on one piece and excessively crispy with holes in it (looked exactly like a funnel cake!). The baked potato tasted dry and leftover. The one high point was a waitress (first night on the job) that was very friendly and actually cared about our poor experience. Christy's is back on my list of places to avoid.", "id": 145}
{"text": "I'm very surprised to read all the negative reviews. We were made to feel very welcome as soon as we sat at the bar by Tim the bartender. He was unfailingly polite and friendly, as were the people who sat near us. It made me wish we had more time to hang out and soak up the lovely waterfront location. \n\nStarving, we ordered a pizza and both enjoyed enjoyed the hell out of it. The toppings tasted very fresh and the crust had a slight flakiness to it. The only drawbacks I can think of are the plastic cups the beer is served in and that I'd love it if another taphandle were devoted to something a bit more local to Madison, like Ale Asylum, Karben4, or even Tyranena (from Lake Mills).\n\nAs we left Tim thanked us for stopping in and asked us to come back the next time we were nearby. I 100% plan to do so.", "id": 146}
{"text": "Decent but not great.  OK as far as bar food goes.  Very smokey.", "id": 147}
{"text": "Worst service ever. we arrived at 7 pm on a Friday night. Since it's on the lake, were not surprised there was a wait, but didn't really seem to be enoughpeople waiting for 1-1/2 hour wait.  We sat on the deck with a couple of drinks, and enjoyed that. At the 1-1/2 hour mark, went in to see how much longer and were shocked to see the mostly empty dining area in the bar. Maybe the upstairs dining was busy? Nope- one table of 4 waiting to be served, and 2 large tables of people who had finished eating and were doing their party speeches. We think they just forgot us.\nBrief wait for the waitress.10 minutes later got our salads for 2 of us, soup for 2  (husband wanted cole slaw, but they were out). Soup was good. Salad was very small, with a huge carrot 'coin' and cucumber slice. italian dressing was blah, bleu cheese dressing had no bleu cheese chunks.\n30 minutes later, caught the attention of our oblivious waitress to check on the status of our order, and her comment was \"didn't they tell you it would be an hour wait?\" Wouldn't that be the waitress' job? After another 20minutes, and the 1 hour mark, i went to find a manager. Bartender blew me off, so I went to find the host,who apologized, said it was coming out now, and said they \"were just catching up\". From what? The bar area dining was almost empty, and we were still one of two 4 person tables up in the big dining area.\n5 minutes later, with no waitress, no food, we left. We will not be back. Maybe the food is good, can't comment on that, but the aggravation is not worth it.", "id": 148}
{"text": "We tried the fish fry a few weeks ago after hearing great reviews from friends. We weren't disappointed. Everything was wonderful. Tonight we went back and our experience was the opposite. The lobster bisque was cold ( Apparently, they forgot to turn the burner on and we were the first to mention it. We were there at 8:00pm.). The fish was okay and the waffle fries were cold. My husband asked why we didn't get any bread. He was told that they ran out. We found that interesting since people who were seated after we were had bread. Not sure we need to go back.", "id": 149}
{"text": "Drove out on the bikes on a gorgeous Sunday.   It wasn't overly crowded.  Overlooks the lake and many people dock their boats and enjoy the patio and food.   Lots of people taking food back out onto their boats.  \nUpon arriving, there is no sign telling you to sit down or see the hostess for a seat.  We walked around and into the bar and then we finally were told by the bartender that we can sit where we want.   \nThe menus at the table were all different.   Three different menus, one omitted the burger and the other one didn't have the \"baskets\" on it.  Weird!!  The waitress knew that something was wrong with the soda guns and brought us 2 pitchers of essentially colored water.  When we finally mentioned it, she acknowledged that they were having problems with it.  After a while she brought us another one and said she hoped it was better.  It finally was.   The orange and lemon peels thrown on the grass, could be cleaned up as well.  \nOverall, the food was good.   Burger was juicy and flavorful and he bacon wrapped shrimp was really yummy.  The pizza at the table next to us looked delish and may be ordered if we return. \nThe place has some potential but a little makeover would be great!!!", "id": 150}
{"text": "A great neighborhood hangout with good food and great beer.  This is THE place to be on a summer night, and usually something fun happening on the ice in the winter.  The place is loaded with character(s) and is a true Wisconsin tavern on the lake.", "id": 151}
{"text": "Today I had another session with Les.  I was having so much pain in my foot I thought I was going to have to give up dance.  Les did a combination of multiple modalities on me including lymphatic drainage, chiropractic massage, Russian massage to realign my leg and foot.  I was very relaxed and even when he had to use more pressure on the reflexology, it was fine.  He diagnosed that I had a tight inner thigh muscle and he got it to release.  Les is so experienced and can read your body and diagnose where your physical issues are.  I am telling all my friends about his work!", "id": 152}
{"text": "Les is just incredible!!  I participate in a number of sports and work my muscles to the max.  A typical week includes 6 hours of high-intensity interval training as well as three to four 3-6 mile runs.  As a public speaker, I spend 8-hours per day standing on high heels.  Massage is not a \"luxury\" for me nor is it about relaxation - it is about allowing me to continue to do the things I love without pain.  Until I began going to Advanced Body Therapy, I did not think that was possible.  Les is fantastic in the office and encourages me to continue my active lifestyle by even showing me stretches I can do at home.", "id": 153}
{"text": "Again.... Les has worked his magic on me. \nJust 1 visit & already I have less pain & more mobility in my injured knee.", "id": 154}
{"text": "What a find, right behind the Radisson, fresh cheap and delicious.  Friendly staff. Give it a try.", "id": 155}
{"text": "I can't figure out why their food isn't that great. They seem to use good quality products. Been there for breakfast and lunch and its meh.", "id": 156}
{"text": "Only open for lunch spot, a nice little sandwich shop hidden behind the Radisson. I had the Grilled Fiesta Chicken Wrap and really enjoyed it. Pretty large sandwiches from what I can tell and looking forward to trying other options, as well. Being from out of town, you can tell it has its regulars and people really like this lunch place.", "id": 157}
{"text": "Happy to have found this place! Great food, decent prices, friendly staff. This makes me a more-than-once-a-week patron! And they will even accomodate an off-menu request as long as they have the ingredients. Thanks, Fred!", "id": 158}
{"text": "I absolutely love this place! In fact, probably my favorite sandwich spot. A hidden gem. I eat here atlas once a week. I have yet to have one bad thing.  My favorite sandwiches are the Queen of Clubs ( like the King of clubs, but with only a double decker not a triple decker) and the tuna melt. The cobb and garden of eden salad are my favorites. Their sandwiches and salads are pretty big, so go with an appetite. Its a mom and pop sandwich shop, which I love. Try it out! You will not be disappointed!", "id": 159}
{"text": "an excellent place for lunch, the food is great the service too! always friendly, never pushy, as one guy said, i like the 'tude of the lounge lady...i call it the the lunch lizard and its off the beaten path but you wont go wrong with thier specials or anything on the menu for that matter. the outside seating is nice, i try to eat here regularly...beats any chain sammich shop!", "id": 160}
{"text": "I have been to the Lunch Lounge many times for lunch and love the chicken salad.  It is the best!  I also love the BLT's.  Today I stopped in for breakfast and had the breakfast panini sandwich and I am once again impressed.  Thank you Lunch Lounge!!!", "id": 161}
{"text": "I eat here at least once a week all of their sandwiches and salads are always fresh and delicious and every 9 salads or sandwiches you buy you get the 10th on FREE. Goodstuff! Glad it's near my work.", "id": 162}
{"text": "Love this place.  Weekly specials are amazing.  Great, fast, and friendly service.  I'd highly recommend to anyone.", "id": 163}
{"text": "Had lunch here. Very close to work but only found out about it through yelp. My sandwich was delicious and the staff was super friendly.  I'll definitely be back.", "id": 164}
{"text": "For a little sandwich shop in an office park, this place is great. \n\nDelicious, big breakfast burrito.  No problem to substitute avocado for the meat. Hot tasty coffee. friendly staff. Outdoor seating option.\n\nAll for under $6.\n\nSo glad I didn't have the more expensive breakfast in my corporate airport hotel.", "id": 165}
{"text": "I stumbled upon the Lunch Lounge while staying at the Aloft last week, and was thrilled that I did. It's kind of hidden from the street behind the Radisson on 44th St, but that didn't stop me from taking the short walk over from the hotel. Cute little place with great service and good eats! They have all kinds of sandwiches and salads, and couldn't decide what I wanted since the menu looked so good. They serve Boar's Head meats, which makes for an awesome sandwich. My friends who were staying with me raved about the food and said they wanted to come here for lunch again tomorrow. Only not so great thing was that they were out of the soup of the day, which we wanted to try, but since we did come about a half hour before they closed I could live with that. Wish we had more deli-type places like this in Milwaukee! Yummmmm!", "id": 166}
{"text": "What a find!  While staying at the Aloft in Phoenix for business we found this on a morning walk.   \n\nWe had the breakfast burrito and a breakfast panini.  Both were excellent!  The burrito was so large we agreed that it could have fed us both.\n\nThe lunch menu looked great and I would like to try some of the sandwiches.\n\nWe are here for a few more days and will eat here on Monday.\n\nIf you are staying at a hotel in this area be sure to give it a try for a good quick breakfast or lunch.  You won't be disappointed.", "id": 167}
{"text": "Amazing lunch.  Fresh Boars Head meats. Fresh bread (marble rye is awesome) and tr staff is great.  One of the best sandwiches in the Phoenix area.  Don't miss this place. You won't be disappointed!", "id": 168}
{"text": "Worth finding - a little awkward the first time, but I don't regret having to drive the block an extra time! The Italian sub was loaded with meat - just like back home (Boston) - salad was fresh, bread was fresh, meat was just YUMMY!! Nice surprise - we will all be back. BTW - lunch for 4 + drinks was $30.00 ... Great, clean, fresh and friendly!!", "id": 169}
{"text": "Restaurant/Ambiance: Small cafe tucked away in a corporate office park. Has a Modern but relaxed cafe vibe inside. Has about 12 or so tables inside with 3 tables outside. Typical clients are business execs and tradespeople on lunch break. No issue getting a table or parking space. Little difficult to find though.\n\nFood: Great selection of sandwiches. Quality meats and fresh veggies. I like the southwest chicken chipotle sandwich. Also excellent salad menu. They also have a great breakfast menu but I've never been there for breakfast.\n\nService: Fast service, able to move the lunch rush pretty well.\n\nOverall: Great little lunch cafe!", "id": 170}
{"text": "Awesome find! Stopped in for breakfast on the run and will probably come back for lunch. The guys are super nice... Coffee is amazing!", "id": 171}
{"text": "Great little sandwich shop tucked into the office plaza (Follow the sandwich board signs to find it). I had the lunch roast beef special and it was really good. The red potato salad seemed to be missing something for my palate, but over all it was really good! Meat was tender, taste was good and no overpowering sauces. \n\nIts a bit cramped in there so a togo order is a good idea, but its close to my other office so it makes for a perfect stop. Service was fast considering the crowd at lunch and the patrons and employees seemed to know one another.\n\nIts a nice place if you are in the area, stop by and have lunch!", "id": 172}
{"text": "Great little lunch spot!  Fresh food.  Something for everybody.  Long line at lunch though.  We had our food within 15/20 minutes from the line at the door.", "id": 173}
{"text": "Was in Phoenix for business and discovered this friendly, wonderful  haunt  near the airport.  I had the best lunch ever -  a Southwestern chicken chipotle panini.  OMG!  The guy behind the counter turned out to be the owner, and himself grew up in a family owned East coast deli.  \n\nI had several expensive meals during my trip, but nothing was as tasty as my Lunch Lounge experience!  I made sure I had time for a breakfast stop on my way back to the airport., and was again wowed with a huge breakfast burrito, great latte and a smile - all for less than my daily NYC latte and muffin.  \n\nMy  client has never been to The Lunch Lounge, so next time I am in town, we have a lunch date at the best undiscovered charming cafe in Phoenix!  I can't wait to share the secret!", "id": 174}
{"text": "I visited this restaurant because I got a groupon now deal. When I walked In and the older woman standing there took about 5 minutes to acknowledge that I was standing there at the counter waiting to be served..\n\nFinally she said \"whenever your ready..\". I told her hi how are you, giving her a nice reminder that that is how your supposed to greet new customers in your establishment. That on its own turned me off because I hate giving my money away tobusinesses that don't appreciate me.  I don't feel like I am asking for much in exchange for coming back and supporting local businesses. \n\nAs I was standing waiting for my food I overheard the employees (including my o so pleasnt serve lady) complaining about the groupons that kept coming in.. while I was standing there! Rude! \n\nThe older man behind the counter making sandwiches was very nice. He is the only reason I am giving two stars. \n\nThe food on the other hand was decent. Too bad I won't ever becoming back just to be treated like I am bothering them.. next time I will just eat mcdonalds breakfast like I wanted anyways.", "id": 175}
{"text": "Tucked away in a very boring looking business park, you can sneak in for a great sandwich. Go around the corner and look for the Boar's Head sign. I had the Thanksgiving lunch special - turkey, stuffing, cranberry jam, and I held off on the cheese. Nicely toasted bread - all in all, a decent lunch!", "id": 176}
{"text": "I stopped in last Friday morning and thoroughly enjoyed the breakfast burrito. The service was fast, and not only was the breakfast burrito reasonably priced, but it was also enormous.", "id": 177}
{"text": "I got the southwest chipotle chicken panini and it was good but not great. It also cost $7.99+ tax which is too expensive for a sandwich with no sides or drinks. I would come here again if a friend wanted to eat here but i wont come back again on my own accord.", "id": 178}
{"text": "Really good sandwich. I love having my lunch here. I usually buy Veggie Sandwich and I ask them to grill it. Tastes really good and affordable too.", "id": 179}
{"text": "Hidden cafe with outside seating.  \n\nDon't let the name fool you...they also serve breakfast. \n\nGreat prices including my 1$ coffee!", "id": 180}
{"text": "Needed to find a quick easily accessible place for my kids and myself to eat and this place was in walking distance right behind Radisson hotel where we're staying at. Was able to find something for all of us. Pb&j's for the kids and a hot pastrami for me. Both were delicious and the staff was friendly. Quick, easy and much healthier than the fast food chains. Would of course recommended and return to the lunch lounge. Might actually get me some coffee there tomorrow morning.", "id": 181}
{"text": "Ashley is a great photographer! She took my maternity photos and newborn photos of my daughter. The pictures came out amazing, she did such a great job. She was so much fun to work with and made you feel comfortable. I would definitely recommend her to anyone needing a photographer and will continue to use her in the future. :)", "id": 182}
{"text": "Ashley shot our Christmas card and we had the best time with her, plus she's a complete professional! Our two dogs were there and she was so patient with them and also helpful when trying to get them to look at the camera. She came prepared, had different variations of props to best suit us and was truly a joy to work with. Since our shoot, we eloped and are now married but when we were shooting, I told her we had been engaged in April but never did an engagement shoot. After that, every single shot she took she made an effort to show off my ring! I am looking forward to working with Ashley again for our maternity and future family photo sessions! :) Thanks again for everything, Ashley!", "id": 183}
{"text": "I was SO excited to see Golden Krust outside NY so I had to stop in while in the shopping center.  My curry goat was SO delicious and had all the right flavor and spice.  The flavors reminded me of the great food I used to get when I lived near a Jamaican area in Brooklyn!", "id": 184}
{"text": "I really enjoy Jamaican food and was excited to see a Golden Krust in Charlotte.  The food was average and I didn't get to try the items I really wanted or any patties. I came in at 11:15 and they told me that most of the menu wouldn't be out til noon.  \n\nI may come back to try the patties.", "id": 185}
{"text": "Golden Krust is decent Caribbean for fairly cheap prices.  If you don't have high expectations for service or want to be \"wowed\" with food, you won't be too disappointed.\n\nOn both occasions, I've had the dinner combo ($8-$10).  The food itself is pretty good.  I had the Jerk Chicken and the Curry Goat, both of which were not too spicy. The plates are served with generous helpings of rice and red beans and another side, usually steamed cabbage or collards.  The meat portions was kinda slim.  But the service?  A total take-a-number-and-wait-for-me-to-move attitude pervades this place.  The line was long and the staff were slow to move.  Geez!\n\nMy buddy and I sat in the back dining hall, which they closed off with a wet floor sign as they were closing in an hour.  RUDE!  I had to walk around it to get a drink refill.  If you want cheap Caribbean food for takeout, this might be a OK place.  I'm sure that there is a Caribbean joint with more personable service and exceptional food.", "id": 186}
{"text": "Pretty good Caribbean Food, Nice location, and decent service. They use to be a lot better years ago. It's a little overpriced for the portions you get, but overall it's ok and I'll probably return", "id": 187}
{"text": "I have been to this restaurant quite a few times and always received pretty decent service. The food is always tasty and never really found that service was an issue until my last visit.\nI had a Jamaican visitor and she want hard dough bread to go with our dinner. Now I could have gone a couple of different places but I chose the Bakery. I love this bread but I typically only eat it when in NY, Jamaica or Florida because I need my hard dough to be as fresh as possible. \nWhile the seemingly nice woman was ringing me up I politely asked \"how old is the bread?\" Now I know this is called a bakery but everyone knows their baked goods are shipped in. She responds by saying \"the bread is fresh.\" I say your idea of fresh and mine maybe 2 different things. She became a maniac but in a calm way. She asks: do you want the bread or not? At the time I really just needed to get the bread and leave, dinner was waiting. But not before I explained that as a consumer and patron of this store I have a right to know how old something is in a darn bakery that doesn't bake anything.  \nAfter the fact, i was very upset because I could have gone somewhere else, and for her think that it was OK to respond in that manner bothered me. Why was she so combative in the first place? In the end, she told me their shipments come every Tuesday. So this would be the best day to visit if you need baked goods. I myself, will never spend another nickel there.", "id": 188}
{"text": "This place is NOT Caribbean food! It's terrible. You must ask for a drink separate from the combo even though you've ordered a combo. They're not going to offer it to you either. The food tastes horrible. I wish I could sit outside and turn people around to save their souls. But unfortunately this is all I can do. Take heed and go elsewhere!!!!!", "id": 189}
{"text": "The food here is really good, if you are in the mood for Jamaican food this restaurant is great. The sell cakes and patties which are very good. They get a four star because their portions could be better for the price.", "id": 190}
{"text": "It has been awhile since I've been to Golden Krust and I remembered this place being pretty good but things have sadly changed. Walking into the restaurant it was extremely humid and hot so I assume the air condition was not working. My family and I proceeded to order since we were starving. We ordered the Curry chicken with rice and beans and cabbage, Oxtails with rice and beans and cabbage and Jerk Chicken with rice and beans and cabbage. We also added 2 spicy beef pattys, they did not have any more regular beef pattys, I was disappointed. With it being so hot in the restaurant I wanted a Large ice water BUT their fountain drink machine was not working and they did not have any bottle waters. The only drinks that were available were bottled juices that I was not interested in. So I walked over to Shane's to buy a large drink. After returning with my large drink in hand my family and I ate dinner. The curry chicken was my favorite out of all the entrees we ordered but I was disappointed in my plantains were very soggy and not fried long enough. The oxtails disappointed me the most. They were not seasoned and did not really have a taste. Overall my experience here was just ok, I hope Golden Krust improves the obvious issues and bring back the original Golden Krust.", "id": 191}
{"text": "Food is good, price is good I can't take that away from them to be fair. However I ordered a combo that included a drink and Jamaican bread(forgive my ignorance). I paid with my debit card then when I got my food that's when the woman informed me their drink machine was down, and they were out of the Jamaican bread. Which she then immediately followed up with \" no refunds\".", "id": 192}
{"text": "Tis De Place Mon!  First Off me Being from one of the best cities in the world. NYC i know good west indian food and this hit the nail on the head! Great to the point service, with hardy plates not for the quickly filled stomachs here! Try the cuury goat! and the beef patties!! and a DG Soda!   best in carribean food in charlotte, nc! This is truly the mirror image of true carribeen food! anything else is just a watered down xerox copy.  then even have the spice bread and pastries!  Best for lunch $5-6, and dinner $8-10.", "id": 193}
{"text": "Ive been going here for yrs ...as a NYer I'm familiar with the chain. The foods good but I'm never going back. They've lost me and numerous family members. I wonder if they changed management or something because their portion sizing are horrendous! Theyve scaled back so much and still charge the same thing! I'm not paying for Styrofoam! Then if you ask for more rice you get told \"no!\"  What kind of service is that?! I got a whole lot of gravy though! Ugh theyre rude too! Now the food Id rate a 4...maybe 3.5. But the service and portions a 1. Shame I stopped getting plates and stuck to beef patties but then they stopped serving cheese beef and never bothered to have them again or remove it from the menu. Ill be going to the other Caribbean restaurant up the street from now on.", "id": 194}
{"text": "Is a small restaurant food is good! Also the owners are very friendly they make sure u are satisfied!", "id": 195}
{"text": "One of the few times I have given a business five stars. This restaurant has very good food everything on the menu is fresh and very very tasty. I've been to this restaurant probably 10 to 15 times and have never had a bad meal. Is the owner and staff of this restaurant are very nice and courteous and provide a good service and excellent food. I highly recommend this place for anything Mexican on their menu you will not be disappointed.", "id": 196}
{"text": "Las Vegas does not have a lot of good Mexican food unfortunately. So, when we do find one, it's always pretty exciting. This place was good. Reminded me a little of Texas, in terms of quality. \nEnchilada was very tasty, great sauce. Rice and beans were both delicious. Chile Relleno needed a tiny bit more flavor, but had plenty of cheese. Great little salsa bar. Had a bite of gf's Huevos Rancheros and we agreed that they were pretty awesome. We'll be back soon.", "id": 197}
{"text": "My daughter and I stopped in yesterday and truly enjoyed our meal. So much so we added an order to go. Just might have to give up my usual taco spot!!!! Food was great. My only critic no chips and salsa before the meal and only gives you a couple chips stuck in the great beans!!! Also might look into making up paper menus. Nothing to take home to read. The service impeccable. Will be back for sure.", "id": 198}
{"text": "Talk about authentic Mexican food!! there i was in search of a new place to eat close to work. I was craving authentic tacos, as i reminisced on my favorite taco shop in san francisco.\n      First stop was Cardenas. It was closer to me but the lines were ridiculous and the environment chaotic. Needless to say, i left in search of greener pastures. Second stop, the las vegas chain Rigos tacos. The place gave me a creepy vibe plus their soda machine was not working. I'm all for hole in the wall places but this place was too much. \n    As I drove aimlessly i came across this place, Mi pueblo Taco shop. Boy was I pleasantly surprised!! my  long search of a mom & pop taco shop proved fruitful. The lady at the counter and the cook turned out to be husband and wife, and the owners. They were both extremely friendly  and the food was delicious!! they had weird pricing quirks but hopefully they figure it out. overall, 5 stars and will definitely come back again.", "id": 199}
{"text": "Wonderful divey taco shop with awesome Mexican food. Highly recommend the tacos dorados, cheese enchiladas and chips with the salsa bar. The flavors are amazing! They must do most of their business as take out since it is so small, but the eating area is clean and nice. Don't be swayed by the strip mall. Definitely worth a stop.", "id": 200}
{"text": "THE MOST AUTHENTIC MEXICAN FOOD IN TOWN. \nDo not sleep on this spot, if you are ever in Vegas definitely stop by... I cant think of my favorite dish because you cannot go wrong with anything on the menu; The menudo The cocteles, The enchiladas. Mm everything is bomb! and always great customer service and very clean nice little shop. Love it.", "id": 201}
{"text": "Craving for authentic Mexican Food and feeling adventurous and out of your comfort zone. Gotta try this humble and family operated place. Everything I had was simply delicious and would go out of my way to venture in this neighborhood for Tacos and Mexican food\n\nThe cashier/server was very friendly and asked if it was my first time here. She answered my questions and made me feel welcomed. I originally was going to order Tacos only but the enchilada combo grab my attention and got the combo with a single order of Carne Asada Taco on the side because I had to get a taco too. \n\nWhen the order finally arrived at my table. I got the three different salsas that was available at the salsa bar. From the first bite of my taco and enchiladas 1-beef & 2-chicken combination along with the fresh salsas. Every bite was amazingly flavorful and authentic. The whole experience was great and felt like I was taking a short vacation in Mexico!", "id": 202}
{"text": "Man this place is bomb dot com - \nLet me tell you when it comes to Mexican good I'm picky  there's so many spots here in vegas so when something really catches your taste buds then you know lol", "id": 203}
{"text": "By far the best burrito and salsa I have ever had. This place is way across town from where I live but i go there just to get my burritos, yes if I'm gonna go across town I better get two burritos to go.", "id": 204}
{"text": "Legit food!! I had the chilaquiles with red sauce comes with eggs,  beans and the best rice I've had in a long time.. Definitely recommend this spot. They know how it's done", "id": 205}
{"text": "Best fish tacos! I also like the Carne Asada fries. The first time I had a chicken chile verde burrito.  But once I tried the fish tacos, I was hooked! The other burritos are good, too. My husband loves the pickled/peppered veggies. He gets a bagful and eats them while we wait. Family owned and operated. Friendly, cheerful staff.", "id": 206}
{"text": "I really enjoyed it here. The cheese enchiladas and carnitas taco were really good. The staff is very friendly, always nice to see positive happy people. I will be back for sure! give this place a try, you will enjoy it.", "id": 207}
{"text": "Only 1 review?? C'mon! This place has awesome food!! It's rough around the edges but don't let it fool you. Tacos! Burritos! 3 different soups!", "id": 208}
{"text": "Mi Pueblo Taco Shop is a family owned treasure in Las Vegas , Nevada.  Owners Juanita and Manuel make homemade Mexican food in small batches and treat E everyone like family.\n\nIt is outstanding.\n\nPaulette Motzko", "id": 209}
{"text": "Bomb! Fresh ingredients! \nYummy to my tummy! \nI would highly recommend this gem. This meal hit the spot, next time I'll try the enchiladas.....", "id": 210}
{"text": "I will say our expectations were guarded when we pulled up, but step inside and receive a warm greeting and look at the menu, you know all will be good, and it was. The burrito was tasty and plentiful, \"sandwich\" with the fried pork, Pastor tortas, absolutely satisfying, simple and perfect. The hot salsas were fun and tasty. Enjoy", "id": 211}
{"text": "Very good I recommend the fish tacos!!! And carne asada tacos! All with red salsa!! Bomb!!!", "id": 212}
{"text": "Great selection of hockey stuff, jerseys and gift stuff. Pricey, but if you want hockey stuff, they have it.\n\nYou enter here upon existing the Hockley Hall of Fame, or you can enter from the indoor mall. \n\nFood and drink are just outside if you are exhausted and thirsty.", "id": 213}
{"text": "The Spirit of Hockey is technically the gift-shop for the Hockey Hall of Fame but you can still enter from the main entrance even if you don't want to go through the museum (even though you definitely should!)\n\nThis store is pretty much exactly as you'd expect: wall-to-wall memorabilia of all your favourite NHL teams. While I was mystified at first, it quickly wore off. It kind of became of game of laughing at all the ridiculous things you can stick a logo on (would you like some novelty cups to go with your keychain??) \n\nHowever, the fact of the matter is that people do buy them so obviously there is a market for these things. I actually saw someone at the airport on his way out of Toronto carrying a giant Washington Capitals \"Man Cave\" sign that they had purchased at the store. I didn't exactly walk out empty-handed either (because who doesn't need a Harvey the Hound figure to sit on their desk??)\n\nAll of that being said, the store is well laid out and staffed by friendly, helpful employees, all of whom are enthusiastic to talk about hockey (or at least good at faking it!)", "id": 214}
{"text": "Ich fand es sehr schön\nGute kostüme\nGute Besetzung \nEin bisschen hat beim Bühnenbild gefehlt im Vergleich zu König der Löwen aber die haben ja auch ihr eigenes festes Theater \nTolle Musik\nTolle Stimmung", "id": 215}
{"text": "Mir ht das Musica sehr gut gefallen. In den vorderen Reihen tanzte der Affe...soll heißen die Darsteller bewegten sich auch im Publikum. Beeindruckend auch, wie sie durch den Zuschauerraum schwingen. Es ist ein Musical von dem ich behaupten möchte hat sich gelohnt dafür nach Stuttgart zu fahren. Auch die Plätze im Theater sind gut ausgerichtet, so dass man auch in den hinteren Reihen gut sehen kann.", "id": 216}
{"text": "Ich war nicht in Stuttgart im Theater sondern damals in Hamburg. Aber es war einfach ein Mega geiles Erlebnis und für mich eines der schönsten Musicals. Bühnenbild, Darsteller und die Musik einfach nur klasse und empfehlenswert.", "id": 217}
{"text": "We went during Thanksgiving weekend and realized they only had a buffet for $14-15/person. \n\nThe dosas were brought fresh to your table. Dosas were made from chickpea and rice flour (i.e. not authentic). But all restaurants here use this method rather than actually soaking \"washed urad dhal\" and rice and then grinding them and allowing it to ferment (have a bit of a sour flavour which I love). \n\nSambar was warm but the idlis and vardas and other dishes were cold. Sambar tasted okay. \n\nThree types of chutneys as well as lemon pickle. \nI liked the hoppers dish.", "id": 218}
{"text": "I used to love their ala carte menu...now they have all day buffet very bad and stale food.....avoid at any cost....we can't even order ala carte. ....", "id": 219}
{"text": "I am a big Saravana Bhavan fan. Back home in India as well as here. new to Mississauga. food is good. enjoy the buffet specially. Thali with tiny cups and variety dishes is another favourite specially the vata kolambu. I love the cabbage curry too. \nsamabr vada is another favourite. \nI was wondering about the tip money I left for the server. I did not see the server come back for it. but supervisor/manager lady took the money and went inside. I am wondering how much does the server get? I went twice after that day, but did not find the server who had served me. other restaursnts have a tip collection box and the money goes there. \nI was charged extra for a coffee I did not drink I brought it to their notice and it was taken off without an apology. \nwell, I love the food, and I am willing to overlook these thing.\nD James, \nEtobicoke", "id": 220}
{"text": "EDIT:\n\nI tried this place again almost after 2 years and it seems to have improved quite a bit. Possibly because of the new management. The food is much better now and we visit this place a couple of times a month and are pleasantly surprised with the changes. \n\n2014 Review:\n\nI'm really disappointed with the degrading quality of food and service at this place. I'm not a fan of this place, but decided to give it another chance as my friend wanted to eat here.\n\nThe place has been upgraded, which is about the only good thing with this restaurant. The new management is pathetic and the food equally worse. We went in on a Monday night for dinner and the waitress took our order and took close to half and hour to get our appetizer. The vada was spoilt and when we mentioned it to her, she just ran away and came back after a while to say that \"This is how it is\" !!! and she did not even apologize. How Rude!!!! She seemed to have a lengthy discussion in the Kitchen and another waitress came to our table and served our food almost 40 minutes later. She did however apologize for the delay. Much better than our previous waitress. We were appalled at the quality of service here and vowed never to come back here again and recommend people from going here ever.\n\nIf you'd like to get good South Indian food in Mississauga, goto either Udupi Madras Cafe or Chutney Swamy or Guru Lakshmi.", "id": 221}
{"text": "Been in to eat and also have picked up takeout. Great menu, fair prices. Food was solid. I will return.", "id": 222}
{"text": "Had heard so much about Saravanna Bhavan- we just moved here from California and was excited to give this place a try. The service was non-existant...it was as if they were doing us a favour by serving us lunch. The supposedly spicy 'kara' dosa was tasteless and the potato stuffing inside was a violent red colour- using red food colour does not make anything spicy people!\nMy friend ordered another dosa which was so greasy that it had no taste but stale oil.\nThe thali looked OK but tasted zilch. The little bowls that the sambar came in...that was a mystery...some of them were stuck inside the other- probably the dishwasher could not get them separated- so basically that meant that the lower one was dirty. When we complained the server mumbled something and then never showed his face. \nNever going back here again", "id": 223}
{"text": "Three stars for the absolutely amazing delicious food. They lose two stars from me because their service is HORRIBLE. Not only are they EXTREMELY slow, they don't actually care about it. They forgot half of our meal about 20 minutes after the first part was brought to the table they \"remembered\" one dish was completely forgotten about, had to ask (the girl who was sitting on her phone in the corner) to please it to us. We couldn't even get them to bring the bill after asking twice. \n\nIf you don't mind waiting or being ignored. At least the food is very good.", "id": 224}
{"text": "Good value for food however I have always had an issue with their cleanliness. Overall not super clean but ok. Food quality is ok. Overall value 5/10", "id": 225}
{"text": "again - as usual - it's amazing!!", "id": 226}
{"text": "It seems that a lot of reviewers have already shared their strong feelings on the flavor (or the lack thereof) of Saravanaa Bhavan. To be honest, it's not terrible like some of the reviews would have you believe. But it's not particularly amazing either. Maybe if we had ordered from the menu, it would have been better, but we opted for the buffet option, and it was all... one-note... Not bad. Just not mind-blowing. It was food stuffs that helped fill our bellies before we left town. It's closer to a [*][*] experience in that \"I've experienced better\" but a lot of the [*] reviews are unnecessarily harsh. \n\nI didn't touch the sambar. Sambar is one of those things that varies quite a bit even between two people from the same part of India. Personal experience has taught me that ingesting sambar (especially sambar that you've never had before) before a long road trip (or in my case, a long road trip and then a long plane trip) is asking for trouble and shaky leg syndrome.", "id": 227}
{"text": "5 stars if you eat at a saravana bhavan in Chennai,India, but not here. They are not able to create the same magic here.", "id": 228}
{"text": "I would like to update my review on this place based on my experiences since.\nI decided to try something different other than the usual thali. So I tried their Kara dosa, which came out to be a thick, soggy dosa with a sweet tomatoey sauce. Then when I visited again I decided to give their dosa's another shot and opted for their Mysore masala dosa, which I have loved in other restaurants. They warned me that this dosa is supposed to be spicy but I can handle heat so I was fine with that. But again, I ended up getting a overly thick dosa that was too soggy and tasteless. My brother got the chole bhatura, which he enjoyed but complained that the bhatura's were a bit too oily. \nSo I feel that ordering something other than the dosa would be your best bet because their dosa's are just not worth it and you can get much better ones at Guru Lukshmi or Udupi.", "id": 229}
{"text": "For my money, Saravana Bhavan is just perfect. food for a great price.  Crispy, smooth dosas and bubbly, chewy uttapam.  The Sambar is just like Dosa in SF, packed full of leaves, seeds, and spices that hit your taste buds in all the right places! \nThe staff are super nice and kept making sure we were satisfied. \"More sambar, More Chutney?\" \nYes, please! \nAfter getting way more than 2 people could eat (come in groups) we packed it up and of course left with more sambar and more chutney.  \nSat and Sun, the buffet offers all the south indian food you could eat, (AYCE) and desserts. Try just a bite of these super sugary, fried desserts and think about jogging back to downtown TO.", "id": 230}
{"text": "Been to this location thrice at different times. The service has been pretty consistent - quick and efficient. I will not expect more from an Indian restaurant.\n\nThe food has been really good for the most part. Here are the things we've tried - \nThe vada sambar is top-class; fresh, hot, soft and super tasty.\nThe bisibele bath is good with plenty of good flavour. The onion rava masala dosa is crisp and filling - the best I've had. One star off for the rava idli that lacked life... Otherwise you cannot go wrong with anything here!", "id": 231}
{"text": "I love the manager here, he knows us for a very long time. I like their food. The servers change so often that we don't like it but still they are much better than a lot of other restaurants.  \n\nFood - 4/5\nService - 4.5/5\nManagement - 5/5", "id": 232}
{"text": "I am a huge fan of Guru Lukshmi and they set a really high bar for dosa in GTA. Unfortunately, Saravanaa Bhavan was a big letdown. We went in pretty late on a sunday afternoon. The decor has been recently upgraded which gives the place a clean modern look although it is still based in a strip mall. \n\nMost tables around us were having the thali which should have given us some strong signals. \n\nWe ordered the vada sambar but the quality of the sambar was not good. The vada was not crispy as well which let the whole dish down. \n\nThe onion and chili utappam was the biggest disappointment. It was so thick and dry inside that after a few bites we just did not have the appetite to finish it. The chillies were huge and it was quite a task to remove them from the almost thick pizza crust like utappam. \n\nThe saving grace was the onion rava dosa but they had stuffed pepper in it which was annoying since it was quite strong. The accompanying chutney portion is too small and they were not flavorful at all. \n\nI am never going back again! Go spend your money at Guru Lukshmi. I am surprised they are a global chain with such poor quality of south indian food.", "id": 233}
{"text": "Saravanaa has gone on a steep downhill trajectory over the past few years in food quality and service. The only upgrade as of now is the restaurant itself. A few months ago it was very unattractive, almost cafeteria style, with hard seats like you would find in a food court. Kudos to them for getting a massive facelift. I wish I took pictures, but it looks lovely inside. They even have an electric fireplace (for some reason) in the tiny entrance. \n\nBut ambiance aside, the food itself did not get a similar makeover. I will never again order a masala dosa from this place. There was a mere SMEAR of potato bhaji, a few tablespoons at most, in my dosa. The chutneys were pretty bland and also in small amounts. The best thing was the sambar, spicy and warming. The dosa itself was very oily.\n\nMy dad had the Saravanaa Special Meal, which consisted of ten TINY dishes (curries, chutneys, curd and a gulab jamun), rice, two papad and two pooris. As is the apparent custom here, the poories were miniscule. They were baby poories. I mean, how much are they saving really by cutting the quantity of their menu items? \n\nAnd it's not like this place isn't hopping. We got there at 7pm for dinner and already a queue had formed. This was the trend for the rest of the night, and people even crowded outside and left when they were told it would be a half an hour wait.\n\nThe waitstaff were pleasant enough, although our server tried to take away my plate before I had finished. They also left the front door open for a while, telling us \"the air conditioning was not working\". It is necessary to note that it was 10 degrees tonight, not a balmy summer at all. \n\nThis restaurant is NOT good for groups. There are tables of 4, and they can put a few together if needed. But do not come in with a group of 15, like people did tonight, and assume you will get a table quickly. Check ahead of time if you can make reservations.\n\nMy mom had the best meal tonight, the Mini Tiffin. It came with uppama, mini idlis in sambar, a mini dosa (with probably the same amount of bhaji as my dosa!) and a sweet. The sweet sheera was delicious, with cashews and raisins. Sad I didn't go for that.\n\nPROS:\n- nice ambiance, comfortable booths\n- delicious, spicy sambar\n\nCONS: \n- oily dosas with virtually no filling\n- crowded early, stays that way through dinner\n- NOT good for groups (call ahead)\n- hasty servers who do not consider the weather\n- miniature food", "id": 234}
{"text": "Great Masala Dosa - the mustard seed flavour of the Masala is perfect. The Parotta was good but not excellent: a bit small and not quite the right flavour compared to other Parotta I have had. The Rasmalai dessert is fantastic - although the presentation is nothing like the menu picture (no saffron strands) and suffers as a result.  I will definitely come again if I am in the area. For those new to South Indian food, it would be a great introduction, but those who are picky may not like it as much.", "id": 235}
{"text": "We usually go to Anjappar Chettinad one weekends when I have a strong craving for a South Indian breakfast. My review is going to be a mild comparison of the two. \nWe decided to try Saravan Bhavan a few days ago as I like trying different options. \nThe breakfast buffet on Sunday is from 10-12 and we had arrived at 11:10 to quite a line up. We were seated at 11:30. \nThe first thing I noticed was that the dosas, idlis and vadas are much better than anjappar and are really well made. The sambhar and tomato chutney is delicious as well. \nOne of the reasons I crave this breakfast is because I love Rava Kesari and Payasam. The rava kesari was quite tasteless and the payasam seemed to have been thickened with starch rather than reduced the way it should be. \nWe asked for two coffees as we noticed that there were no beverages in the buffet area (In comparison, anjapar has coffee that you help yourself to) and they brought us two very small coffees that were quite good. We didn't know until it was time to pay the bill that each of the 150 ml coffees were $2.25 each adding $4.50 to the total. \nFor two people with coffee the bill came to $29.90 plus tip. \n\nI have rated it two stars because of the overall experience - food, service and pricing. \n\nFinal verdict: Liked- vadas, dosas, idly, sambhar and taste of the coffee\nDisliked: Service, wait time, pricing, poor tasting deserts, overall experience. \n\nWon't return.", "id": 236}
{"text": "Love the dosas here. The size of a dosa is smaller here but it is also cheaper. A great bang for your buck. Service is prompt and staff is friendly. The restaurant is usually packed and is also quite spacious", "id": 237}
{"text": "Best south indian food in Toronto. Everything freshly prepared and I am surprised at all the negative reviews posted by some members. The service was slow but maybe due to the large number of people.", "id": 238}
{"text": "New Management is crapy. Quality of food very low. Used to a big fan of this restaurant but will not recommend it to anybody. Please dont eat there.", "id": 239}
{"text": "The food here makes me forget that I'm not eating meat. I'm a carnavore and make few eceptions about not having some meat on my plate, but I have to say I don't even miss it when I eat here. My wife and I have only ever gone for the buffet. I eat my vada with sambar,  my dosa with rice and tomato chutney, and my puri with potato or rice. It tastes amazing and I've never left without being so full that I'm uncomfortable, which is a good thing. The only reason I don't give them five stars is because they need to expand. It's always so busy that the service is close to chaos. But I'd much rather have great food and slow service than great service and terrible food. I recommend this place to any meat lover like myself to prove that the occasional meat free meal can be very enjoyable.", "id": 240}
{"text": "This was THE SHITTIEST first-dosa-tasting of my life. I know it's impossible to rate my first-tasting of anything, but I'm pretty sure when you get a sour stomach and horrible shits after being at a restaurant - it was a horrible first experience. \n\nI really hope dosas don't actually taste like what they did here. The food item itself can't be that horrible or else no one would eat it, right? But you see, I'm traumatized to a point where I might not even consider re-evaluating what they taste like and just leave it at that. \n\nThe service was shoddy. The drink prices (non-alcoholic) are shitty for the amount you get, which is close to nothing. The venue looks like a McDonald's in an airport food court. If this is what they think south India should be, then I recommend that Britain reoccupy. \n\nThe only thing I'd recommend is the Madras coffee, to-go. That's the one thing they didn't manage to screw up royally.\n\nAnd paying $30 for all this, that was the rotting cherry on top.", "id": 241}
{"text": "This is a poor version of this esteemed franchise. Sambhaar lacked any tamarind and looked and tasted like daal. Chutneys were also subpar. The dosa was strictly ok. The Scarborough branch is much better. Very disappointed.", "id": 242}
{"text": "I have been to Sarvana Bhavan a zillion times, okay probably not zillion but you get what I mean :) if you are a true south indian food loyalist you will like the food. It offers good south indian food without the bells and whistles like Chinese hakka Masala dosa or the likes!! The food is very true to its roots and the chutneys and curries are cooked in chennai - tamilian styles.  \n\nThe place recently was revamped and is more organized and looks much neater. The servers are polite and the food is delivered without a very long wait time. \n\nI ordered the thali and it was very very delicious !", "id": 243}
{"text": "Average! They could do so much better. No exceptional flat ours. Poor is were way too small. Only redeeming feature was the pappadums. \nService is attentive but we have had much better South Indian.", "id": 244}
{"text": "I went here to have authentic south Indian food, however I was very disappointed.\nAlso the quality of food is low compared to their Scarborough location.\nIf you are looking for authentic South Indian food, I would not recommend this place.", "id": 245}
{"text": "Overall:  Worth the trek to Mississauga.  Great value, great taste, great people. \n\nRoom: Not fancy, spacious, clean\n\nService: Friendly, even avuncular (more materteral), everyone's an auntie, and frankly a bit concerned that i wanted a second coffee \n\nMenu: Thorough south indian menu, tough to decipher without guidance from someone who knows the cuisine\n\nPresentation: Traditional south indian restaurant, paper dosas are intimidatingly big but that's why you get them \n\nTaste:  Delivers on south indian vegetarian goodness.  \n\nValue: There's a reason this place is packed with Indians.  Tastes good and cheap!", "id": 246}
{"text": "Love the food.. We order thali last time, my god there was so much to eat.. Every bit of dish tastes heavenly..", "id": 247}
{"text": "Reasonably good food but again the downside with this place, just like most other Indian restaurants is the service. The servers are unsmiling but not as bad as in most other Indian places. Depending on the time of the day, be prepared to endure some heavily irritating and ill mannered crowd. The food is however quite delicious and very fresh. For this reason I will keep on going back.", "id": 248}
{"text": "Poor service. Watered down sambhar! Cold idly and poori!! I have been coming here for past 2 years. There was never once when I had received good service. The server working there seems like he hates his job. He's been working there for as long as I dined there.\n\nThe dosa is average. However! The idly and poori always arrives at our table cold. The poori is so hard that it's barely edible. 50 % of the times, you will get good sambhar. But 50 % of the times you will get sambhar that is watered down and looks like water too.\n\nI really hope they improve their service and food. Don't serve the stale and hard poori to your customers!", "id": 249}
{"text": "I will never return to this place! They made us wait for 20 minutes even though there were rows of empty tables. Then when seated, again another 15 minute wait and I had to ask to be served. We had a pretty simple order-2 people, 4 items. They managed to mess it up. Food took forever to come and one item was missing. When I asked for the item the wait staff denied I had ordered it-their computer clearly confirmed otherwise. The manager came by and said 'sorry we can't handle the crowd.' Um...you're running a restaurant with a certain number of seats. What are you doing if you can't handle the customers? And to boot-they offered us a free dessert (which we didn't want) but didn't take a penny off the bill. \nThe food was mediocre. Stay far far away from this place. I'm sure there are better places for a dosa craving.", "id": 250}
{"text": "Went for Saturday dinner with 4 ppl.  Very friendly and knowledgeable staff.  Extremely clean!!!  Love the hand washing station!!!  Great service and fantastic food, however only gave 4 out of 5 stars for two reasons:  (1) waiter forgot to bring our lassi (yet it was charged on the bill and we had to ask for it to be removed.. oh well, not too big a deal, it was an accident), and (2) the timing of bringing our dishes.  We ordered one appetizer to share, and four entrees.  One entree came first, several minutes later the appetizer came, and then several minutes later second entree, and several several minutes later the third entree, then much later the last entree came.  It wasn't ideal for us to be eating one at a time, lol.  This is a great restaurant to try if those two things don't bug you :)", "id": 251}
{"text": "Tasty food , nice clean place . prices little bit high for dosas but similar to some others in the area. Try some of the specialty dosas.", "id": 252}
{"text": "Great place if you want to taste real South Indian food. Great customer service. The food was tasty, specially their Special Meal with different curries and rice. So far I have had very experience with this place after several visits.", "id": 253}
{"text": "I've been to both the Scarborough and Mississauga locations and I prefer the Mississauga one because of cleanliness and also they have washroom and hand-washing area tucked away in the corner. \n\nThis time I ordered the paper dosa, sweet lassi and the special madras coffee.  The dosa and lassi were great.  The coffee was awesome! I'm not a coffee drinker but I liked that fact that it wasn't strong (they can make it strong if you want it that way) and I asked for sugar on the side. It comes in a cute little stainless cup in a small bowl and it has a lot of froth on top.  All in all a tasty meal.  At the end (where the cashier sits) I had some of the saunf (fennel) with candy...its good for digestion and its nice to eat something sweet (and free) at the end of the meal.", "id": 254}
{"text": "Saravana Bhawan has regained its touch after the last review though the Manager can certainly work on his attitude.", "id": 255}
{"text": "Today I went to sarvana bhava with my family at scarborough location this is one of the worst sevice I got I went with my infant baby (I had requested a seat in corner for my baby but the waiter was very rude he was more interested in accommodating other guest though place was relatively empty) and the service was pathetic. waited half an hour for tandoori paratha after finishing fist one and which never cameI wont recommend this place for anyone", "id": 256}
{"text": "It's inside the mall and the food is awesome! Probably the best authentic Chinese dinner you can have on Christmas Eve in North Carolina. Just don't peek in the kitchen. You're all good.", "id": 257}
{"text": "A diamond in the rough... I get off the highway just to grab lunch from here. Remind me of the authentic Chinese take outs in NYC", "id": 258}
{"text": "It helps to have someone understand the language while in the Hong Kong BBQ, but they do have english menus that you can use on the counter.  It is pretty cheap for some good food.  Just ignore the pig hanging from the ceiling if you find that gross and also ignore the food rating as I survived my visit and I am sure you will yours.  Just make sure to wipe down your silverware when you get them.\n\nPersonally I really liked the BBQ pork which you can see hanging with all the meat in little strips; which, they cut up and serve with rice is really good.", "id": 259}
{"text": "This is as authentic as you're going to get.\n\nI'll be straight up when I say that places like this can make me nervous.  The mall itself is sketchy...and it's in a sketchy part of town.  I make it this way every few weeks for some bánh mì at Le's, but came on a day that Le's was closed.  Dim sum?...or the place with ducks hanging in the window?  We opted for the ducks in the window and chose Hong Kong BBQ.\n\nWhen you enter Hong Kong BBQ...you can tell there's going to be a communication issue.  There is literally...not a single thing resembling \"American\" in this restaurant.  I knew I was going to like this place.  I did my best not to look back at the kitchen.  We all know what that is going to look like...and I'd rather play dumb.  Dangit!  I looked.\n\nThe service was quick and the food was great!  We were even entertained with Chinese soccer on their small TV.\n\nI'd recommend coming here if you're an adventurous person...otherwise...you'll never make it as far as the door...much less the table.", "id": 260}
{"text": "I took my 2011 Q5 in for a LOF (Lube, oil and filter). Went to pick up the car and was told it was $250 for the invoice, including a $72 charge to reset the service light which was not quoted. BTW this is like a 5 minute procedure that they charge you 30 minutes to do.\n\nI'll never go back there. \n\nI went to Midtown Audi in Agincourt previously and had excellent service. I didn't go back there because it takes weeks to get an appointment. \n\nI was able to get into this dump the same day, now I know why!!!\n\nAvoid this place!!!!!", "id": 261}
{"text": "The worst service dept experience. The two people i dealt with  were defensive  dismissive and rude when posed simple questions. Especially on cost of items,In this case tires. There was a price difference of over two hundred dollars between tires and install between downtown and audi dealers north of city.  This was a second chance  for audi downtown for me because of a previous visit  that went bad and the manager called to apologize then and said give us a chance so we will make it right.  Sorry  i will never go there again.", "id": 262}
{"text": "This place is horrible with the worst service ever!  The sales reps were very attentive when I came in to buy my car. After that, every time I came in for service was a nightmare. I made an appointment for service just this afternoon, and I came in at 2 pm, then I've been waiting for more than 2 hours for the service to be completed! I was told that they would arrange a shuttle service to get me home, and I've been sitting in the lobby waiting forever ! Then the last time I checked with them, they told me that where I live, which is Bloor and Dufferin, which is practically still downtown, is too far, so they can't drive me home,\nbut they can drop me off at a subway station. Then the guy promised me to drop me off at Young and Bloor, and told me their driver was outside and would be back in 5 mins, then I continued to wait, for another 45 mins until my car's ready, and I drove home. I am extremely unsatisfied with the service, because of that, I need to re-arrange my plans for the afternoon. The guy at the desk was like \" It's been crazy today. There's nothing we can do\". If you are considering getting an Audi, I strongly recommend you getting your car at other dealers. The service here was unacceptable. I also came in once because I noticed the drive's side mirror didn't change angles when I back up, and it supposed to. I had to explain it over and over again, but they failed to fix it for the first 2 times. Overall, I am so disappointed with the service, now that my warranty is expired, I don't think I'll ever come back.", "id": 263}
{"text": "Just bought a new A4 from Keif Grey. What a great atmosphere at the dealership, no pressure from Keif or Alexandra in finance and everyone else was very friendly also. Buying a car can be very intimidating and they took all that away. \nRobin the sales manager also helped make my decision easy. \nWould recommend them to anyone looking for a new or used Audi. \n\nThank you.", "id": 264}
{"text": "Just went here for lunch and it was really wonderful. We had the burger from Fire and Forage and the B.L.A.T.. Both REALLY good. Great atmosphere too", "id": 265}
{"text": "Totally cool hangout! I found this place when I was out jogging around Tempe Town Lake. It's a quaint little house with a really cool patio. They have about six beers that they brew and another six to eight beers that they bring in. There's a food truck parked on site, I ordered the street tacos. \nI love the inside as much as the outside. There are plenty of tables, high tops, low tops and  bar seating.  This place has a cool vibe. Staff is friendly. They were more than happy to give samples of their brews with no charge. That, in my opinion, is good business.\nI will definitely be back for another visit .....soon! \nLoved it!", "id": 266}
{"text": "New to the neighborhood, and certainly a welcome addition. This place is worth taking the path off Mill. Great beer, staff and vibe. Do yourself a favor, and stop in savor the flavor. \"I just made that up\" :)", "id": 267}
{"text": "The Shop Beer Co. knows what they are doing! I went here last weekend with some friends, and had a wonderful experience. The staff was very friendly and efficient, and the ambiance was really great. There is a beer garden out back complete with a food truck and plenty of seating. I had their Sunset Daydream IPA & it was delicious! Very refreshing, summery with the right amount of hops. I will definitely be coming back, and would recommend this as a great spot to come with friends or to grab a quick beer after dinner!", "id": 268}
{"text": "Keepin' it simple & all about the beer! Love the vibe. No TVs, no sports games blaring. Just drink some beers and talk to your friends! They had a few different IPAs on tap, of course I tried them all. We had just ate dinner elsewhere, so we skipped the food truck, but will definitely be back to try!! They're just getting started, and I'm excited to see what's next for this new spot!", "id": 269}
{"text": "My friend told me about this place and it has easily become my new favorite local brewery. I usually come here on Wednesday's for their Randall (they infuse one of their beers with some other yummy ingredients)--I just recently had their pale ale with persimmons, dates and currants and it was so tasty! The food truck out back (Fire & Forged) cooks up some amazing, fresh food and switches up their menu frequently. The back patio is beautiful and dog-friendly. This place just kills it all around.", "id": 270}
{"text": "Great service (Amanda) and solid but average beer. This place has potential, and they are clean with their styles if not adventurous. I look forward to what their future may hold.", "id": 271}
{"text": "Delicious fucking beer!\n\nOne of my favorite beer festivals is Made in the Shade in Flag because lots of awesome breweries show up and I get to try so many new beers.  I stumbled upon The Shop's tent in the first hour and I didn't leave.  I kept going back because they were pouring this delicious IPA that I couldn't get enough of, I didn't care what anyone else was pouring - it was that good.  \n\nWhen I got back to Phoenix I couldn't find the brewery anywhere.  No one had heard of The Shop, it was like I made it all up in my drunken stupor.  Finally someone did mention the name and I got the scoop that they wouldn't be opening for until August.  I started counting down the days till opening so I could get a taste of summa that epic beer, today was that day!\n\nMy favorite brew is a double IPA is called FYITM.  Someone told me it stands for Fuck You In The Mouth and I don't know if that's true or not but I do know that my taste buds get an orgasm every time the beer enters my mouth so I think it's a solid name.", "id": 272}
{"text": "Incredible asian fusion, and an impressive sake list, if you like that sort of thing. Mmmmm... coconut-crusted mahi mahi.... Just start ordering and keep going until you are full.  But save room for the dessert sampler plate.", "id": 273}
{"text": "Delicious food. \nGood service. \nBUT-- if you are allergic to shellfish BEWARE-- they do not label all the dishes that contain shellfish.  You might order, say, the tomato bisque or the black cod, only to find out later (the hard way) that they contain such items as shrimp paste or oyster sauce.", "id": 274}
{"text": "I'm a little wary of Asian fusion restaurants, and I wasn't sure quite what to expect from Muramoto, but my dining partners (a chef and a personal chef) and I were thoroughly pleased with our light dinner on Saturday evening. \n\nWe had two rolls, one eel and avocado and another tuna, avocado and some other stuff - both were fantastic. After seeing someone else with it, we also ordered the calamari with slaw and chili paste and, by far the best dish of the evening, the black miso seared cod. I've been remembering that cod all weekend, it was so good. There were a lot of other things on the menu that I wanted to try as well. Maybe another time.\n\nActually, everything was really, really good. This was a place I would want to revisit if I lived in Madison. Although we didn't order anything off it, they did have a specials menu with at least three items, and the very extensive sake menu. \n\nContrary to what one of the other reviewers said, I think it would be really hard for the average person to spend $100 alone unless you just stuffed yourself silly. We ordered five dishes total and two small bottles of sparking sake to share among three women and the bill was $85. Actually I couldn't quite believe how reasonable the bill was when it came. \n\nBTW, make reservations. We weren't in a hurry, so we went and had a drink and came back, but the dining area is quite small, so if you have more than two people you'll definitely want to call ahead on a weekend evening.", "id": 275}
{"text": "Muramoto is a paradise if you are a sake lover. Their collection is enormous and I believed the owner claimed Muramoto has the best collection in midwest. If you are a sake lover and haven't been there, what  are you waiting for? and if you don't usually drink sake, you should still try the sake out (especially the ones list under fragrant) and you might change your view about sake forever.\n\nFor the food Muramoto is Asian fusion in tapas style. Although each plate might be only around $10, most of them are not filling (rolls are the exceptions) and at the end combining your sake bill the check might cost as much as $100 per person.", "id": 276}
{"text": "Kushi bar will close at the end of August (may already be closed)\nhttp://77square.com/food/restaurants/story_462727", "id": 277}
{"text": "Wandered in here looking for the restaurant and they told me to go down the street.  They have some food, but it's not the same as the full restaurant.  However, their shochu drinks are more extensive at this location, so I had a shochu shiso mojito.  It was okay--not my favorite, but not bad either.  Maybe I should have tried a drink that wasn't trying to be another drink.  \n\nAnyway, the place is really nice, the bartenders are really nice.  Well worth a visit.", "id": 278}
{"text": "Although I regularly miss Dog Eat Dog around noon every week day, I'm pleased that Muramoto replaced it and gave us a place to blow our cash on Sunday nights. The chef's tasting is key. And use the bathroom with the sink that makes you want to get out your GI Joes and Barbies and play in the bubbles all night.", "id": 279}
{"text": "Please note: Pricey, gourmet Restaurant Muramoto has moved down the street, and Kushi Muramoto has become a sort of \"Izakaya\" style place. Think Japanese Tapas. Reviews prior to November at this location should be thought as applying to it's new location, just down the street. \n\nI was not impressed by the food at Kushi. Your order will come out quickly, because almost everything is fried, fried, fried. The exception is the Donburi -- something yummy on rice. Our Eel Donburi was solid, and decently priced for $8... but if you're a Midwesterner with a healthy appetite like me, don't think this will make a meal. \n\nI also have a complaint about the drinks. My Cosmo was delicious -- and also standard Cosmo size and price ($7). However, because they make all their mixed drinks here with sake instead of vodka, what you're getting really packs much less of a punch than what you'd get elsewhere.\n\nThe pluses are this: The atmosphere hasn't change since this was the pricey Muramoto, So it's a groovy low-lighting place to hang. Also, it's really reasonably priced. $4 drafts. $1.50-$2 things on a stick, $5.50-$8 for Donburi. So you can go out and feel like you're getting the \"Muramoto Experience\" without bleeding yourself dry.\n\nHowever, when they said \"fried Snickers are our only dessert and they're only 2 for a dollar,\" I was so sick of panko fried tidbits, I said \"no\" without a moment or regret.", "id": 280}
{"text": "Oh my did this place not live up to the hype.  It was heinous how sloppy our rolls came out, my date's food came out a full 20 minutes after my own, and the black cod was incredibly salty.  The place looked \"hip\" but that's about as cool as it got.   If you are looking to make a fashion statement then by all means dress yourself up and head to Muramoto, if you are looking to enjoy your meal (be it tapas, sushi, real japanese or some fusion) look elsewhere.", "id": 281}
{"text": "ASIAN FUSION WITH INCREDIBLE SAKE MENU.\n\nAll info I've seen says 'tapas style', but I will tell you - these plates are not too small, and quite filling. Their other spot cross town is an incredible sushi restaurant with everything under the sun. Here, only have a few rolls on the menu (and they are incredible), but that is not why you come. Come for the tasty, hot dishes, and for the sake flights.\n\nEvery so often, you eat a meal that is soooo good, so perfect in almost every way, and the tastes are so unforgettable, that you want to get right up then and there, and do what I affectionately call, The Food Dance. This is food that makes your eyes roll back into your head with every bite, and leaves you wondering where the hell you have been eating all these years. This was, hands down, my saving grace in Madison. Presentation of the food is spectacular. Eating alone? Sit at the bar and stare at um-teen bottles of Japanese sake. Eating with a group? Even better, as the sushi rolls they do have there (soft-shell crab or avocado and mango roll w/ thin-sliced duck breast on top, drizzled with a duck reduction sauce, or a few others) are HUGE. Don't think California sushi, as each roll which costs $10 has about ten large slices, and you will find it hard to eat an entire one by yourself. These rolls would easily be double the price if this was in SF.  Look for Michael, the tall, bald-shaven, server/barman that knows everything about the menu, and can recommend many good sakes on the list. Try the sake flight (3 glasses) for a nice accompaniment to any meal. Now for the best part........you want small slices of some of the tastiest beef anywhere? Get the hangar steak. Not a large portion (meaning not a whole steak) but you get several slices of this beef, drizzled with a white miso-bleu cheese sauce that is to DIE FOR. Not a fan of bleu cheese? No worries, as the taste is made subtle by the combining with miso. But please, do yourself a favor - ORDER THIS DISH! Not a big beef fan? That's fine, as the Grilled Miso Black Cod is their signature dish. My suggestion? Start with some sake, and order yourself one sushi roll, and one hot dish. Take a few people, and everyone order a few different things, and share. And won't you be happy when you get out of there, after all this tasty food, and still you are not over the per diem. And if you are, maybe you shouldn't have had that third drink. Be advised - this place has a little wooden sign in the window, and it took me forever to find it. Do me one better, and take the address WITH YOU when you go!", "id": 282}
{"text": "Who says the Midwest can't have tasty seafood?  Dim and intimate, Muramoto is easily one of my favorites places in Madison.  A varied menu with some fantastic Asian-inspired cuisine, this ain't your grandmother's Friday night fish fry.\n\nUpdate:  swing by on Sunday night to try the blind chef's tasting.  4 courses ending in dessert for $30.  Never disappointing.", "id": 283}
{"text": "I am infatuated with my new love, Muramoto. At first, I was highly doubtful the state of Wisconsin could feature decent sushi but boy oh boy was I wrong. Mad props incredibly for the fact that they feature a deeeelicious Philly role with salmon and cream cheese. Heavenly! I enjoy the fact that they serve their edamame with big grains of salt to give it an extra kick. And last but certainly not least, I could drink a million of the Russian teas (a smooth mixture of kahlua and green tea vodka, which I have never tried or seen before this restaurant introduced me to it!) \n\nI end my Valentine to Muramoto with a shout out to its modern decor that made me feel like I was in big city again, and that it smells like fresh sushi on the inside, since most Japanese restaurants don't smell like anything! This is the first place of many in Madison that I have graced with 5 stars because I was that impressed!", "id": 284}
{"text": "Muramoto has moved into its new space and its all good (great space, expanded menu, same great staff)...but, I strangely miss the old space. Maybe some therapy for this reviewer.", "id": 285}
{"text": "The food here is amazing.  Kushi is like Japanese tapas - all small plate dishes here.  I went here on a date and enjoyed everything we ordered.  It was pretty deserted on a Tuesday night, but I've seen more people there on the weekend.  The ambiance is loungy - and pretty dark, so it gives off a romantic vibe.  A bit expensive, but worth it.", "id": 286}
{"text": "Graduated in 2012, school was ok. Nothing really hard even though I took honor classes and one Peggy Pane class. Some of the teachers are cool though such as Ms. Gazier. Take her if you take honors chem. There's also Mr. Barkdoll. He's always funny and makes math really fun. Another teacher would be Mr. Bailey. Very easy going guy and an easy A if you show some effort and not be obnoxious. Some of the stuff isn't mandatory, such as Pep rallys, just sleep in and go to class 15 minutes before the pep rally ends. Basically, just enjoy high school on how easy and how little responsibilities you have before going to college.", "id": 287}
{"text": "Has the only Peggy Payne Academy in the world that I know of, which is amazing!", "id": 288}
{"text": "First time at this place and they just got a loyal customer. Service was amazing and the spa pedicure was the best I've had in years! The gels nails were also great and a great hand/arm massage to come with. The price wasn't bad either!!! I am definitely coming back!!!", "id": 289}
{"text": "This place is so clean. They engage you and talk directly to you and no cross talking. The owner runs a tight ship and you can tell. I really like coming here and always leave satisfied. They do such a good job. A spa pedi is only 22 and its amazing. Go here!", "id": 290}
{"text": "Awesome experience, Brenda took her time and did a great job. Salon was clean, prices were reasonable.", "id": 291}
{"text": "Steven is the best here. He listens and does what you ask. No sharp square nails here. He does a great French pedicure. The price is great can't beat it.", "id": 292}
{"text": "I just moved to Phoenix and decided to try this place out. It's very clean, lots of colors to choose from, and close to my house. Every time it come in here they seemed very rushed and try to get you out of the door as quickly as possible. No room for relaxation. One time I did back my nails done by Steven, he's by far the best and takes his time. I'll probably be branching out if I can't reserve with him in the future.", "id": 293}
{"text": "First time at Fancy today. Walk-in appointment and I got sat immediately with Ha. She was very good! Very clean and quick technique. The salon is very nice and welcoming...they offer coffee, water, etc. I recently moved to the area and will definitely be back!!", "id": 294}
{"text": "I was looking for a nail parlor that was close-ish to my area, and this place by far had the best and most consistent reviews. Called to make an appointment to do my gel nails, and the man on the phone was very clear about directions. Upon arriving there i can absolutely see why people might get lost. They're tucked into the back of a complex on Rose Garden lane. Easiest way to get there would be to turn and go east onto Rose Garden lane and then turn left (north) into the red brick complex. They're straight ahead of you there. \n\nIt's a nice new place, and was pretty busy when I got there, even though it was 1000 on a Saturday and they had only opened at 0900. Most people were actually there for pedis. Since I had an appointment I was seated almost right away, and they got down to removing my previous gel manicure and get a new one on me.\n\nI do have to make a disclaimer- I hadn't always had a great experience with gel nails. I did them for my wedding and loved them, and went back to get them done after they grew out, for a bachelorette party in Vegas. The removal process was horrid- they used this thing to scrape the stuff off and it felt awful. And then I left, went shopping and literally in an HOUR had a giant chip. Of course there was no time to go back and get it fixed. It was a very disappointing experience.\n\nBut getting mine done when I was out of town had been pleasant, and my best friend said she was addicted to them. So I decided to give it a shot again. \n\nAnd I'm glad I did. The removal process here was quick and painless- the gel manicure crumbled off when it came time to scrape it off, no awful sensations necessary. They had a great range of colors, and my lady even tried to recommend another color for me. (I wound up sticking with the color I wanted). The nails were beautifully done, and she did them promptly- I was in and out of the place in under an hour. I did decide to wait about a week to do a review, to see how well these puppies wear. The manicure I had prior to this chipped a bit on the thumbs within a week, which was also a bit disappointing.\n\nA week and these nails look as good as they did when I left the salon. I'm hard on my nails too- I pound at a keyboard, and have two big, rough dogs at home. These still look great- no chips, wonderful shine. \n\nI think I might have found my newest addiction, and I'll definitely be back to get them done again! \n\nPlease do note that you can pay with DEBIT cards, but not credit. Also, like several reviewers noted below- bring CASH to tip.", "id": 295}
{"text": "Since I moved to Phoenix, I've happily driven 18 miles (one way) to have my nails done here.  Definitely the cleanest nail salon I've ever seen.  I like that they use disposable liners in the pedicure tubs.  Amazing colors of gel and regular polish.  Friendly and detailed staff.  Wish I could give 10 stars.  Very reasonably priced.", "id": 296}
{"text": "Best & cleanest nail shop in Northeast Phoenix!  David & his nail techs have the latest colors!  Try the mood gel polish!  Changes color in cold or with water!  They have liners in tubs and keep everything very clean!  You will love it here! Thanks David & awesome nail techs!", "id": 297}
{"text": "I'm a business owner myself. I made an appointment the day before to get a gel pedicure, and a back fill. The reviews I read were really great. I'd been seeing the same nail tech for 6yrs and never had I complained. However she moved to California. They put me with a guy that didn't speak any English. I get my pedicure & nails done every 10 days. this young man took 90mins doing nothing! He put callus remover on my feet and then place them in the water Hmmm... I wonder where he got his nail tech license? He didn't remove the skin or calluses on my feet after putting callus remover on them. The shape of my toenails are not the same or even. Oh! And he forgot to massage my feet!! Then the owner came over and told me that they're really busy and couldn't do my nails and could I come back tomorrow and he would do a very good job on my nails for me!! \nI sat in that chair for 90 minutes frustrated with this moron that shouldn't be doing pedicures or any other kind of service. It was inadequate & way below average customer service. I watched the owner book appointments for ladies that just walked in with no appointment and ask them to come back in 20mins. Well I dealt with being stressed out by someone that was not properly doing their service then being told that they didn't have time to do my nails because they were too busy! I was charged $48 for something that I most certainly was not happy with. I told the owner to stick it up his A..\n\nHow can anyone be so rude I don't know? I wish there was a law or a requirement that in order to get your license to be a nail technician or to perform any kind of public service that every individual of any race needed to speak and understand The English language fluently before they were able to obtain their license!  \nI owned 2 hair salons in scottsdale and I don't ever recommend anyone going to fancy nails.", "id": 298}
{"text": "I will NEVER go to this salon again to get any service.  I have been a customer of this nail salon for over a year.  Last week I called to schedule an appointment.  After waiting 20 minutes with feet soaking & water now cold-I asked how much longer it would be.  The lady beside me said she would be doing my pedi & it would only be a few more minutes.  I understand a delay, but what's the point of making an appt. if you wait that long?  Once she began my pedicure she seemed to be rushing.  I have 3 places on my feet where she rubbed with the pumice so hard that she burned skin off like an abrasion.  This was on Sat, today is Monday & it still hurts & has not healed.  I will find a new salon.  Wish I knew the ladies name & I would post this!!!  I told her it was hurting so she stopped rubbing so damn hard.  After she painted my toes, she put antiseptic on the worst burn-that only made it burn more!!!  Terrible service...unsatisfied", "id": 299}
{"text": "Fancy Nails is a great place to go when you are in a rush and need your nails done.  Firstly when you walk in they assist you right away, and soon enough your in your seat.  Let's say you got gels they would check every coat before putting it in the light. And they turn out perfect!  They also have a great coffee machine and water.  The people are super nice and great at what they do. It is also a very clean shop which has super comfy chairs washed supplies and the nicest polishes. So be sure to go to Fancy Nails, the nicest and neatest nail salon on earth!", "id": 300}
{"text": "Very disappointed with the pedicure I received. It was extremely rushed and lacked the sentiment of pampering yourself and relaxing. It was not meticulously done and there was nail polish left on my skin. I  can definitely do a better job myself. \n\nIn addition to that, the nail technician cut my big toenail at an angle to the inside on each side of the nail, and it looks absolutely ridiculous. It was only that one nail so my overall pedicure is inconsistent. I brought it to her attention even though there was nothing she could do to change it and she brushed it off and said that's how it's done.", "id": 301}
{"text": "Holly is amazing I've been seeing her for years. She always helps me with my ingrown toe nail and she does an amazing massage. She cares with much detail. Best massage chairs in town. Great owner. This is my monthly stop !! :)", "id": 302}
{"text": "I'm normally not a girly girl so nail salons don't really interests me but I was on vacation with my chica and decided what the hell, why not? So this review is from not your typical girl who gets their nails done routinely. I probably do it once every few years lol. Upon arrival, this nail salon looks very fancy and clean. Their tools I think are packaged and their prices are pretty standard. This place is also the 1st time in my life to get my nails done by a guy 0.0\nI think the techs there are nice and friendly and they explained to me any questions I had like what is difference between gel manicure and regular ones. I believe there is a pretty big selection of colors to choose. Since I'm not an expert, check out my pics and see for yourself! :)\n\nAlso, they provide free coffee and candy. The only reason I didn't give 5 stars was because my legs became a mosquito buffet but it's not their fault and it's pretty cool there with ceiling fans turned on.", "id": 303}
{"text": "Went on a whim while running errands and I was helped right away. The salon was very clean and the chairs comfy. The staff was friendly and though it was busy it was fairly quiet so I felt I could relax. basic mani/pedi for $34, not too bad! Will be visiting again!", "id": 304}
{"text": "This place is absolutely FANTASTIC!!  I did not have an appointment, but they got me in right away.  I had a full mani-pedi and an absolutely thrilled with the results.  I believe it was Jessica and David who helped me and they were both friendly as can be.  Hannah also was great.  I definitely recommend this place!!", "id": 305}
{"text": "Love this salon. Kim is very friendly and did a really nice job on my mani and pedi. The owner runs a very tight ship and not very many people are talking, it's very quiet, the staff are very attentive and it's very relaxing. The place is very very clean. I will make this my nail salon now, it's reasonable, friendly, clean and relaxing, what more could you want?", "id": 306}
{"text": "Lovely ambiance\nAttentive staff\nReasonable prices\nThey use disposable liners for their foot spas, which lessen the risk of catching bacterial infection.\nEveryone is great, my favorite is Lynn. She is super talented!", "id": 307}
{"text": "I've been going to Fancy Nails since I moved to PHX in July of last year based on the Yelp* reviews and have never been disappointed.  This is the first salon I have been to in a long time where I don't have a specific technician work on my nails.  Every person in the salon does a great job.  I am fortunate to be out of work before 3pm during the week so I can get to Fancy Nails by about 3:15...I've never had to wait for a service when I arrive around that time.  I have been on weekends and it does get busy, so I'd recommend you make an appointment.  The salon stocks OPI shellac/gel polish in addition to some other brands I don't recognize. A gel manicure costs $25. For all of my pedicure people, Fancy Nails uses disposable pedi tub inserts so no worries about someone else's foot funk touching your tootsies (big plus)!  They have a few options for pedicures, so ask to see the menu before you start.  They also offer waxing services and tanning as well but I can't comment on them since I've never used them.\nThe salon is clean, well stocked, and everyone is always professional and courteous.  There are plenty of other nail salons closer to where I live but I choose to come to Fancy Nails.  They're everything I was looking for in a nail salon!", "id": 308}
{"text": "This is my go-to spot for mani-pedi's and brow waxing. They do a bang-up job on my poor feet because it takes a lot to get those pups looking good. I have never made an appointment but never had to wait more that 3-5 minutes to be assigned a nail tech. \nThey recently got new massage chairs that don't grind your bones or shake you to death like some chairs do. Also, this is one of the best places I have been for a brow wax. My sensitive skin has taken a beating at many other places but never here. I don't know anyone by name but the employees are all very nice and skilled at what they do. Oh, and they are typically $5 cheaper than anywhere else I have been for pedicures!", "id": 309}
{"text": "Got a fill here about three weeks ago and my nails still look great!! Hannah did a great job and I will be back for sure!!!", "id": 310}
{"text": "This place is worth every penny, everyone is friendly and professional and they do great work every time, consistency is everything! I live an hour from this place and it always puts a smile on my face walking out.", "id": 311}
{"text": "My GF and I ate at Fin's on Saturday night Sept 21, 2013.  We had the chef's special tasting box which had 9 different items. The honey topped eggplant was quite good but everything else was mundane at best.  There were rubbery little pieces of octopus with much chopped vegetables in a sauce that overwhelmed everything. There was spicy salmon which was not spicy and was overwhelmed by a massive amount of mayo.  The tuna was tasteless. Etc. In addition, the decor is primitive and the place is incredibly loud for a supposedly upscale restaurant. It is simply not a good restaurant and I would not return.", "id": 312}
{"text": "warning. !!!!!!   This is not the same fin as before sold to new owner !   Super dry pull pork rice burger and stale sashimi salad and  gone bad chicken skewers were the 3 dishes ordered.    I gave 15% tip that the owner dared to ask for such food and service, smiled back at the owners and said \"see you next time\" NOT!", "id": 313}
{"text": "Way too expensive for what you get. I don't mind paying more for good food but this place was not worth it. Was recommended by a friend after telling her how much I loved Guu but I definitely can't listen to her anymore! \n\nIt's a nice looking place and the service was good as well, but the food comes first and it definitely was lacking. Sashimi was on par with AYCE places, not what you expect when you pay 40 bucks for 16 pieces. \n\nOverall, not pleased with my food experience.", "id": 314}
{"text": "Exceeded expectations. Ate early around 6.15 pm so was fairly quiet...2 others. Strangely asked if we had reservations...interesting! \nSauvignon Blanc from Chile was good and can be recommended. Cucumber Addiction tasty, avocado tempura very good, sashimi 3 kinds flawless, fresh raspberry point fresh oysters excellent value at $1.50 each. Shichimi duck salad also very good.  At $76 before HST & tip about right for the quality. Pleasant staff....will go again!", "id": 315}
{"text": "Finally a person who can cut my hair the way I like it.  Anthony cut my hair and Demi did my color ...  always comes out perfect!!  I would recommend Theory Hair Design to anyone looking for a great cut.  Thanks!!!", "id": 316}
{"text": "I've been seeing Anthony for 12 years or so and have followed him and Demi from Toni and Guy to here. I can't say enough about their skills - they're the only people I trust with my hair. I have dark brown hair that many people have failed to lighten to blonde without it turning a hideous shade of orange and/or getting severely damaged. Demi has not only saved my hair from damage, but always takes my hair to the perfect shade of blonde. Before seeing them, I was told by someone at Regis that it wasn't possible for me to be blonde. Here I am, 12 years later, blonder than ever  Thank you Demi and Anthony for saving my hair. They're an amazing team!", "id": 317}
{"text": "Amazing team!   Great hair by Demi and Anthony .  I would Highly recommend for great color and cut...", "id": 318}
{"text": "My fiance and I really liked this place. Huge step up from Stonepepper Grill. Our server was very attentive and the food was quick and on point. Tried the bruschetta, chicken parm and cajun salmon. Every dish was good and the chicken parm was better than many spots in the area. The one negative was the hostesses attitudes. They seemed stressed and frustrated that they were busy at 7pm in a Friday night which should make them happy, right?", "id": 319}
{"text": "Came here trying a new place. Literally! Just opened two days ago and well worth it! Warmly welcomed at the front by a nice hostess, and we're told we could even have a seat in the bar. Since we were interested in the Pirates game, it worked out, they have a few TV's in the bar for such purposes. \nWe ordered our drinks; Prosecco & Malbec. Both by the glass. Our server gave us big glasses of water with out drinks so A+ there. \nThe bread came out first and it was awesome. Perfectly warmed, large slices, crunchy crusted Italian bread that tasted like it was made in house. Served with ambient temperature butter (another pet peeve of mine is ice cold butter) so A+\nThe salad came out next and was the first area where we'd recommend a little change, maybe a little larger for sharing between two. But it was flavorful, cold, and dressed just right. The fresh cracked pepper added to it so overall: B\nNext our entrees: I had the Three-Cheese Lasagna my partner had the Gambellini Fra Diavolo (sorry if I misspelled it.) they came out at just the right temperature and at the same time. I tried a bite of his dish and the Diavolo was mild, but with a \"back-of-the-throat\" heat which is perfect. So: \"A\" for his dish. My lasagna was rather impressive, and I didn't realize the recipe was total cheese lasagna, but it was delicious. The only downside would be a personal preference of a little more herbs or spice in the cheese mixture. The tomato  sauce was slightly sweet and tasted of homemade. So well worth trying! \nOverall the reason behind the 4-star review is only for the slight downsides, but again, could just be my personal preference. \nI highly recommend coming here to try it out! Great ambience and extensive menu.", "id": 320}
{"text": "My husband and I went to Pazzo's for dinner during restaurant week.  We were both disappointed with our entrees.  We ordered off the restaurant week menu.  We both loved the lobster bisque.  My husband's crab ravioli was not warm.  My veal romano was hard and difficult to cut and eat.  My vegetable, carrots, were also not soft enough to chew. We enjoyed the ice cream for dessert.  The waitress was very friendly and attentive.  We may try Pazzo' s for lunch, but we wish we would have chosen a different restaurant for dinner.", "id": 321}
{"text": "We loved our experience here tonight.  Kim was our waitress and she was great.  Our children have an allergenic disease and are very limited in what they can eat.  I also have Celiac's disease, so no gluten for me.  Our meals came out just right, they made special accommodations for the kids and even had gluten free breadsticks they could eat.  You have now become one of our new favorite restaurants.", "id": 322}
{"text": "Overpriced and flavroless.  This place tries really hard to seem fancy, but falls far short.\n\nThe bread was fantastic, but it was paired with ice cold, solid butter.  The salad, as others mentiones, had very little nearly-flavorless dressing.  \n\nI had the chicken marsala ($18).  The three chicken tenders that comprised it were tender.  The sauce, however, was a mess.  It was as if they splashed some marsala wine on the plate, and then dumped the chicken onto the plate, oil and all, straight from the sautee pan.  It was sweet, watery, spotted with oil, and devoid of any kind of seasoning.  Oh, it had a few sliced mushrooms, too.  I chose pasta with white sauce for the side.  Bad move.  It was pasta tossed in plain white sauce - no cheese, no garlic, not even a bit of salt.\n\nMy wife had the shrimp scampi ($22).  It came with 4 or 5 shrimp that were actually quite big.  They weren't overcooked.  The sauce, again, was a watery mess, a bunch of butter quickly thrown together with some white wine.  The whole thing was topped with *garlic powder*.  I don't think any of it was seasoned with salt or anything else.  She chose broccoli for her side.  Aside from the bread, the broccoli was the best part of the meal.\n\nCome here if you're looking to spend $20 a plate for food that's below even Olive Garden's standards.  The service here was slow and unenthusiastic, and I'm willing to bet that none of the cooks have ever actually tasted the food they're sending out.\n\nI only gave it two stars because the food did not make me sick.", "id": 323}
{"text": "Save your $22+/ plate & take yourself over to Giant Eagle's Café. \n\nIt took over 30 minutes for the food to arrive at our table. The portions were generous, however nothing was seasoned properly. Shrimp Scampi was covered in garlic powder sitting in a bowl filled with microwaved butter. The broccoli was the best part of my meal. They were cooked to perfection. The salad that's given lacked any dressing. The dressing was bland. The beer is over priced. $9 for any craft beer. I could see if they had a 10% DuClaw on draft for Pazzo's to have a reason to charge that much.\n\nThe service is depressing. Servers don't smile here or seem enthusiastic. Perhaps it's because they feel guilty for being the poor souls to serve below average food for such a sky-high price. \n\nThe decor is nice. That's it. Now save yourself money and go to Chick-fil-A next door.", "id": 324}
{"text": "I don't understand the 2 star reviews. Lunch today was very good, especially the thin crust pizza and the wedding soup was superb.", "id": 325}
{"text": "The food is very good. \nBut...... Bartender charged for a double. Should have been 6.50 but they charged 13.00. When we mentioned we didn't order a double, she said it was a computer glitch, but made no effort to reduce it. Asked for a manager, he offered to take off 4.00. Buyer beware!! They are sneaky and when they get caught, they are unapologetic.", "id": 326}
{"text": "You're not going to find Nihari and Biryani at this spot. It's American food made with a \"desi\" twist. \n\nStepping into this place, it's an enigma wrapped in an enigma. Sholay isn't heavily advertised in your face so you don't know what to expect. \n\nThe restaurant name brings memories of the legendary movie and elite characters. Come on. Don't tell me you can't hear Amjad Khan's voice :) \n\nEnough of me being Basanti . The place has: a large poster of Shah Rukh Khan, a pic of the Dalai Lama , and generic scenery pics. As you walk in you are promptly greeted by two American white people. The instinct as a desi is to run away but please resist this urge. \n\nYou find out the staff, are owners and chefs who love desi food. The \"white dude\" who is their head chef, couldn't be more \"desi\" when it comes to spices and food. \n\nLoved the chicken wings and chicken kabob here. \n\nOnly con: they are only open till 7pm.", "id": 327}
{"text": "Not sure why my lamb kabob meal took so long to be ready, but I overheard something about the rice still cooking, and this was at peak lunch hour (noon)! My only complaint (almost 20 minutes for one to-go order with only 2 or 3 other customers at the time) was the waiting, but the employees were nice and made sure to let me know that I wasn't forgotten.  The shish kabobs were tender and savory, and their balsamic vinaigrette for my salad was the best I've ever had!!!  The saffron rice was also delicious even though it appeared to be the item that was delaying my order.   I should've called ahead, but next time, I want to try their lamb burgers...  Limited menu but top quality ingredients, yummm!\n\n3/12/14\nI returned there after work to pick up my lamb burger and side salad to go.  The ground lamb meat was indeed tasty, but I was disappointed by the smallish size compared to the bun.  I'll stick with the kabobs and rice in the future.  I was told by the nice man behind the counter that they'll be expanding the Indian portion of the menu in a few months so here's hoping they add samosas!", "id": 328}
{"text": "The friendliest worker ever works here. I think he is the owner, or just a very friendly man. Every time my boyfriend and I come here we get free stuff. Last time it was dessert, the other time it was mango lassi. The food is good and decent pricing. Sure, it's not the most glamorous presentations, but it is good for someone who is very hungry.\n\nThis place just opened up like a 3 months ago, so they are pretty eager to get customers in.", "id": 329}
{"text": "Mouth is watering at the thought, this was the best meal I have had in a very long time, staff were pleasant enough. Muscles were huge, so tasty and very well cooked, the basket of bread was replaced a few times. Will be back soon :)", "id": 330}
{"text": "I ordered mussels with ginger/lime sauce and they were the best I have ever eaten. For £12.50, the portion was huge (may be 30 or more) and the sauce was more like soup at the bottom. It was spicy and delicious.", "id": 331}
{"text": "it's been a while since I've posted anything to yelp - but I noticed a distinct lack of available info during my travels to Scotland and Ireland, so here goes\n\nThis place is located at the (end of the) Grassmarket in Edinburgh - from what the guide books tell me, it would have had a great view of all the hangings (puir man got hangit) that took place there.\nThe inside is modest but nice and aside from the somewhat crabbit (maybe German?) bartender, the service was just fine.  We split a bucket of mussels (shallot cream white wine sauce) and I had an 8oz ribeye - the husband had something weird like pasta.  The mussels were the best I've had in my life, truly amazing, and the steak, skinny little thing that it was, was delicious also.  The quality of the local beef and seafood spoke volumes - no extravagant preparations or sauces required.\n\nHighly recommend.", "id": 332}
{"text": "I went to The Mussel and Steak Bar after a date at the nearby BrewDog. The date was going well (oh la la) so he suggested stopping by this place for dinner. It was a Friday around 730 and we didn't have reservations, but we were able to be seated for a table for two. The manager was cheeky and ribbed my date a little bit for pretending to look in the reservation book to pretend to be someone else, which was very amusing. We were able to sit upstairs and I thought the place had lovely ambience. \n\nWe started with some fried goat cheese balls and garlic grilled mussels. Honestly, I'm not a huge fan of mussels but I thought \"When in Rome!\" and tried them. They were really tasty, but I'm not sure garlic was the best date choice! Anyway, for my main I had a special fried plaice with black pudding mash that was extremely tasty. My date had a steak that he enjoyed. Topped off with a nice glass of house white and I was a happy camper. I will definitely come back to The Mussel and Steak for another nice dinner in the future when I'm in the area, which of course I will be because I do love BrewDog...", "id": 333}
{"text": "I'd recommend any seafood lover to go to the Mussels and Steaks Bar.  Excellent food, great service and located in a bustling part of town. The decor is basic but the great tasting fresh food and friendly service more then made up for it.  \n\nAll the food was fresh, vibrant and flavorful.  Our group tried the seafood platter, the special lobster dish, curry mussels and the surf and turf combinations.  No one had a complaint about any of the dishes.  The best part was the double fried chips in drippings.", "id": 334}
{"text": "Heerlijk gegeten. In eerste instantie lijkt het wat klein maar boven zijn ook nog plaatsen. Het vlees is heerlijk en de mosselen ook. De wijnkaart is mooi en compleet en zelfs de whisky liefhebber kan hier uit de voeten. Een aanrader.", "id": 335}
{"text": "This is a gem in an otherwise touristy Grassmarket. This place has fantastic food, Oysters, Fish, Steak, and plenty of other options. But the specialty has to be the mussels. Choose a mussel pot and have it in any of five ways to suit your palate and mood, just take your pick. Depending on how hungry you are choose a full three course, or share a divine starter and dessert. All this with great service, good price and fresh atmosphere.", "id": 336}
{"text": "I come here. A lot. Either with my mum or with friends (usually to celebrate a birthday) this has become a personal favourite eating place. \n\nFirstly, it does good food- whether you are into seafood or meat. You get to watch your food being cooked on a screen (which is slightly odd) and I love the layout of the ground floor- quite modern without over doing it. Look out for the fun facts about mussels in the toilets.\n\nThe service has always been super friendly at this place. Being in such a prime location I was expecting shocking prices but I was pleasantly surprised. They have amazing lunch deals and I have never walked out of this place hungry.\n\nSadly they only have one vegetarian option as far as mains courses go. Also, in the winter the upstairs floor tends to get really warm. \n\nAside of these hitches Mussels and Steak Bar is a good standard for me.", "id": 337}
{"text": "Was expecting a lot from this place based on the reviews, but honestly we didnt love it. It was just OK. Service was quick and friendly. They were also happy to oblige my dairy intolerance, which was nice. Both the seafood and steak were good quality, but I guess they were just a bit boring. \n\nBoyfriend wasnt so keen on the strange warm, limp cabbage on the side of the steak. Although the steak was cooked as ordered (medium-rare) which was good. The queen scallop starter was OK, but the scallops were quite small and over-salted. Mussels were pretty good. \n\nOverall a decent meal, but not good enough to get us over to Grassmarket on a regular basis.", "id": 338}
{"text": "Everybody in my family likes something different. My Dad likes Italian, my Mum French, myself Indian and my sister Chinese. The problems it causes when we each want our restaurant to provide something different. As a comprimise, we often decide that a restaurant serving British food is the best option - but then its time for the real battle to begin. Light and fresh sea food or good and hearty steaks?\n\nIt seems then that I should introduce them to Mussels and Steak Bar - which, as you would expect, serves Mussels and Steak.\n\nIts no secret in the restaurant that the produce is local (or at least Scottish) and the ingenious menu combines seafood and heavy meats in brilliantly tasty ways. The sauces used are outstanding, if a bit 'out there' and incredably mouthwatering (In fact my mouth is watering as I type).\n\nThe restaurant itself is simple and practicle - and despite the annoying big screen TV's - has a seaside town feel to it,matching the down to earth cooking style. The staff are friendly and helpful, while the bar offers a large range of drinks.\n\nSo there you have it, a restaurant which can cater for all appitites and in a mouthwateringly excellent way.", "id": 339}
{"text": "We were in for the Edinburgh Festival and saw our favorite tapas place replaced by Mussels and Steak. \n\nThe atmosphere looked a little cold and modern but the menu was interesting. \n\nIn a word, the mussels were terrific! We tried the bacon and cream. Plump mussels, huge pot, delicious.\n\nOur scallop starter was equally good. The steak was fine but next time we are just doing mussels. This is really their thing.\n\nNot five stars as they just opened (second location) and fumbled a bit with forgetfulness and delays.\n\nThe staff and owner were very friendly and apologetic. Highly recommended\n .", "id": 340}
{"text": "I don't like mussels.  They are too strong and too fishy! Don't care for the smell and don't care for them in soups or stews.  Until now I would have told you that I'd rather eat rattlesnake.  Appearantly in Scottland, there is an entirely different species of mussels.\n\nWe stopped in at the Mussel and Steak Bar for dinner before walking up to the castle for the 10:30 Tattoo.  Our travel mate ordered the mussel starter.  It arrived with green sauce on it.  OMG, it smelled amazing.  So much so that I had to taste it.  The little mussels were tender and steamed to perfection with a light pesto sauce driselled over them.  It is such a great combination!\n\nI had the surf and turf for dinner.  The mussels were done in white wine and garlic and the ribeye steak was tender, juicey and cooked exactly as I ordered it. All four of us agreed that our meals were delightful.  The price was not out of line.  Service was spot on.", "id": 341}
{"text": "On our last day in Edinburgh, I still hadn't tried Haggis.  And I really wanted to try it.  The waitresses we excited to watch me try it for the first time, they were chatty but not overly.  They were attentive, but not overly.  I had a good time, but next time I'd like to take my time and order more and stay longer.", "id": 342}
{"text": "One of the best spots for seafood in Edinburgh, and one of my favorite restaurants in the world. \n\nLocated just across the street from a longer strip of restaurants and pubs in the Grassmarket, it would be possible to pass the Mussels Steak Bar without giving it a second thought. That would be a huge mistake.\n\nI've made about 12 trips here for lunch and dinner, and every time I've always been greeted by an unbelievably friendly waiter or waitress. They start you off with some of the best crusty bread and softest whipped butter you'll ever taste, and they are happy to replenish it many times over.\n\nMy favorite way to start a meal is with a kilo pot of their mussels, which are all ridiculously fresh and delicious, particularly with the white wine, shallots, garlic and cream sauce. Both the steaks and the seafood pasta (with loads of mussels, scallops, prawns, and calamari) are excellent main courses, and their fries with 'beef dripping' are some of the best I've ever tasted. Their wine list is not huge but offers good selection at reasonable prices. \n\nThe meal can definitely run on the pricey end depending on the conversion rate (if you're an American) but I have never walked out of this place unsatisfied. Highly, highly recommended!", "id": 343}
{"text": "Great steak, great mussels, and great cocktails. Fun vibe in a great neighborhood. Get the chips fried in beef drippings.", "id": 344}
{"text": "Came for a late lunch and enjoyed great food, friendly service, and an overall excellent value. I recommend it.", "id": 345}
{"text": "The other reviews are  surprising. The first surprise is that a reviewer is surprised to find that Scotland, the north part of Great Britain (a well known island), has decent seafood. The second, and more disturbing, is the complaint that a restaurant with the name \"Mussel and Steak Bar\" has a fairly short menu. One might have thought, nay expected, that the menu would be mainly ...\n\nOn a positive note, what I can say is that they provide first class food. What they say they do they do well. The steaks, in my experience, are meltingly tender. The chips (US: french fries) cooked in beef dripping are crisp and moreish.\n\nThe restaurant is good value because not a  morsel will be left on the plates.", "id": 346}
{"text": "Stopped for lunch and we weren't disappointed.   It was fantastic.  My wife had the mussel special and I had the hot seafood platter.  I watched them deliver a few of the Tomahawk specials and they looked incredible.  My only disappointment was that the hot seafood platter was mostly mussels and not very varied but still well done.   The outside look of this place does not represent the quality inside.  Service was great.", "id": 347}
{"text": "My child has attended this school for the last 9 months. Learning ABCs and math and chinese, playing outdoors and indoors.  The School has lots of different age students from when the child is potty trained to kids taking their SATs to adults learning Mandarin.  They even have water activities on weds and Fridays (weather permitting).  \n\nI am happy to drop off my kid to school. My kid has learn how to speak basic Mandarin.  There are lots of non asian children in school. Most teachers are bilangual. Lots of mixed asian children too.  The school is very focus on safety.  You need to be buzzed in to get into the building. Each parents sign in and sign out during pick up and drop off.\n\nWe (including my mom who is a former teacher) checked out three different pre kindergarten for my child and felt this was the best one.  We are happy we choice this school.", "id": 348}
{"text": "Dedicated staff and a variety of teaching methods have helped with my daughter learn a lot in a short time.  I wish we had gotten her in here sooner. The staff has always listened to our feedback. I feel the school provides exactly what they promise, and would keep her here full time if they went past Kindergarten.", "id": 349}
{"text": "FRANK.......MY Hats off too Jeremy at Elite AV. Following a no show twice in 48 hrs. by one of his competiors. I had no choice but to grab the ball and run. I went on line and after about 15 min of reasearch I chose Elite AV. Within 45 min.  I had an Appointment set up for same day  installation. Wow was I lucky. Jeremy showed up right on time and 4 hrs later my install was completed. During the process there were recomendations made to meet my needs, I went with all sugestions. I must add not one recomendation was made that did not make financial sense to achieve my needs.He never tride to upsell me or his services. Thanks for the honesty. Jeremy and team will now service all of my  family and friends home theather/ security needs. Thanks young man...I wish you much sucess continue to do what your doing in the manner you are doing it dont loose focus, you cant miss. Frank....", "id": 350}
{"text": "I sent an email to Elite A/V LLC to see if they could give me an estimate to hook up a new blue ray, to an older home theater system and new tv.  They replied back to me within minutes saying it would probably be around $99.00 which I found acceptable and scheduled an appointment for the next day.  They arrived on time and explained that because the home theater system was so old they could not connect the new blue ray to it but could only connect it to the TV.   Since that was not a good option for me I declined and they were kind enough to not charge me for the service call.   I then thought about purchasing another home theater system but they suggested that I use the existing built in ceiling speakers.  I had originally not wanted to spend what I thought would be a lot of money to hook those up but after further discussions with Dylan I agreed this was the best route.   He was able to provide a receiver and sub-woofer for me or I could have went out and purchased my own.  I verified based on his quote and the cost was no more than what I would have paid at Best Buy.   We rescheduled for the next day for the install and again they were right on time.  Kevin and his partner came out and completed the installation in about 2  1/2 hours talking us through the whole process.  They had to cut a small hole in the back of the entertainment center so they could attach the wires which I was at first not crazy about but it was very small and behind a closed door so it was a non-issue.  The cost came to more than what I had intended to spend at the time but I am so glad that I went with their suggestion.  The sound is fantastic, I don't think we will ever go out to see movies again.  I would highly recommend Elite A/V LLC as I felt they were very honest in explaining our options and we did not feel pressured at all on the direction to go.", "id": 351}
{"text": "Chris and Jeremy are great. They installed a 4 camera system (with ability to run 8 total) in my home after my wife wouldn't stop nagging. The system is real nice. They installed two flush mount screens (about size of smaller computer monitor) in both my bedroom and family room area. The screens turn on and off with a switch, and run a constant 4 screen split view of all my cameras. The whole camera thing is silly to me if you aren't able to view them in a moments time when someone rings the bell, or if you hear something strange. Sure, everyone's able to look on their phones - but the monitors they put in are amazing. Full HD quality, and great picture. \n\nI had some minor issues with my first NVR. It would reset in the middle of the night, and when I woke up my screens in both living areas were reset. I called Chris and he was back the next day. It turned out there was a small update on the NVR that wasn't done prior to sending a small shipment of NVR's out.  A new one was sent via the manufacturer, and we had a new unit installed 3 days later. \n\nBoth very nice guys. Professional. Nice equipment. They take their shoes off. They pet the dog. All in all, good experience and have recommended them to a neighbor (after recent break-ins in the subdivision -- 3 in total).", "id": 352}
{"text": "Jeremy came to our house on time, took off his shoes (without being asked!), was incredibly patient and helpful (marked the buttons we need to push) as he reworked some things we tried to install. He also did quite a bit of troubleshooting and will be back to help us again (per our request) as we need him for more than just the first request (we had purchased a new receiver and couldn't seem to hook it up to the existing whole house speaker system). We now have music that plays through the house and it is wonderful (and precisely what we needed). Reasonable rates and someone we can trust to come back and help us with the next project.", "id": 353}
{"text": "Had multiple items installed in my office and I couldn't be happier with the service and the wonderful team. Will be doing more business with Jeremy and Elite A/V! If you have a chance to get services from them TAKE IT!!! You will be glad you did!!!", "id": 354}
{"text": "I am highly satisfied with the work Jeremy and his associate did at my house. I mounted a tv and needed someone to run the cables through the wall. It was a relatively small job and I was wondering if I could even find someone to do it. Just like the other reviewers mention, Jeremy quickly and politely answered my email. Within a week he had come to my house once, on time, knowledgeable and prepared to complete the job. He tested everything out and cleaned up and the installation looks great! I will use Elite again and will recommend them as well.", "id": 355}
{"text": "They came to install a TV and a huge white board in our office. Jeremy was very friendly and was a pleasure to be around. We had great conversation as he was hanging the items in our office. They were in and out and didn't take long at all. They kept everything clean and provided coverage for the ground to ensure easy clean up! The office looks awesome! Called to make payment and they were super friendly. \n\nThanks Elite A/V LLC!", "id": 356}
{"text": "These guys are great!  They mounted a 55 inch in a tough spot no problem. Highly recommended.", "id": 357}
{"text": "I have to give it to these guys...they are awesome!  Being I was working on a tight budget and having older audio equipment, Elite came to the rescue.  I want to give a shout out to Dylan and Erik (along with his son), for the awesome job you all did for us.  They were all very professional and the end result is great!  Erik (and son) were thorough, explained things along the way and kept everything clean as they went.  I would definitely recommend Elite A/V to anyone interested in having their audio/video professionally hooked up.  Thanks again you guys, and keep up the good work.", "id": 358}
{"text": "Jeremy and Maurice came to our home on 6/24/14 to clean up a mess of wires for our home theater and internet system that have been that way for several years. We have paid other techs to do the same job but the wires were still left in a mess. This time we finally found someone who knows how to do the job right. Jeremy and Maurice are coming back in a few months to change out the ceiling speakers with new larger and directional speakers and have given us other options for updating our 7 year old system. If you have any TV or Sound system issues call Elite no job is too big or too small. Great company.", "id": 359}
{"text": "Great! I had been looking for a while for someone to mount my new television for me and everyone I found was either too pricey or just didn't seem professional enough. I spoke with Jeremy at Elite AV and he was kind enough to tell me over the phone which type of mounts I would need as well as what he sold in comparison to the retail stores. I trusted him merely from this phone call and when he came a few days later for an installation I knew I made the right choice! Very professional and very knowledgeable!!\n\nThanks Jeremy!", "id": 360}
{"text": "I got a great deal on a high end 12 camera security system but needed someone to the install and found Elite A/V LLC on Angies.  I messaged them and Jeremy replied within 24 hours and we made an appointment for a walk around. Our place is single story with a large foot print at 3600 sq ft and I wanted full perimeter and entry coverage. We have vaulted ceilings in over half of the house, with very little attic space on that half so running cables is no walk in the park.\n\nJeremy and his crew were always very polite and professional and I am very happy with the work they did,  They did all the camera cabling, setup the dvr and did some upgrades to our 2gig alarm system. I feel I got a very fair price on the work that was done.\n\nI plan on adding 4 more cameras down the line and will definitely use them again.", "id": 361}
{"text": "Decided to get a new 55\" TV installed in our bedroom and did a service request online on Sunday and woke up to the owners response on Monday morning that they would try to get to us the same day!\nThe techs called at 8 am to let me know they would be there at 10 and they were actually there on time ready to rock with tools in hand. This really impressed me as most companies want to see the job and try the up sell dance 1st before unloading a thing from their truck! These guys knew they were there to work and were prepared to do just that!\nThey were very neat and meticulous and got the TV up and running in no time. They explained everything and took the time to answer all of my questions.\nI would highly recommend Elite A/V to handle any of your audio video and home automation needs!!\nThanks Jeremy and crew!!", "id": 362}
{"text": "Very very pleased, Jeremy is very knowledgeable and they know their product well.  Also, his crew was really nice every time when they came out to install their equipment.  This company is completely professional, responsive, and attentive.  I was so pleased that when they finished their job everyone cleaned up, and did not leave a mess.", "id": 363}
{"text": "I had to take a moment and brag on Jeremy!  He is the MAN!  His prices were very reasonable.  He and his staff were quite professional and we punctual, I would definitely recommend him if you want a professionally installed system!", "id": 364}
{"text": "Jeremy, Chris and Dylan did a great job. They are very professional and knowledgeable.  Highly recommend them.", "id": 365}
{"text": "Great job by the Elite AV team on setting up my 65\" 4K TV and receiver.  In addition they also set up my XBox, Apple TV and DVD player and checked the surround sound speakers, wub woofer and center speakers to make sure everything was working right.  I couldn't be happier with the care they showed to our home in set up and clean up.  I was very impressed and wouldn't hesitate to recommend them to others.", "id": 366}
{"text": "Jeremy is the best!  He is super professional.  His work is outstanding.  He is current on all the new and latest technology out there.  He always has a solution on how to update and improve any audio/visual stuff I have going on in my house   His work is meticulous.  He is neat with his wiring and labeling, making it easy and clear for anyone to understand how to operate anything he has put together.  \n\nHe is reliable.  He is prompt with return phone calls, emails and appointments.  \nI would confidently recommend Elite A/V!!!", "id": 367}
{"text": "I hired Jeremy and his team to mount 26 TVs for a few commercial projects in Vegas and they did a wonderful job! They were professional, on time, and very reasonably priced. I would definitely use them again!", "id": 368}
{"text": "I am blown away by how awesome these guys were!! They just left, and I couldn't wait to jump on and give them a rave review!! My new tv is installed perfectly, and I'm actually in a great mood despite waking up at 8:30 a.m. to let strangers into my home, thanks to their great attitudes, their polite efficiency, and their kindness. They were so pleasant and funny and helpful, and they left everything clean and saved me a whole mountain of trouble. I could not be happier!!!", "id": 369}
{"text": "The ultimate professionals. Prompt and efficient. Highly knowledgable and courteous. Job well done!", "id": 370}
{"text": "Jeremy is a great worker, very knowledgable and honest. Such quality work for the price too! I highly recommend Elite AV.", "id": 371}
{"text": "Super professional! I bought a flatscreen tv from them and they were comparable to big-box retailers. Best part is they mounted it on the wall for half the cost of big-box retailer. We will use them for subsequent television needs!", "id": 372}
{"text": "I have been going to DT for over 5 years.\n\nFor a dealership, I find they are pretty fair in the pricing and they do some extras, like wash your car for you.\n\nYou can also have your scheduled maintenance (like oil changes/tire rotation) done on a Saturday - they are open until 4 pm.\nFor those of us needing our cars during the week -- it works great.\n\nIf you drop it off around noon - you can check out Dark Horse Coffee across the street, or Burger Shoppe, or Prohibition, also if you want Brunch there is Bonjour Brioche just up the street (great quiches and baguette!)\n\nAlso, Toyota has a loyalty program now (no cost to enroll), and all your maintenance spend gets recorded, and you can use points towards service or other items.  The time before this time my Oil change was free.", "id": 373}
{"text": "I've used this dealer intermittently since 1999. They do repairs well the first time but have had mistakes the last few visits. A couple years ago they left the window down and soaked the back seats when washing it. There was no apology or warning when I picked it up. I had to buy garbage bags to carry passengers the next couple days so they could sit on them. This past visit for regular maintenance I Was called because there were a few light bulbs out. I said I would do it myself and I found them changed anyway and the $38 added in at the end of my bill after pick up. I was going to do it myself because I already had spare ones in the storage and it takes 3 minutes or less. I'm becoming very skeptical about any dealership in this city!!!!", "id": 374}
{"text": "This sad excuse of a car dealership should either be shut down by Toyota or their manager should be fired. Has no one ever explained to these people that calls should be returned? I as well, have also caught them doing unnecessary work on my Camry. My new mechanic tells me it served me right going there!", "id": 375}
{"text": "I'd give these guys negative stars if I could. I took my car in to get two engine sensors replaced, and after diagnosis, they handed me an estimate of approx $4000. That's the price of a new engine! I proceeded to tell them no, took my car to a mechanic that I know and trust (Heffner's Toyota in Kitchener) , and found out that this is a tactic that dealers use to get you to buy a new car. I wouldn't trust these guys to fix a lawnmower engine in the future. Be forewarned, this dealership is not to be trusted.", "id": 376}
{"text": "Adequate service if your car is under warrantee. My engine light has been on for a year. 3 visits (charged each time) they are still incapable of fixing it. Different excuse every time.  Pretty expensive even for an oil change. Long wait times even for the most straightforward repairs.  Not great at returning calls. There are better places unless you really want to get repairs at dealership. Not great service off warrantee.  I think I'll find somewhere else for service. Suggest you do too.", "id": 377}
{"text": "Nothing special about this place, their ice cream is ok. On busy nights drive thru is insane and impossible to turn left out of here. Prices are high too. The employees are really nice and it is a clean store.", "id": 378}
{"text": "I love this location! The staff is very friendly and helpful. Also, you just can't beat the $5 meal special.", "id": 379}
{"text": "Upon my usual weekly jaunt down to the St. Lawrence market I found myself staring into a neatly tucked away Shoppers Drug Mart at the corner of Esplenade and Jarvis. A life sized Justin Bieber cut out (my 11 year old selfs secret fantasy), was strategically display in the front window of the Beauty Boutique along with his latest fragrance line to draw in any stray window shoppers ( of course I'm convincing myself it was really my subconscious wanting to escape the mere minus 30 weather outside) \n\nWalking in I certainly didn't expect to walk out with over $200 worth of cosmetics. Upon first entering I was greeted by a lovely tall, bubbly, blonde that not only looked but sounded like a Disney princess. She was quick to ask if I needed any help or if there was anything in particular I was looking for. When I assured her I was just \"browsing\" as us window shoppers do, she offered to give me a complimentary makeover. I have never been one to decline a little free pampering here and there so I quickly obliged making my self comfortable on a fancy black chair next to her. \n\nAnd so It began; a little Clarins Ever Matte foundation, followed by both Benefit blush in Coralista and Benefit They're Real mascara ( which might I add is probably the best mascara in the existence of mascaras), next was the Lise Watier lipstick in Evasion and to finish it off a spritz of Marc Jacobs new scent \"Dot\" ...vuala  she held up a mirror to show me her finished canvas and ten minutes later I was standing at the check out. \n\nThe customer service was great, the product knowledge of the associate was excellent, the sales pitch was well played, the free samples were an added bonus...oh and my fancy new picture beside the Justin Bieber cutout left my 11 year old self jumping up and down on the inside. If you are looking to buy cosmetic this is the place to visit.", "id": 380}
{"text": "Kudos to Vogel & Matesi and specifically to assistant Sally and Dr. Savla.\nI was traveling to Phoenix and was in tremendous pain.\nNot only were they able to fit me in their busy schedule, they did the first stage of root canal very quickly and professionally, the pain was gone right after!\nThank you guys!", "id": 381}
{"text": "I cannot say enough wonderful things about this experience.  We bid on this for a charity and had no expectations.  We've lived in Arizona for a long time and had no idea how gorgeous our state could be.  I'm not a fan of small planes but this was so easy and gorgeous.  Great people, gorgeous surroundings, and amazing food.  This is a can't miss Arizona experience!!", "id": 382}
{"text": "Wished it was better..\nAfter watching man vs. food I decided to stop by, décor was not that homey and welcoming, and the neighborhood was bad, but nothing I haven't been around before.  The ribs were very fatty and grisly, it was disappointing and I didn't get enough sauce and when I asked for a little more they wanted to charge me, the coleslaw was awesome!  I noticed a hair in my food and it turned me off to the rest of it, so i threw it away , I wont be returning...\nsorry guys", "id": 383}
{"text": "Decor and service leave much to be desired, but the food is worthy of 4.5 stars.\nI've eaten at both locations several times now over the past year, since moving from San Diego, and I think the food is very good.  The fried chicken and Polish Boy in particular are awesome.  The ribs are just average. good sauce, but not super tender and have not been smoked enough for my taste.", "id": 384}
{"text": "Don't believe the hype. Nooooo! \n\nIn the Cleveland area, there's an endless supply of small, unique eateries that take the time to create and serve unique, tasteful, hand-crafted items with flavor. Hot Sauce Williams has created a great commodity in his BBQ sauce, however, ruins the spirit of Cleveland goodies by serving it over generic, tasteless, frozen bag items. \n\nGranted, my review is based off a Polish Boy sandwich combo. I haven't tried anything else and after trying the combo, I most likely won't make my way back to try anything else. \n\nG Love sang about it, so it can't be that bad, can it? Can the creator of such gems as 'Cold Beverages' and 'Milk and Cereal' really steer me in the wrong direction? He did, however, I'll forgive him with a listening of 'Baby's Got Sauce' (pun intended?). \n\nThe fries are actually store-bought Ore-Ida brand fries. I can remember being served those with dinner when I was a lad in the late 1980s. They are perfectly tasteless. The sauce drenches over them, adding taste, but it just seems incredibly lazy to take something I can easily buy in the store, increase the price, and serve it to customers.  \n\nThe buns are of exactly the same nature - walk in to any grocery store and purchase the cheapest hot dog buns they have - you'd be getting exactly what is served. \n\nThe sausage wasn't bad, had some taste and was of average size (I'd throw in a 'that's what she said,' but that phrase is so overused, I'll let it be). \n\nIt isn't terrible, but to be honest, without the sauce, there's no way Hot Sauce Williams would still be in business after all these years. The cute nickname helps, I'm guessing. I'm guessing a lot of people wouldn't keep returning to a \"Mr. Williams Barbecue Restaurant\" - so I guess the gimmick is working. Plus, it'd be totally cool of Williams decided to sponsor a MMA fighter, just so there'd be a fighter with the 'Hot Sauce' nickname. \n\nThe service is, well, non-existent. I asked for 'slaw on the side, and when I received my meal, my 'slaw was in the middle, which made the bun and accompanying fries soggy on the center and sides - they fell apart upon contact. The 'slaw is mostly liquid. I was reduced to eating a weird liquid mixture of Ore-Ida fries, juicy 'slaw, BBQ sauce and bread. \n\nSort of weird, they also give out cans of soda instead of fountain drinks. \n\nI'd buy a bottle of the sauce and use that at home, but I really wouldn't suggest eating here unless you're interested in a bland, sloppy mess of stuff you can grab at the nearest Piggly Wiggly (which, for Northerners, is probably pretty far away, so I'd have no clue why you'd travel that far to grab those simple ingredients).", "id": 385}
{"text": "Don't believe the hype!\n\nAfter seeing this location on Man vs Food I had to check it out for myself. I have given this location two back to back chances and it was a disappointment on both occasions. \n\nThe place is defiantly a dive and not the cleanest. One our first visit on a Saturday night we ordered two 4 piece chicken dinners for my wife and I and one 2 piece chicken dinner for our daughter. We finally received our food after a 45 minute wait and the place was completely dead! The four piece chicken dinner comes with a breast, wing, thigh and drumstick, coleslaw, fries and BBQ sauce on the chicken & fries. Talk about a party in my mouth! The chicken was hot and juicy and cooked just right and seasoned to perfection! The fries and slaw were good also.\n\nThe employee's attitudes and customer service skills are in need of as much of a makeover as the dining space needs. The second time we went was the next day as we were on our way back home from Cleveland and got a 20 piece chicken to go. The girl at the cash register was on her phone the whole time I placed the order. I understand that it's a slow Sunday afternoon but, really?! She had a really foul attitude and just couldn't be bothered with taking orders. She was acting like actually pausing her phone conversation to take my order was a major inconvenience to her. \n\nIt took about 25 minutes to get our chicken the second time which is weird as I ordered a lot more chicken the second time. I would defiantly call ahead to place your order because if you wait on your food it WILL be a while.\n\nThe chicken is very good but, not worth the wait and dealing with the employee's bad attitudes. I'd much rather go to Zanzibar for their delicious honey fried chicken. Hell, I'll eeven take Church's Chicken instead!", "id": 386}
{"text": "Sauce spicy and blan absolutely no flavor the decor screams dont eat here plus the entire staff is moody not to mention chicken wings are 1.50 a piece a true rip off!", "id": 387}
{"text": "Seti's truck wasn't around so we decided to head to a restaurant with polish boys that didn't have wheels. I'm really glad we did that - the combo of the polish...girl...was delicious!  It had the added pulled pork on it, the combo of flavors, perfect.  \n\nWhat the fam really loved was that sauce.  I'll probably never be in Cleveland again, but I'll dream of that sauce.  We got the fried chicken, stuck the sauce on the side...but I can see why people just have it drenching that chicken.  Glad we did get it on the side, though, since it was glorious to dip everything into it.  Almost ordered another fries just as a vehicle for the hot sauce.", "id": 388}
{"text": "The location on 79th Carnegie, is a hot ghetto mess. I am ashamed of what the establishment has turned into. Maybe I'll try out superior or Lee rd.", "id": 389}
{"text": "Let me just start by saying that this place did not live up to the Man V. Food hype. I think I have been to better buffets before.\n\nTerrible customer service earned them one out five stars. Extremely rude and inconsiderate server. Took us ten minutes to place our order when at the front of the line. She decided to have side conversations while we were still ordering.\n\nFood: I ordered the Polish Boy and Dark Meat Chicken. \n\nPolish Boy: Polish Sausage, Coleslaw, Fries, and BBQ sauce on a bun. It was drenched in sauce, making the bun soggy. It was not bad but was not all that. The sauce is not very good for BBQ. It is runny like Open Pit and has a little zing to it. Adam Richman was high when he said this sauce was incredible.\n\nChicken: Very good chicken, dark meat. The breading was very crispy and the meat was juicy. I enjoyed this part of the meal.\n\nOverall, I would not return. No place should treat their guests with such arrogance and ineptness. I think I would rather take my money to Popeye's, its most comparable match.", "id": 390}
{"text": "The food was okay. The wings and fries were not that fresh and very little chicken came on the bone. The sauce was ok. I like Open Pit Bar B Que's (Cleveland, OH) sauce better because it's sweeter. I tried this because it was on the travel channel. It really wasn't that good. I like Harold's Chicken Shack in Atlanta and Chicago way better when it comes to chicken and sauce.", "id": 391}
{"text": "Despite being slathered in their sauce, this fried chicken surprisingly maintains its crispiness and isn't the least bit overpowered by the flavors of the sauce. Actually, the sauce compliments the chicken so well that it had me asking for more- I even bought a bottle of their original sauce for the road since we were just visiting Cleveland.\nOf the two sides that were ordered, the mac n cheese tastes similar to a homemade baked dish packed with cheesy goodness. The fried okra was decent, but was coated in so much batter that I could barely taste the okra.\nIn addition to the good food, the service is also worth mentioning- everyone behind the counter was hospitable and made for a great first visit to Hot Sauce Williams", "id": 392}
{"text": "I can't remember the last time I ate here because it has been that long. Well it will be my last... The menu on Yelp quotes one price so a slab dinner 19.95 when I pick up my food it's $29. The girl at the register rude even when you call in to order  tone very dry... Food over I should have saved myself the trouble and gas and just pulled out my own grill!", "id": 393}
{"text": "I'm going to keep my review short and sweet! \n\nPolish Boy and the wings, OFF THE CHAIN!\n\nNuff siad!", "id": 394}
{"text": "hot sauce williams is amazing, but it is certainly not a place to go for a low calorie meal. fried chicken, st. louis style ribs, mac n cheese, sweet potato pie, etc. it's all awesome. the fried chicken is done perfectly! my mouth waters just thinking of this place. its a simple place, you order from a counter and can either take your food to go or eat it there. all that matters is the food is killer!", "id": 395}
{"text": "I've been going to Hot Sauce Williams for the past 15 years and this place is going down hill big time!  The service continues to get worse and the attitude of the workers is piss poor.  They ignore you and can be very rude as well.  Also, the place is very dirty and I would love to see the health inspection report.  \n\nI will admit there Sauce is some of the best I have ever had.  The wings are just not as good as they used too, but the Polish Boy is still very good.  The Mac n Cheese is very overrated and DO NOT ORDER THE RIBS.  They are like chowing down on a gristled piece of fat and that has the texture of rubber.  My friend tossed them away they were so bad.  \n\nVery sad to see an Cleveland Institution goes down the tubes like this and hope they can improve but that's the last they have seen of my business.  \n\nP.S-Don't even bother going through the drive thru unless you have 20 mins to spare, no joke.", "id": 396}
{"text": "My girlfriend and I been dying to try this place for sometime, but never found the motivation to go until we saw the Anthony Bourdain episode when he was in Cleveland. We ordered the Family Meal (Full Slab, 8 Pcs of Chicken and 2 sides). When we ordered most of the sides were not available so our choices were limited.  I've seen their slogan around town \"Voted #1 for Ribs\" so we were excited, but after taking our first bite into those saucy ribs, we looked at each other and said \"meh\" as we have had better. The chicken on the other hand, drenched in BBQ sauce, was interesting. It was saucy yet crispy so it was an interesting dish, we probably favor the chicken over the ribs. The family meal is large so make sure you have plenty of mouths to feed, as for us we'll need to hit the gym for the next several days to burn off the calories we just packed on.", "id": 397}
{"text": "Worst food I've ever had the laziest service. We ended up throwing 35 dollars in the trash. If you like getting sick or experience all time lows check this place out!", "id": 398}
{"text": "The polish girl was good overall but the sauce was a little too sweet for my taste. The fried chicken was also a plus.", "id": 399}
{"text": "I have been going here for at long time and its one of few places I can overlook bad service because I love the food. The wings are great, best wings in Cleveland but the best offering from here is the barbeque sauce. Better service and it would be 5 stars.", "id": 400}
{"text": "All I can say is that both the food and the restaurant were completely disgusting. The pork shoulder tasted like it was two weeks old and reheated in a microwave. Their fries were cold and mushy. The cole slaw was the only edible thing they gave me. The whole meal was so bad I threw it in garbage after two bites. To go along with the terrible food the inside of the restaurant was dirty and had a strange smell. It's probably not necessary to say, but I will never set foot in Hot Sauce Williams again.", "id": 401}
{"text": "Hot Sauce Williams takes the best BBQ in Cleveland in my option. The home made mac and cheese is astonishing. The chicken is drenched in sauce and you just have to saver the flavor. I love to lick my fingers clean to finish off my meal.", "id": 402}
{"text": "The chicken isn't what makes this place great.  It's good but it becomes something different entirely when you smother it in the signature sweet, juicy sauce.  My God, I'd smother my limbs in this and eat my own arms.  It's that good.  Get that and some of the mac n cheese and you're in heart attack heaven.  But it's so good you won't care!  Also, all this crap about \"Oh i might get shot\" or \"Don't venture here at night\".  This is Cleveland, kids.  It's rough.  But I'd rather venture into a rough neighborhood than spend my time kickin' it at Applebee's in the safety and comfort of some designed suburb eating crap ass Jack Daniel glazed \"riblets.\"  Do yourself a favor, venture out of your comfort zone and get some good chicken...and extra sauce  You'll be super happy you did.", "id": 403}
{"text": "This is probably going to be one of my favorite places that I stopped at on my cross-country trip...thanks yelpers for letting me know it's worth going to the shadier part of cleveland (which isn't THAT bad) to get my grub on.\n\nThe two things you have to get when you go to this joint are the macaroni and cheese (my husband says it's the best he ever had and he's a snob when it comes to fatty foods) and the fried chicken (this was so juicy and flavorful on this inside and deliciously crispy on the outside). OMG, seriously run there is you have the privilege of being in Cleveland. \n\nOh, and a few other pointers:\nCornbread was not good at all.\nI didn't try the coleslaw because it was super lathered in mayo.\nWe also had the pulled pork sandwich, which was really good too. The bbq sauce is flavorful, but not hot at all. I liked it on the pork, but I'm glad I didn't get the fried chicken drenched in the sauce - better on its own.", "id": 404}
{"text": "I wont lie.. I was a little scared to enter this restaurant. I have always wanted to eat here but the location on Lee has a horrible reputation for .. well if haven't heard.. picture the scene from Animal house when they all walk into the bar where Otis is playing.. Nuf said. \nI had heard that Man Vs Food was at this location, so i figured i would give it a shot. Upon entering most places the food network has been you will notice that not only do the places raise their prices, but pictures and plaques are everywhere commemorating the event. Had you not seen the episode, you would never know they had been there.. Its as if they couldn't have cared less.. \nSo i asked the girl.. \"Whats good\"  and with out even hesitation she fires back \"You gotta try the polish girl and you might as well have the fried chicken too..\" With that type of certainty.. i had to reply \"Well. OK!\" She then asked me \"You want our sauce on your chicken?\" To which i asked \" I dont know, do i?\" She promptly said yes and ladled it on. For those who dont know.. A polish girl is a sausage (hot dog like) on a bun with french fries, pulled pork, coleslaw and their sauce.. Its about as good of a sandwich as you will ever taste. \nNow fellow Yelpers.. I have been known to exaggerate a little to heighten the effectiveness and entertainment value of a good story.. But i say to you today.... That is the best fried chicken that has ever passed my lips. The very wise and helpful woman who took my order was appreciated ever time i took a bite of that chicken. That sauce.. complimenting an already outstanding chicken breast.. I well up with tears just thinking about how unbelievably good that food was. \n\nOn another note.. Buy a F*cking mop already.. The place is absolutely deplorable. I needed rubber gloves and a hasmat suit to enter the place. Seriously... what is that 10 years of grime on the molding? Its absolutely disgusting. How you havent been sited is beyond me.. Perhaps people are so blinded by the food (as i was) that they don't notice or care. You would have had 5 stars, but i just couldn't get over how dirty it was..", "id": 405}
{"text": "Forget about the place and service (which were fine) and let's talk about the food!  The Polish Boy was good, but the fried chicken was AMAZING!!  And the sauce was killer!", "id": 406}
{"text": "Came here on Saturday evening and there was a line about 10 people in front of me. I ordered a 3 pieces white dinner and was expected to get my food within 10-15 mins; however it took me about more than half hour to get the food. It's fair to say that efficiency was not their priority. Despite the service the food was absolutely amazing. Great value with great taste. The chicken breasts were tender and not too oily. The sauce was top natch.", "id": 407}
{"text": "Solid BBQ spot- definitely recommend! \nPros: Reasonably priced and delicious. \nCons: Food was pre-prepared and clearly sitting out a while before we got there. \n\nThe taste and flavor are outstanding! I kept it simple and ordered Ribs and fries. Sauce had me like \"mmmmmm mmhhhmmmm\" and ribs were like \"Ahhhhh yaaa ahhhhh.\" Great time had by all!", "id": 408}
{"text": "Got the chicken and ribs dinner with green beans and fries. All delicious. Pretty much as close to being in the south as you can get in Cleveland.  Served in foam carry out trays, fancy. The only thing lacking was the service but really I expected that.", "id": 409}
{"text": "Manager, please delete this review after owner of Yelp has read . . . Thank you.\n\nWell, let me tell you.  I love he food here!  However, I had a costly-to-owner and manager, and a terrible experience today (well, the 12th a Wednesday), and they need to know if they want to keep customers!!!  Who knows how many people just walk out because of the rude and slow staff - I'm sure they do it all the time and just don't tell the boss.  Here is what I am trying to comm